const Player = function(name, mainClass, items) {
    return {
        name: name,
        mainClass: mainClass,
        items: items,
        bankroll: 0,
        popularity: 0,
        virulance: 0,
        achivmentsCount: 0,
        cardsArr: []
    }
};

const Game = function(players) {
    return {
        players: [players],
        goal: 'Провести вечеринку на Кирилловской',
        winCondition: 'Иметь самый большой капитал'
    }
}

const PlayerClass = function(className, defaultItems, specialSkill, activeSkill, ultimateSkill) {
    return {
        className: className,
        defaultItems: defaultItems,
        specialSkill: specialSkill, // может быть использован в свой ход(или как действие?)
        activeSkill: activeSkill, // может быть использован в любой момент
        ultimateSkill: ultimateSkill, // может быть использован только в свой ход, только после удовлетворения всех условий
        allClassesArr: ['tattooer', 'rapper', 'organizer', 'dj', 'painter', 'support', 'tea', 'shooter', 'medic', 'seller', 'buttrfly', 'cook', 'designer', 'trash', 'terapevt', 'bomber', 'cleaner', 'photographer', 'maf', 'driver'],
        help: 'Классы отличаются размером источника дохода и доступными действиями, пассивными и ультимативными навыками, характеристиками, репутацией, бафами и дебафами. Свойства одних классов дополняют другие, делая договорные действия и альянсы привлекательными.'
    }
}

const Skill = function(type, name, activate, help) {
    return {
        type: type,
        name: name,
        activate: activate,
        help: help
    }
}

const PlayerClassTattooer = new PlayerClass('tattooer', ['tattoo kit', 'clean', 'watcher'], new Skill('special', 'Набить татуировку', function() {
    // Набивает татуировку
    // Каждая - особое свойство и +популярность
    // Требует тату кит
    // Приносит деньги
    // Если есть карты студии, света, кушетки, принтера, может приносить больше денег
}));
const PlayerClassRapper = new PlayerClass('rapper', [], new Skill('special', 'Зафристайлить', function() {
    // читает фристайл
    // шанс записать демо
    // может привлечь заказ
}), new Skill('active', 'Показать демо', function() {
    // показывает демо одному игроку
    // шанс получить заказ в случае успеха
    // шанс получить проблему в случае неуспеха
}), new Skill('ultimate', 'Записаться', function() {
    // записывает
    // требует денег
    // дает популярность
    // если есть карта студии или аппаратуры, может стоить дешевле
    // если сделать анонс, дает популярность х2
    // если сделать трансляцию, дает доп. популярность
}));
const PlayerClassDj = new PlayerClass('dj', ['DDJ-400']);
const PlayerClassTea = new PlayerClass('tea', ['tea kit']);
const PlayerClassShooter = new PlayerClass('shooter', ['AK-47']);
const PlayerClassOrganazier = new PlayerClass('organizer', []);
const PlayerClassDriver = new PlayerClass('driver', []);

const Order = function(name, level, day, budget, requiredItems, royalty, fail) {
    return {
        name: name,
        level: level,
        day: day,
        budget: budget,
        requiredItems: requiredItems,
        royalty: royalty,
        fail: fail
    }
}

const Problem = function(name, description) {
    return {
        name: name,
        description: description
    }
}

const Action = function(name, description, price, requiredItems, getProfit, setBaf, setDebaf) {
    return {
        name: name,
        description: description,
        price: price,
        requiredItems: requiredItems,
        getProfit: getProfit,
        setBaf: setBaf,
        setDebaf: setDebaf
    }
}

const ActionCard = function(day, night) {
    return {
        day: day,
        night: night,
        disabled: false
    }
}

const ActionPad = function(actions) {
    const maxCount = 4;
    return {
        actions: [actions],
        lastDone: null,
        addAction: function() {},
        removeAction: function() {},
        disableAction: function() {}
    }
}

const NAVISCHO = new Player('Navischo', 'tattooer', ['tattoo kit', 'DDJ-400']);
const ANTI = new Game(NAVISCHO);
const acidParty = new Order('Acid Party', 1, 'Saturday', 5000, ['DDJ-400'], 25000, 'Потеря популярности');
const oblava = new Problem('Oblava', 'Дай наводку на клуб в полицию. Все игроки причастные к заказу пропускают один день и теряют телефоны. Если ивент без охраны, касса наличных исчезает');
const actionWork = new Action('Работа', 'Сделай работу чтобы получить деньги', 0, [], function() {
    // выбирает исполнителя и дает ему профит
});

console.log(ANTI, acidParty, oblava);

// Массивы карт:
// колода дверей
// колода сокровищ
// сброс

// рука
// стол

// Карты перемещаются между массивами

// Объект карты:
// Название
// Описание
// Карта монстра
// +Уровень
// +Непотребство
// +Сокровища
// Карта сокровища
// +Бонус
// +Цена

class Card {
    constructor(name, description) {
        this.name = name;
        this.description = description;
    }
}

class ContractCard extends Card {
    constructor(name, description, lvl, penalty, profit) {
        super(name, description);
        this.lvl = lvl;
        this.penalty = penalty;
        this.profit = profit;
    }
}

class LootCard extends Card {
    constructor(name, description, bonus, cost) {
        super(name, description);
        this.bonus = bonus;
        this.cost = cost;
    }
}

const initDoorsArr = () => {
    const DoorsArr = [];

    DoorsArr.push(new ContractCard('Рыгачу', 'Получи дополнительный уровень, если победил его без помощи, и без бонусов', 6, 'Рвота, в атаку! Придется сбросить всю руку.', '2 сокровища'));
    const wanderingMonster = new Card('Бродячая тварь', 'Играй вместе с монстром с руки в любой бой(можно в свой). Твой монстр присоеденяется к тем, что уже бьются, - сложи их боевые силы. При поражении манчкин, бившийся с ними, делает отдельные броски смывки в любом угодном ему порядке.');
    // const wanderingMonster = new Card('Сверхурочньій заказ', 'Играй вместе с заказом с руки в любой ивент(можно в свой). Твой заказ присоеденяется к тем, что уже проводятся, - сложи их ожидания публики. При поражении организатор, вьіполнявший их, делает отдельные броски отказа от отвественности в любом угодном ему порядке.');
    DoorsArr.push(wanderingMonster);
    DoorsArr.push(new Card('Потеряй большую шмотку', 'Выбери и сбрось большую шмотку.'));
    // DoorsArr.push(new Card('Проблема! Потеряй большую шмотку', 'Завистник подговорил торча украсть у тебя большую вещь. Выбери и сбрось большую шмотку.'));
    DoorsArr.push(new ContractCard('Бледные братья', 'Не преследуют манчкинов 3-го уровня и ниже. Более развитые герои, если не смогли победить, теряют 2 уровня', 16, 'Вернись на 1-й уровень', '2 уровня 4 сокровища'));
    // DoorsArr.push(new ContractCard('???', 'Игроки с репутацией 3-го уровня и ниже могут не принимать заказ. Более развитые герои, если не смогли победить, теряют 2 уровня', 16, 'Вернись на 1-й уровень', '+2 репутация 4 айтема'));
    // По идее все заказьі добровольньіе, в идеале определиться с єтим моментом. Например если доставший заказ игрок его отклоняет, его может взять любой другой игрок.
    // Важная задумка бьіла в том чтобьі за успешно вьіполненньій заказ игроки получали прибьіль, размер которой зависит от кол-ва гостей. В идеале заменить вьідачу айтемов на єту механику
    DoorsArr.push(new Card('Потому что мы банда!', 'Играй в любой бой(можно и в свой) вместе с любым количеством монстров с руки. Монстры присоединяются к тем, что уже бьются, - сложи их боевые силы. При поражении манчкины, бившиеся с ними, делают отдельные броски смывки в любом угодном порядке.'));
    // DoorsArr.push(new Card('Потому что мы можем!', 'Играй в любой ивент(можно и в свой) вместе с любым количеством заказов с руки. Заказьі присоединяются к тем, что уже вьіполняются, - сложи их боевые силы. При неуспехе игроки, вьіполнявшие их, делают отдельные броски ухода от ответственности в любом угодном порядке.'));
    const halfBreedCard = new Card('Полукровка', 'У тебя может быть две расы со всеми преимуществами и недостатками обеих. Либо можешь избавить свою единственную расу от всех её недостатков (так, монстры, ненавидящие эльфов, не получат бонуса в бою против полуэльфа). Сбрось эту карту если потерял все свои расы.');
    // const halfBreedCard = new Card('Подвійна пристрасть', 'В тебе може бути два класи з усіма перевагами та недоліками обох. Або можеш звільнити свій єдиний клас від усіх його недоліків(так, замовлення, в яких не має бути діджеїв, не втрачають відвідувачів якщо діджеї там з'являться). Скинь цю карту якщо втратив усі свої класи.');
    DoorsArr.push(halfBreedCard);
    DoorsArr.push(new Card('Потеряй класс!'));
    // DoorsArr.push(new Card('Проблема! Потеряй класс!'));
    const warriorCard = new Card('Воин', 'Буйство: можешь сбросить до трех карт в бою. Каждая даст тебе бонус +1. Ты побеждаешь при равенстве сил в бою.');
    // const warriorCard = new Card('DJ', 'Поставить музьіку: на протяжении игрьі может ставить музьіку. Если каждьій игрок ее похвалит, он записьівает сет, которьій может принести ему заработок. Если каждьій скажет что музьіка не та, теряешь класс.');
    DoorsArr.push(warriorCard);
    DoorsArr.push(new ContractCard('Невыразимо жуткий неописуемый ужас', '+4 против Воинов', 14, 'Непотребство: невыразимо жуткая смерть для всех, кроме волшебника. Волшебник лишается могущества - сбрось карту Волшебник.', '4 сокровища'));
    // DoorsArr.push(new ContractCard('???', 'ожидания +4 если вьіполняет DJ', 14, 'Непотребство: невыразимо жуткий штраф для всех, кроме DJ. DJ больше никому не нужен - сбрось карту DJ.', '4 айтема'));
    DoorsArr.push(new Card('Потеряй надетый броник!'));
    // DoorsArr.push(new Card('Проблема! Потеряй надетый лук!'));
    DoorsArr.push(new Card('Громадный', '+10 монстру. Играй в любой бой. За побежденного громадного монстра тяни на два сокровища больше.'));
    // DoorsArr.push(new Card('Репост селебьі', '+10 ожиданиям. Играй в любой ивент. За успешно проведенньій пропиаренньій ивент тяни на два айтема больше.'));
    DoorsArr.push(new ContractCard('Царь Тут', 'Андед. Не преследует манчкинов 3-го уровня и ниже. Более развитые герои, если не смогли победить, теряют 2 уровня.', 16, 'Сбровь все свои шмотки и всю руку!', '2 уровня 4 сокровища'));
    // DoorsArr.push(new ContractCard('???', 'Фестиваль. Игроки с репутацией 3-го уровня и ниже могут не принимать заказ. Более развитые герои, если не смогли победить, теряют 2 уровня.', 16, 'Инвестор слетает с катушек и трощит аппаратуру. Сбрось все свои айтемьі и всю руку!', '+2 репутация 4 айтема'));
    DoorsArr.push(new Card('Божественное вмешательство', 'Ты должен сыграть эту карту, как только её получил. Все клирики тут же получают уровень! Этот уровень может быть победным. Если ты победил за счёт этой карты, то вправе подвергнуть соперников безжалостному осмеянию.'));
    // DoorsArr.push(new Card('Божественное вмешательство', 'Ты должен сыграть эту карту, как только её получил. Все DJ тут же получают заказ на вечеринку на Кирилловской! Найди карту заказа вечеринки на Кирилловской и сразу ее активируй. После проведения єтой вечеринки игра закончится. Если ты победил за счёт этой карты, то вправе подвергнуть соперников безжалостному осмеянию.'));
    DoorsArr.push(new Card('Скрытный', '+5 монстру и ещё +5 против воров! Играй в любой бой. За побежденного скрытного монстра тяни на одно сокровище больше.'));
    // DoorsArr.push(new Card('Андерграундньій', '+5 ожидания к ивенту и ещё +5 ожиданияя если вьіполняет Орг! Играй в любой ивент. За успешньій андерграундньій ивент тяни на один айтем больше.'));
    DoorsArr.push(new Card('Невыносимо гнусное проклятье!', 'Потеряй шмотку, которая дает тебе наибольший бонус!'));
    // DoorsArr.push(new Card('Невыносимо гнусная проблема!', 'Потеряй айтем, которьій дает тебе наибольший бонус!'));
    DoorsArr.push(new Card('Роковой нырок!', 'Потеряй 2 уровня, чтобы неповадно было впредь подбирать птиц в подземельях.'));
    // DoorsArr.push(new Card('Проблема! Неопраданньіе сплетни!', 'Получи -2 репутации, чтобы неповадно было впредь цеплять девчонок на вечеринках.'));
    const clericCard = new Card('Клирик', 'Воскрешение: когда положено тянуть карты в открытую, можешь вместо всех или некоторых брать верхние карты из соответствующего сброса. Затем за каждую "Воскрешенную" карту сбрось одну карту с руки. Изгнание: можешь сбросить до трех карт в бою против андеда(ов). Получи бонус +3 за каждую сброшенную карту.');
    // const clericCard = new Card('Татуер', 'Набить татуху: наносит тебе татуировку которая дает особое свойство и репутацию. Тату на ивенте: может набить татуировку одному из гостей, повьісив его впечатления до максимума и принеся до 40% от заработка в кассу.');
    // Какое свойство єто должно бьіть? Возможно он будет делать свойство какого-то айтема постоянньім?
    // По изначальной задумке чтобьі набить татуху игрок вьібирает один из предложенньіх єскизов. В таком случае свойство прописано на самом єскизе. А может там будет просто єскиз, свойство которого будет определяться в момент набития?
    DoorsArr.push(clericCard);
    DoorsArr.push(new ContractCard('Г-н Костин', 'Андед. Если от него пришлось смываться, потеряй уровень, даже если успешно смылся.', 2, 'Его костлявые прикосновения снимают с тебя 2 уровня.', '1 сокровище'));
    // DoorsArr.push(new ContractCard('???', 'Фестиваль. Если пришлось избегать ответственности, получи -1 репутации, даже если успешно смылся.', 2, 'Обиженная админша рассказьівает всем подружкам какой тьі мудак, -2 репутации.', '1 айтем'));
    DoorsArr.push(new ContractCard('Летучие лягушки', 'У тебя -1 на смывку.', 2, 'Острые лягушачьи клыки сгрызают с тебя 2 уровня.', '1 сокровище'));
    // DoorsArr.push(new ContractCard('???', 'У тебя -1 на уход от ответственности.', 2, 'Недовольньій посетитель делает сториз, -2 репутации.', '1 айтем'));
    DoorsArr.push(new Card('Умудренный', '+5 к монстру. Играй в любой бой. За побежденного умудрённого монстра тяни на одно сокровище больше.'));
    // DoorsArr.push(new Card('Нишевьій', '+5 к ожиданиям. Играй в любой ивент. За успешно проведенньій нишевьій ивент тяни на один айтем больше.'));
    DoorsArr.push(new Card('Чит!', 'Играй эту карту на шмотку у тебя в игре либо вместе со шмоткой с руки. Можешь использовать эту шмотку, даже если иначе ты этого делать не в праве. Сбрось "Чит!" при потере(продаже и т.п.) этой шмотки.'));
    // DoorsArr.push(new Card('Чит!', 'Играй эту карту на айтем у тебя в игре либо вместе с айтемом с руки. Можешь использовать этот айтем, даже если иначе ты этого делать не в праве. Сбрось "Чит!" при потере(продаже и т.п.) этого айтема.'));
    DoorsArr.push(new Card('Увечный гоблин', 'У тебя +1 на смывку.', 1, 'Лупцует тебя костылем. Потеряй уровень.', '1 сокровище'));
    // DoorsArr.push(new Card('???', 'У тебя +1 на уход от ответственности.', 1, 'Лупцует тебя костылем. Потеряй 1 репутации.', '1 айтем'));
    const dwarfCard = new Card('Дварф', 'У тебя в игре может быть любое кол-во больших шмоток. В конце хода можешь оставлять в руке по 6 карт.');
    DoorsArr.push(dwarfCard);
    const loseLevelCard = new Card('Потеряй уровень!');
    // const loseLevelCard = new Card('Проблема! Втрать репутацію!');
    DoorsArr.push(loseLevelCard);
    const thiefCard = new Card('Вор', 'Подрезка: можешь сбросить карту, чтобы подрезать другого манчкина в бою(-2 к боевой силе). Одну жертву ты не вправе подрезать больше раза за бой, но можно подрезать помощника. Кража: можешь сбросить карту и бросить кубик, чтобы попытаться украсть у соперника мелкую шмотку. На 4 и больше кража удалась. На 3 и меньше тебя мутузят: потеряй уровень.');
    DoorsArr.push(thiefCard);
    const elfCard = new Card('Эльф', 'У тебя +1 на смывку. Получай уровень за каждого монстра, которого помог убить.');
    DoorsArr.push(elfCard);
    DoorsArr.push(new ContractCard('Конь андедный', '+5 против дварфов', 4, 'Лягает, кусает и жутко воняет. Потеряй 2 уровня', '2 сокровища'));
    const wizardCard = new Card('Волшебник', 'Полёт: можешь сбросить до трех карт после броска смывки; каждая даст +1 на смывку. Усмирение: можешь сбросить всю руку(не менее трех карт!), чтобы усмирить одного монстра в бою. Сбрось его. Он отдаст тебе свои сокровища, но не даст уровень. С другими монстрами этого боя придется биться.');
    DoorsArr.push(wizardCard);
    DoorsArr.push(warriorCard);
    DoorsArr.push(new Card('Смена класса', 'Если у тебя не класса, это проклятие не действует. Если есть, прочеши сброс сверху вних. Первый найденный класс заменит все твои нынешние. Если в сбросе нет карт классов, просто потеряй все свои текущие классы.'));
    DoorsArr.push(thiefCard);
    DoorsArr.push(new ContractCard('Гикающий гик', '+6 против воинов', 6, 'Стань нормальным, сбрось все ссвои расы и классы', '2 сокровища'));
    DoorsArr.push(new ContractCard('Сочащаяся слизь', 'Какая мерзость! +4 против эльфов', 1, 'Потеряй надетую обувку. Если нет обувки, потеряй уровень.', '1 сокровище'));
    DoorsArr.push(new ContractCard('Улетные улитки', 'У тебя на смывку -2', 4, 'Разворовывают твои сокровища. Сбрось столько шмоток из игры или карт с руки(по своему выбору), сколько выпадет на кубике.', '2 сокровища'));
    DoorsArr.push(new ContractCard('Бигфут', '+3 против дварфов', 12, 'Наступает на тебя и съедает шляпу. Потеряй надетый головняк.', '3 сокровища'));
    DoorsArr.push(new Card('Хафлинг', 'Раз в ход можешь продать одну шмотку за двойную цену (и другие шмотки по обычным ценам). Провалив первый бросок смывки, можешь сбросить карту для второй попытки.'));
    DoorsArr.push(new Card('Потеряй две карты!', 'Сначала левый сосед тянет у жертвы с руки одну карту и оставляет её себе, затем то же делает правый сосед.'));
    // DoorsArr.push(new Card('Проблема! Втрать дві карти!', 'Спочатку лівий сусід тягне в жертви з руки одну карту та залишає її собі, потім те саме робить правий сусід.'));
    DoorsArr.push(new Card('Кривое зеркало!', 'Ты проклят! В твоём следующем бою (и только в нем) изо всех твоих шмоток бонус остаётся только у броника. Найдёшь до боя хотельное кольцо - сможешь снять это проклятие.'));
    // DoorsArr.push(new Card('Проблема! Чорний піар!', 'В тебе проблема! На твоєму наступному івенті (та тільки в ньому) з усіх твоїх айтемів бонус залишається тільки в деки. Знайдеш до івенту кільце-забажайку - зможеш зняти цю проблему.'));
    DoorsArr.push(new Card('Грудной', '-5 монстру. Играй в любой бой. За побежденного грудного монстра тяни на одно сокровище меньше(но не меньше одного).'));
    // DoorsArr.push(new Card('Локальний', '-5 до очікувань від івенту. Играй в будь-який івент. За успішний локальний івент тягни на один айтем меньше(але не меньше одного).'));
    DoorsArr.push(wanderingMonster);
    DoorsArr.push(new ContractCard('Блуждающий нос', 'Не горишь желанием разбить нос в честном бою? Подкупи его шмоткой с ценой не меньше 200 голдов, и нос уйдет', 10, 'Он ещё тот нюхач, и от него нельзя смыться. Ничто не поможет избежать непотребства. Потеряй 3 уровня', '3 сокровища'));
    // DoorsArr.push(new ContractCard('Сет біля метро', 'Не гориш бажанням ставити треки по замовленню? Пригости усіх бецкою на 200 голдів і аудиторія буде задоволена, але айтеми ти не отримаєш', 10, 'Тут ще та публіка, від неї не втечеш. Ніщо не дозволить уникнути відповідальності за провал. Втрать 3 репутації', '3 сокровища'));
    const loseSmallItemCard = new Card('Потеряй мелкую шмотку', 'Выбери и сбрось одну мелкую шмотку. Шмотка считается мелкой, если про неё не сказано, что она большая.');
    // const loseSmallItemCard = new Card('Втрать дрібний айтем', 'Обери та скинь один дрібний айтем. Айтем вважається дрібним, якщо про нього не сказано, що він великий.');
    DoorsArr.push(loseSmallItemCard);
    DoorsArr.push(new ContractCard('Гарпистки', 'Сопротивляются магии. +5 против волшебников.', 4, 'Хреново исполняют ужасную музыку. Потеряй 2 уровня.', '2 сокровища'));
    DoorsArr.push(new ContractCard('Лепрекон', 'Да он отвратителен! +5 против эльфов.', 4, 'Забирает у тебя две шмотки - первую выбирает правый сосед, вторую левый. Сбрось эти шмотки.', '2 сокровища'));
    DoorsArr.push(new ContractCard('Обдолбанный голем', 'Можешь биться или пройти мимо, плюнув на обдолбанного голема и его сокровища. Исключение: вкусно выглядящим хафлингам придётся биться.', 14, 'Его пробивает на хавку. Ты съеден и мёртв.', '4 сокровища'));
    DoorsArr.push(new ContractCard('Амазонка', 'Не бьётся с женщинами; вместо боя дает одно сокровище.', 8, 'Тебя вздула женщина! Ущемление гордости в тяжелой форме. Потеряй все свои классы. Если у тебя нет класса, потеряй 3 уровня.', '2 сокровища'));
    DoorsArr.push(new Card('Помоги, чем можешь!', 'Играй во время своего бо, чтобы забрать одну шмотку у любого соперника, сли в этот момент она может изменить результат боя в твою пользу. При желании можешь сбросить что-то своё перед захватом шмотки.'));
    // DoorsArr.push(new Card('Допоможи, чим можеш!', 'Грай в свій івент, щоб забрати один айтем в будь-якого суперника, якщо в цей момент він може привести івент до успіху. При бажанні можеш скинути щось своє перед захватом айтему.'));
    DoorsArr.push(new Card('Потеряй расу!', 'Сбрось из игры все свои расы и стань человеком'));
    // DoorsArr.push(new Card('Проблема! Втрать клас!', 'Скинь з гри усі свої класи та стань Найомничком'));
    DoorsArr.push(loseSmallItemCard);
    DoorsArr.push(new ContractCard('Языческий демон', 'Выходец из ада. +4 против клириков. Ты должен сбросить одну шмотку по своему выбору до боя.', 12, 'Отвратительный поцелуй лишает тебя двух, а если ты эльф - трех, уровней', '3 сокровища'));
    DoorsArr.push(dwarfCard);
    DoorsArr.push(elfCard);
    DoorsArr.push(new ContractCard('Бульрог', 'Не преследует манчкинов 4-го уровня и ниже', 18, 'Ты запорот до смерти.', '2 уровня 5 сокровищ'));
    DoorsArr.push(clericCard);
    DoorsArr.push(new ContractCard('Гиппогриф', 'Не преследует манчкинов 3-го уровня и ниже.', 16, 'Ты потоптан и покусан, да ещё растерял шмот. Начиная с правого соседа, каждый игрок берёт одно сокровище у тебя из игры или(не глядя) с руки', '2 уровня 4 сокровища'));
    DoorsArr.push(new Card('Подоходный налог', 'Выбери и сбрось шмотку. Теперь каждый соперник должен сбросить шмотки на сумму, не уступающую цене сброшенной тобой вещи. Те, кому нечем заплатить налог, сбрасывают все свои шмотки и теряют уровень.'));
    // DoorsArr.push(new Card('Підтримай ЗСУ!', 'Обери та скинь один айтем. Тепер кожен суперник має скинути айтеми на сумму, не меншу за ціну скинутого тобою айтему. Ті, кому нема що відправити, скидають всі свої айтеми та втрачають репутацію.'));
    DoorsArr.push(new ContractCard('Страховой агент', 'Твой уровень не считается. Победи его бонусами!', 14, 'Вынужден купить страховку. Потеряй шмотки на сумму 1000 голдов. Если столько шмоток у тебя нет, отдай всё, что есть.', '4 сокровища'));
    DoorsArr.push(new Card('Курица на башне', '-1 ко всем твои броскам кубика. Любое проклятие или непотребство, отнимающее у тебя головняк, забирает и курицу.'));
    // DoorsArr.push(new Card('Проблема! Сплутані думки', '-1 до всіх твоїх кидків кубика. Будь-яка проблема або неперелавки, що впливають на твою голову, забирають і Сплутані думки.'));
    const superManchkinCard = new Card('Суперманчкин', 'У тебя может быть два класса со всеми преимуществами и недостатками обоих. Либо можешь избавить свой единственный класс от всех его недостатков(так монстры с ненавистью к клирикам не получат бонус в бою против тебя, если ты суперманчкин и "чистый" клирик). Сбрось эту карту если потерял все свои классы.');
    // const superManchkinCard = new Card('Подвійна пристрасть', 'В тебе може бути два класи з усіма перевагами та недоліками обох. Або можеш звільнити свій єдиний клас від усіх його недоліків(так, замовлення, в яких не має бути діджеїв, не втрачають відвідувачів якщо діджеї там з'являться). Скинь цю карту якщо втратив усі свої класи.');
    DoorsArr.push(superManchkinCard);
    DoorsArr.push(new Card('Престарелый', 'Играй в любой бой. За побежденного престарелого монстра тяни на два сокровища больше.'));
    // DoorsArr.push(new Card('Професійний', 'Грай в будь-який івент. За успішний професійний івент тягни на два айтеми більше.'));
    DoorsArr.push(loseLevelCard);
    DoorsArr.push(new Card('Потеряй головняк!'));
    DoorsArr.push(new Card('Ультраманчкин', 'У тебя может быть два или три класса со всеми преимуществами и недостатками обоих. Либо можешь избавить свой единственный класс от всех его недостатков(так монстры с ненавистью к клирикам не получат бонус в бою против тебя, если ты суперманчкин и "чистый" клирик). Сбрось эту карту если потерял все свои классы.'));
    // DoorsArr.push(new Card('Надлюдина', 'В тебе може бути два або три класи з усіма перевагами та недоліками обох. Або можеш звільнити свій єдиний клас від усіх його недоліків(так, замовлення, в яких не має бути діджеїв, не втрачають відвідувачів якщо діджеї там з'являться). Скинь цю карту якщо втратив усі свої класи.'));
    DoorsArr.push(new Card('Смена расы', 'Если у тебя нет расы, это проклятие не действует. Если есть, прочеши сброс сверху вних. Первая найденная раса заменит все твои нынешние. Если в сбросе нет карт расы, просто потеряй все свои текущие расы.'));
    // DoorsArr.push(new Card('Проблема! Зміна спеціальності', 'Якщо в тебе немає класу, ця проблема не діє. Якщо є, прочеши сброс зверху вниз. Перший знайдений клас замінить усі твої нинішні. Якщо в сбросі нема карт класу, просто втрать всі свої діючі класи.'));
    DoorsArr.push(new ContractCard('Адвокат', 'Никогда не бьётся с ворами - корпоративная этика. Встретив адвоката, вор при желании может сбросить два сокровища и в закрытую взять два других(адвокат не бьётся с вором, даже если тот откажется от обмена).', 6, 'У тебя конфискуют имущетво. Каждый моперник, начиная с левого соседа, тянетпо карте с твоей руки. Сбрось оставшиеся карты.', '2 сокровища'));
    DoorsArr.push(new ContractCard('Питбуль', 'Не можешь одолеь его - отвлеки: брось любой жезл, посох или палку(апорт, Тузик), чтобы смыться автоматически.', 2, 'В зад укушенный герой - позорище. Потеряй 2 уровня', '1 сокровище'));
    DoorsArr.push(new ContractCard('3872 орка', '+6 против дварфов(там старые счёты).', 10, 'Брось кубик. На 2 и меньше ты затоптан до смерти, иначе потеряй столько уровней, сколько выпало.', '3 сокровища'));
    DoorsArr.push(clericCard);
    DoorsArr.push(new Card('Дуэлянт', 'Брось в другого игрока чтобы вызвать его на бой как монстра.'));
    DoorsArr.push(new ContractCard('Сердитый бройлер', 'Вкус жареной курицы придаст тебе сил. Получи дополнительный уровень, если убил бройлера огнём или пламенем.', 2, 'Недожареный петух клюнул тебя так, что теряешь уровень.', '1 сокровище'));
    DoorsArr.push(new ContractCard('Закос под вампира', 'Вместо боя клирик может отогнать этого монстра простым "Бу!" и забрать его сокровища. Уровня за такую расправу клирик не получит.', 12, 'Загородив выход, рассказывает о себе. Потеряй 3 уровня.', '3 сокровища'));
    DoorsArr.push(superManchkinCard);
    DoorsArr.push(wizardCard);
    DoorsArr.push(new Card('Морок', 'Играй в любой бой. Сбрось из боя одного монстра вместе со всеми наложенными на него усилителями. Замени его монстром с руки.'));
    DoorsArr.push(superManchkinCard);
    DoorsArr.push(new ContractCard('Мадемонуазели', 'В бою с ними никакие бонусы не помогут. Срази их размером уровня.', 8, 'Твой уровень падает до уровня самого низкоуровневого манчкина в игре.', '2 сокровища'));
    DoorsArr.push(new ContractCard('Сетевой троль', 'Ничего толком не умеет, потому и бесится.', 10, 'Ему плевать на баланс игры. Разреши самым высокоуровневым игрокам взять у тебя по шмотке на их выбор.', '3 сокровища'));
    DoorsArr.push(new ContractCard('Утконтикора', 'Сопротивляется магии. +6 против волшебников.', 6, 'Либо сбрось всю руку, либо потеряй 2 уровня', '2 сокровища'));
    DoorsArr.push(new ContractCard('Кальмадзилла', 'Противно! -4 в бою каждому эльфу. Не преследует манчкинов 4-го уровня и ниже, кроме эльфов.', 18, 'Ты схвачен, намочен, отфигачен и проглочен. Ты мёртв. Мертвее мёртвого. Вопросы?', '2 уровня 4 сокровища'));
    DoorsArr.push(halfBreedCard);
    DoorsArr.push(new Card('Смена пола', '-5 в твоём следующем бою из-за сметения. После этого штрафов не будет, но пол останется измененным.'));
    DoorsArr.push(new Card('Потеряй надетую обувку!'));
    DoorsArr.push(elfCard);
    DoorsArr.push(wanderingMonster);
    DoorsArr.push(new ContractCard('Желатиновый октаэдр', 'У тебя +1 на смывку', 2, 'Сбрось все свои большие шмотки', '1 сокровище'));
    DoorsArr.push(new Card('Ушёл на базу', 'Играй в любой бой, чтобы отправить на отдых монстров из этой комнаты. Игрок, который должен был биться с ними, сбрасывает их карты и тут же тянет два сокровища.'));
    DoorsArr.push(new Card('Разъяренный', '+5 к монстру. Играй в любой бой. За побежденного разъярённого монстра тяни на одно сокровище больше.'));
    DoorsArr.push(new ContractCard('Вошки', 'Смыться от них нельзя!', 1, 'Сбрось бронник и все вещи надетые ниже пояса.', '1 сокровище'));
    DoorsArr.push(new ContractCard('Газебо', 'Никто не поможет тебе. Уважающий себя манчкин должен расправиться с Газебо сам.', 8, 'Потеряй 3 уровня', '2 сокровища'));
    DoorsArr.push(new ContractCard('Лицесос', 'Экая пакость! +6 против эльфов', 8, 'Усердно ссасывает с тебя лицо. Потеряй надетый головняк и уровень.', '2 сокровища'));

    console.log(DoorsArr);
    return DoorsArr;
}
//
// Какие мероприятия тебе интересно провести?
// CHILLOUT3000, Карпатьі, 1000, 30, 3000, Неделя в приватном доме в карпатах с возможностью играть музьіку, снимать фильм, бить татуировки, продавать чай, продавать мерч, готовить, просто чилить и отрьіваться по полной, Раз в год, Необходимо приглашение Влада
// KYIV 1991 Киев, 0, 10, Свободньій донейшн, Пятница 15-20 в 1991 где Навіщо делает открьітьій микрофон, Оливье фристайлит и снимает стрим, Макс делает чай, а Артур продает товарьі. В свободное от работьі время можно дунуть, обсудить отправку в тур и поиграть в PS2, По запросу, Необходимо присутствие Артура. Маленькое пространство.  || +1000 на аппаратуру
// ODESSA 1991, Одеса, 1000, 4, Только по приглашениям, Уикенд в квартире Макса с возможностью гулять по пляжу, снимать фильм, играть в настолки и висеть с лучшими корешами, По запросу, Необходимо присутвие Макса || +3000 на квартиру
// LVIV 1991, Львов, 1000, 4, Только по приглашениям и 200/ночь для местньіх, Понедельник-Вторник во Львове с возможностью поиграть музьіку с ноута, показать фильм, есть шоколад, продавать чай, шабить, продавать мерч, готовить, рисовать и просто забьівать о проблемах, По запросу, Найти вписку || +3000 на квартиру
// SECRET LEVEL 1991, Карпатьі, 1000, 4, Только по приглашениям, Среда-Четверг в Карпатах у друга Артура, где можно показать фильм, поиграть музьіку, побить татухи друг-другу, попить чай, дунуть, поготовить и просто расслабиться, По запросу, Необходимо присутствие Артура || +3000 на квартиру
// KYIV 1991 X GRAY CAT Киев, 0, 10, 100, Пятница 15-20 в GRAY CAT где Навіщо делает открьітьій микрофон, Оливье фристайлит и снимает стрим, Макс делает чай, а Артур продает товарьі. В свободное от работьі время можно дунуть, обсудить успехи тура, По запросу, Необходим зеленьій свет от Богдана || +1000 на аппаратуру
// GREEN HOUSE Art Residency, Студия 20кв, 420/сутки, 12000/мес, -50% во время войньі
// GRAY CAT, Клуб 80кв, 1000/сутки, ???/мес, Нужен зеленьій свет от Богдана
// OTEL', Клуб 200кв, 1000/час, ???/мес, -50% во время войньі
// CLOSER, Клуб 300-500кв, ???/час, ???/мес, Нужен контакт
// KELLER, Клуб 250кв, ???/час, ???/мес, Нужен контакт
// 1991, Студия 10кв с вьісокими потолками, ???/сутки, ???/мес, Нужен зеленьій свет от Артура
// COLAIDER, Клуб 200кв, ???/час, ???/мес, Нужен контакт
// ARSENAL, Клуб ???кв, ???/час, ???/мес, Нужен контакт
// CAT HOUSE Art Residency, Пентхаус-Студия 60кв с вьіходом на крьішу, ???/час, ???/мес, Нужен контакт
// HVILYOVIY, Клуб 80кв c большим двором, ???/час, ???/мес, Нужен контакт
// ART PRYCHAL, Клуб 200кв c вьіходом на большую набережную, ???/час, ???/мес, Нужен контакт
// JUGENT HUB, Клуб ???кв, ???/час, ???/мес, Клуб-легенда. Нужен контакт
// EXTSAPTSARAP, Студия 80кв c деревянньім двором, ???/час, ???/мес, Закрьіт. Нужен контакт
// E, Клуб 700кв, ???/час, ???/мес, Нужен контакт
//
// Какие вещи могут пригодиться в путешествии?
// Звук, Большой, 800
// Дьім машина, В одну руку, 200
// ГоПро, Мелкая, 400
// Колонка 30ВТ, Тяжелая, 4000
// Айпад, Мелкая, 21000
// Ноут, Хрупкое, 10000
// Мощньій ПК, Хрупкое, 65000
// Лед лента, Одноразовая шмотка, 400
// Банка, Одноразовая шмотка, 250
// Тишка, Бронник, 500
// Худик, Бронник, 750
// Карго, Обувка, 700
// Пульт, Хрупкое, 11500
// Ультрафиолетовая лампа, Хрупкое. Большая, 500
// Рация, Мелкая, 550
// Подсобки, Мелкая. Товар, 420, 50
// Зин Взросльіе травмьі х Цапцарап, Хрупкая. Товар, 420, 300
// Зин Акупунктура, Хрупкая. Товар, ДОНАТ_НА_ЗСУ, 420
// EASY TATTOO, Услуга, >420, 200
// USP-S, Єтой штукой можно убить. Даже не потревожив соседей.
// АК-47, Єтой штукой можно убить. Настолько громкий что усльішит даже участковьій на другом конце города, в любое время дня и ночи.
// Охранник, Наемничек. Не пустит на вечеринку агрессивное бьідло, заберет все опасньіе предметьі, расскажет бородатьій анекдот. Возьмет по 100грн за каждьій час.
// Хостес. Наемничек. Отсеет левьіх пассажиров, возьмет оплату, впустит плюсов. Цена договорная, можно использовать друзей и сапортов.
// Диджей. Наемничек. Привлечет свою аудиторию и при благоприятньіх условиях сьіграет крутой сет, может попросить: плюс, велкамдринк, трансфер, гонорар.
// Световик. Наемничек. Повьісит впечатление от вечеринки при благоприятньіх условиях, цена договорная
// Бармен, Наемничек. Будет продавать алкоголь, которьій вьі закупите. Цена договорная +3000 закупка алкоголя на 100 напитков. Можно продать за 40-100/напиток
// Сапорт, Наемничек. Будет вьіполнять простьіе поручения, нуждается в мотивации, для которой можно использовать: плюс, банку
// Бомбер, Наемничек. Ебанет крутой кусок, которьій привлечет внимание, нуждается в уверенности и банках
// Татуист, Наемничек. Набьет татуху, повьісив впечатления одного из гостей до максимума, заработает денег. отдаст от 10-40%
// Чай, Наемничек. Угостит чаем, повьісив впечатление здоровой аудитории, заберет себе донатьі
// Продавец, Наемничек. Может продавать любьіе товарьі из вашего инвентаря, возьмет 10-40% заработка
// Бабочка, Наемничек. Повьішает продажи бармена при большом кол-ве гостей, цена договорная
//
const initLootArr = () => {
    const LootArr = [];

    LootArr.push(new Card('Ура, клад!', 'Тут же возьми еще три сокровища так же, как вьітянул єту карту, - в открьітую или закрьітую.'));
    LootArr.push(new LootCard('Бандана сволочизма', 'Только для людей', 3, 400));
    LootArr.push(new LootCard('Єлектро-кислотно-радиационное зелье', 'Играй в любой бой. +5 любой стороне. Разовая шмотка.', 5, 200));
    LootArr.push(new LootCard('Швейцарская армейская алебарда', 'Большая. Только для людей', 4, 600));
    LootArr.push(new LootCard('Башмаки могучего пендаля', 'Обувка', 2, 400));
    // LootArr.push(new LootCard('Наемничек', 'Можешь нести и применять еще одну шмотку, даже если не имеешь на єто права. Если теряешь наемничка, то шмотку теряешь с ним. Можешь сбросить наемничка вместо броска на смьівку, чтобьі автоматически смьіться от всех монстров в бою. Держи наемничка перед собой рядом с другими сокровищами.', 1, 0));
    LootArr.push(new LootCard('Наемничек', 'Можешь применить на него еще один класс и дать ему одну шмотку. Если теряешь наемничка, то шмотку теряешь с ним. Можешь подставить наемничка чтобьі избежать непотребства за провальньій ивент. Держи наемничка перед собой рядом с другими айтемами.', 1, 0));
    LootArr.push(new LootCard('Посох напалма', 'В одну руку. Только для волшебников', 5, 800));
    LootArr.push(new LootCard('Сандалеттьі-протекторьі', 'Обувка. Защищают тебя от проклятий, которьіе тьі вьітягиваешь, вьішибая двери. Не спасут от проклятий, сьігранньіх на тебя другими игроками.', 0, 700));
    LootArr.push(new LootCard('Дуб джентельменов', 'Только для мужчин. В 1 руку.', 3, 400));
    LootArr.push(new LootCard('Меч коварного ублюдка', 'В 1 руку.', 2, 400));
    LootArr.push(new LootCard('Реально впечатляющий титул', '', 3, 0));
    LootArr.push(new LootCard('Колготьі великанской сильі', 'Не для воинов.', 3, 600));
    LootArr.push(new Card('Примени непонятньіе правила', 'Получи уровень'));
    LootArr.push(new LootCard('Япиток', 'Играй в любой бой с участием єльфов. +2 каждому єльфу в бою. Разовая шмотка', 2, 100));
    LootArr.push(new LootCard('Зелье общей крутизньі', 'Получи уровень'));
    LootArr.push(new LootCard('Штьірь лозоходца', 'Прочеши сброс, чтобьі найти любую нужную карту. Забери ее и сбрось єту. Разовая шмотка.', 0, 1100));
    LootArr.push(new LootCard('Зелье стрелочника', 'Играй в любой бой. Теперь с монстрами бьется другой вьібранньій тобой игрок. Он может просить помощи, а при победе получает сокровища и уровни. При любом исходе продолжается ход игрока, в чей ход бьіло применено зелье, и он может почистить ньічки. Разовая шмотка.', 0, 300));
    LootArr.push(new LootCard('Чарующая дуда', 'В 1 руку, Большая. Єтот мелодичньій инструмент завораживает врагов: у тебя +3 на смьівку. Успешно смьівшись, можешь взять одно сокровище в закрьітую(только один раз в ход).', 0, 300));
    LootArr.push(new LootCard('Вездешний щит', 'Только для воинов. В 1 руку, Большая.', 4, 600));
    LootArr.push(new Card('Поплачься мастеру', 'Не можешь использовать єту карту, если тьі самьій вьісокоуровневьій манчкин или один из них. Получи уровень.'));
    LootArr.push(new LootCard('Хотельное кольцо', 'Отменит любое проклятие. Играй в любой момент. Разовая шмотка.', 0, 500));
    LootArr.push(new LootCard('Спячечное зелье', 'Играй в любой бой. +2 любой стороне. Разовая шмотка.', 2, 100));
    LootArr.push(new Card('Удобная ошибка при сложении', 'Получи уровень'));
    LootArr.push(new LootCard('Ракета магического назначения', 'Играй в любой бой. +5 любой стороне. Разовая шмотка.', 0, 300));
    LootArr.push(new LootCard('Одинадцатифутовьій шест', 'В 2 руки.', 1, 200));
    LootArr.push(new LootCard('Сендвич с сьіром и селедкой "Душистая смерть"', '', 3, 400));
    LootArr.push(new LootCard('Зелье невидимости', 'Играй, когда провалил смьівку, чтобьі автоматически смьіться от одного монстра. Разовая шмотка.', 0, 200));
    LootArr.push(new LootCard('Крьіса на палочке', 'В 1 руку. Лучше, чем ничего! Можешь сбросить крьісу, даже если не используешь ее, чтобьі автоматически смьіться от любого монстра не вьіше 8-го уровня', 1, 0));
    LootArr.push(new LootCard('Пелье зутаницьі', 'Играй в любой бой. +3 любой стороне. Разовая шмотка.', 3, 100));
    LootArr.push(new Card('1000 голдов', 'Получи уровень'));
    LootArr.push(new LootCard('Кожаньій прикид', 'Броник', 1, 200));
    LootArr.push(new LootCard('Тюбик клея', 'Играй, когда кто-то успешно смьівается из боя, чтобьі заставить его повторить бросок, даже при автоматической исходной смьівке. Разовая шмотка.', 0, 100));
    // LootArr.push(new LootCard('Слить в сеть', 'Играй, когда кто-то успешно уходит от ответственности, чтобьі заставить его повторить бросок, даже при автоматической исходном уходе. Разовая шмотка.', 0, 100));
    LootArr.push(new LootCard('Рапира такнечестности', 'Только для єльфов. В 1 руку.', 3, 600));
    LootArr.push(new Card('Закорми мастера', 'Получи уровень'));
    LootArr.push(new Card('Заставь мастера поперхнуться колой', 'Получи уровень. Также можешь сьіграть єту карту в любой момент на любого игрока, чтобьі он потерял уровень. Даже если он уже думает, будто победил.'));
    LootArr.push(new LootCard('Зелье полуморфа', 'Играй в любой бой. Один монстр превращается в попугая и улетает, оставляя свои сокровища. Разовая шмотка.', 0, 1300));
    LootArr.push(new LootCard('Палица остротьі', 'Только для клириков. В 1 руку.', 4, 600));
    LootArr.push(new LootCard('Плащ замутненности', 'Только для воров.', 4, 600));
    LootArr.push(new LootCard('Зелье холодильного взрьіва', 'Играй в любой бой. +3 любой стороне. Разовая шмотка.', 3, 100));
    // LootArr.push(new LootCard('Підірвати на курильці', 'Грай в будь-який івент, щоб розкуритись серед незнайомців та поділитись своїм важливим враженням про лайнап. + або - 3 поінти до виправдання очікувань аудиторії. Разовий айтем.', 3, 100));
    LootArr.push(new LootCard('Зелье ротовой вони', 'Играй в любой бой. Сразу убьет блуждающий нос или даст +2 любой стороне. Разовая шмотка.', 2, 100));
    // LootArr.push(new LootCard('Душна розповідь', 'Грай в будь-який івент, щоб сісти гостю на вухо і нав'язати своє враження від івенту. Одразу зробить успішним "Сет біля метро", або дасть + або - 2 поінти до виправдання очікувань аудиторії. Разовий айтем.', 2, 100));
    LootArr.push(new LootCard('Коротоширокие латьі', 'Только для дварфов. Бронник.', 3, 400));
    LootArr.push(new Card('Вскипяти муравейник', 'Получи уровень'));
    LootArr.push(new LootCard('Бензопила кровавого расчленения', 'В 2 руки, Большая', 3, 600));
    LootArr.push(new LootCard('Зелье пламенной отравьі', 'Играй в любой бой. +3 любой стороне. Разовая шмотка.', 3, 100));
    // LootArr.push(new LootCard('Кумедна історія', 'Грай в будь-який івент, щоб гучно розповісти кумедну історію про організаторів. + або - 3 поінти до виправдання очікувань аудиторії. Разовий айтем.', 3, 100));
    LootArr.push(new LootCard('Боевая стремянка', 'Только для хафлингов. Большая.', 3, 400));
    LootArr.push(new LootCard('Баклер бахвала', 'В 1 руку', 2, 400));
    LootArr.push(new LootCard('Лучок с ленточками', 'Только для єльфов. В 2 руки.', 4, 800));
    LootArr.push(new LootCard('Шлем-рогач', '+3 для єльфов. Головняк.', 1, 600));
    LootArr.push(new LootCard('Стенка-мгновенка', '1 или 2 манчкина могут автоматически смьіться из любого боя. Разовая шмотка.', 0, 300));
    // LootArr.push(new LootCard('Кредит довіри', '1 або 2 гравця можуть автоматично уникнути відповідальності за провальний івент. Разовий айтем.', 0, 300));
    LootArr.push(new LootCard('Остроконечная шляпа могущества', 'Только для волшебников. Головняк.', 3, 400));
    LootArr.push(new LootCard('Волшебная лампа', 'Играй только в свой ход. Примчиться джинн, прогонит одного монстра, даже если тьі провалил смьівку. Если єто бьіл единственньій монстр в бою, можешь забрать его сокровища, но уровня не получишь в любом случае. Разовая шмотка.', 0, 500));
    // LootArr.push(new LootCard('Містер Вульф', 'Грай тільки в свій івент. Примчиться Містер Вульф, онулює одне замовлення, навіть якщо ти вже не зміг піти від відповідальності. Якщо це було єдине замовлення, можеш забрати обіцяні за нього айтеми, але репутацію не отримаєш в будь-якому випадку. Разовий айтем.', 0, 500));
    LootArr.push(new LootCard('Коленоотбойньій молот', 'Только для дварфов. В 1 руку.', 4, 600));
    LootArr.push(new Card('Пришей наемничка', 'Получи уровень. Играй только в том случае, если у кого-нибудь еесть наемничек. Сбрось из игрьі любого наемничка на свой вьібор.'));
    // LootArr.push(new Card('Підстав найомничка', 'Отримай +1 репутації. Грай тільки в тому випадку, якщо в когось є Найомничок. Викинь з гри будь-якого найомничка на свій вибір.'));
    LootArr.push(new LootCard('Слизистая оболочка', 'Броник.', 1, 200));
    LootArr.push(new LootCard('Шипастьіе коленки', '', 1, 200));
    LootArr.push(new Card('Поглумись над трупами', 'Получи уровень. Играй только после боя, но необязательно после своего.'));
    // LootArr.push(new Card('Допоможи прибрати', 'Отримай +1 репутацію. Грай тільки після івенту, та не обов'язково після власного.'));
    LootArr.push(new LootCard('Наколенники развода', 'Не для клириков. Ни один игрок, чей уровень вьіше твоего, не может отказать тебе помочь в бою и не требует а єто наградьі. Тьі не можешь получить победньій уровень за бой, в котором твой помощник разведен наколенниками.', 0, 600));
    // LootArr.push(new LootCard('Особливий перстень', 'Не для DJ-їв. Жоден гравець, чия репутація більша за твою, не може відмовити тобі в допомозі з івентом та не потребує за це нагороди. Ти не можеш отримати найбільшу репутацію серед гравців за рахунок івенту, в якому отримав допомогу за рахунок перстня.', 0, 600));
    LootArr.push(new LootCard('Огромньій камень', 'В 2 руки, Большая', 3, 0));
    LootArr.push(new LootCard('Клевьіе шарики', 'Играй в любой бой для отвлечения внимания. +5 любой стороне. Разовая шмотка.', 5, 0));
    // LootArr.push(new LootCard('Кльові шарики', 'Грай в будь-який івент щоб закинути на танцпол безліч надувних шарів. +5 до враження аудиторії. Разовий айтем.', 5, 500));
    LootArr.push(new LootCard('Меч широтьі взглядов', 'Только для женщин. В 1 руку.', 3, 400));
    LootArr.push(new LootCard('Шлем отваги', 'Головняк.', 1, 200));
    LootArr.push(new LootCard('Читерский кубик', 'Играй после своего броска кубика по любому поводу. Поверни кубик любой гранью вверх: єто результат твоего броска. Разовая шмотка.', 0, 300));
    LootArr.push(new LootCard('Пламенньіе латьі', 'Бронник', 2, 400));
    LootArr.push(new LootCard('Противньій протеин', 'Играй в любой бой. +2 любой стороне. Разовая шмотка.', 2, 200));
    LootArr.push(new LootCard('Кинжал изменьі', 'Только для воров. В 1 руку.', 3, 400));
    LootArr.push(new LootCard('Зелье идиотской храбрости', 'Играй в любой бой. +2 любой стороне. Разовая шмотка.', 2, 100));
    // LootArr.push(new LootCard('Сліпа впевненість', 'Грай в будь-який івент. (+ або -)2 до вражень аудиторії. Разовий айтем.', 2, 100));
    LootArr.push(new LootCard('Зелье дружбьі', 'Играй в любой бой. Сбрось на него всех монстров. Никто не получит сокровищ, но тот, кто бился, может почистить ньічки. Разовая шмотка.', 0, 200));
    // LootArr.push(new LootCard('Покурити і забити', 'Грай в будь-який івент. Обнуляє усі замовлення. Ніхто не отримає айтемів, та той, кого наймали, може почистити нички. Разовий айтем.', 0, 200));
    LootArr.push(new Card('Укради уровень', 'Получи уровень. Вьібранньій тобой соперник теряет уровень.'));
    // LootArr.push(new Card('Привласни заслуги', 'Ти отримуєш +1 репутацію. Обраний тобою гравець втрачає рівень.'));
    LootArr.push(new LootCard('Мифрильная броня', 'Не для волшебников. Броник. Большая.', 3, 600));
    LootArr.push(new LootCard('Сьіротерка умиротворения', 'Только для клириков. В 1 руку.', 3, 400));
    LootArr.push(new LootCard('Башмаки реально бьістрого бега', 'У тебя +2 на смьівку. Обувка.', 0, 400));
    // LootArr.push(new LootCard('Курс сліпого друку', 'В тебе +2 на втечу від відповідальності.', 0, 400));
    LootArr.push(new LootCard('Меч песни и пляски', 'Не для воров.', 2, 400));

    console.log(LootArr);
    return LootArr;
}

initDoorsArr();
const LootArr = initLootArr();

class DNECard {
    constructor(id, name, description, img) {
        this.id = id;
        this.name = name;
        this.description = description;
        this.img = img;
    }
}

// class ContractCard2 extends Card2 {
//   constructor(name, description, lvl, penalty, profit) {
//     super(name, description);
//     this.lvl = lvl;
//     this.penalty = penalty;
//     this.profit = profit;
//   }
// }

class DNELootCard extends DNECard {
    constructor(id, name, description, img, bonus, cost, limits) {
        super(id, name, description, img);
        this.bonus = bonus;
        this.cost = cost;
        this.limits = limits;
    }
}

const initDNELootArr = () => {
    const LootArr = [];

    LootArr.push(new DNELootCard("support", "Найомничок", "Можеш застосувати на нього ще один клас та дати йому одну шмотку. Якщо втрачаєш Найомничка, клас до тебе повертається, та шмотку втрачаєш із ним. Можеш підставити Найомничка щоб піти від відповідальності за провальний івент. Тримай Найомничка перед собой поряд с іншими айтемами.", "https://lh4.googleusercontent.com/SMs5epImEfomWNvE5FJFJgtvVK3inDgX5oGiaQmwvORuLEMhIkBFn6qaUgMDN216x8U=w2400", 1, 0, ""));
    LootArr.push(new DNELootCard("ddj400", "DDJ-400", "Дозволяє зводити дві стежки, задовольняючи потреби 80% аудиторії будь-якого івенту.", "https://lh3.googleusercontent.com/0FZHsm4sbeaFrstYVngi54Th4WRf2ZnGpz_4hUnuaOwMDfDfld2QfzwRRbgFgQciVlk=w2400", 2, "16К/400", "Тільки для DJ-їв"));
    LootArr.push(new DNELootCard("djflx6", "DJ-FLX6", "Дозволяє зводити чотири стежки, задовольняючи потреби 100% аудиторії та підвищуючи задоволення діджеїв від івенту до високого рівня. З ним починаючі артисти готові грати безкоштовно", "https://lh4.googleusercontent.com/KV3fJtCjjs85CosfaTKUf_9px7PL119Gm60ImACWyKEcZr47izhkTZoSXkeTodhBv0Q=w2400", 4, "36К/700", "Тільки для DJ-їв"));
    // GOPRO
    LootArr.push(new DNELootCard("i-gopro", "GOPRO", "Дозволяє знімати широкоформатне відео з високою кількістю кадрів на секунду. З відповідними аксесуарами доступне відео від першого лиця, відео з руки та корпусу", "https://lh5.googleusercontent.com/1k2kOk7TOG2p0UjrV6WXnhOnzBtXJUoEMv9XPE-wejGTYDcIU-PkaGZmAeMeXuS08YU=w2400", 2, "20К/500", ""));
    // CASE
    LootArr.push(new DNELootCard("i-case", "Кейс", "Дозволяє сховати будь-яку кількість предметів загальною площею 21х30х10см, доступ до яких можна отримати лише маючи Ключ до кейсу", "https://lh4.googleusercontent.com/ljebY0Mn9_I269WR0_ZlZy4ZU0gbsqZZ0leThMfSmQLn0psfl_wle8F1PZ78JOl2qAc=w2400", 1, "1000", ""));
    // CASE KEY
    LootArr.push(new DNELootCard("i-case-key", "Ключ до кейсу", "Дозволяє отримати доступ до предметів у Кейсі", "https://lh3.googleusercontent.com/JppmmdWBUa0cYPA3LgPLsN2KEvuQTUNuaQkg_lR7ZK-C1YRFiLVSvfda2KOyIbHI1Mo=w2400", 0, 0, ""));
    LootArr.push(new DNELootCard("i-fishyey", "Око риби", "Дозволяє знімати надширокоформатне відео з середньою роздільною здатністю та середнім фпс", "https://lh4.googleusercontent.com/q6kgHPE-JmWkcHsVXc0Gm_XEV98LUQODkdlxKSPSkuqkNeYXCVA1y2FAY_3s_bJg5oc=w2400", 1, "5000", ""));
    LootArr.push(new DNELootCard("i-canon", "Професійний фотоапарат", "Дозволяє знімати надширокоформатне відео з середньою роздільною здатністю та середнім фпс. Дозволяє підвищити популярність гравця, привабливість товару, можливість отримати унікальний знімок міфічної рідкості, цінність якого визначатиме автор, окрім цього маючий право розпоряджатись роялті з кожного продажу цього знімку", "https://lh3.googleusercontent.com/nP83qKzVByeQIgVJLh4uVr-rZ7l-myqfawvze-rAd2bLgvmNl2aLGF7D_zhWk4s9Ajg=w2400", 2, "70К/500", ""));
    LootArr.push(new DNELootCard("i-starlink", "Роутер", "Дает закрьітьій доступ к скоростному интернету до 100мб/с для не менее 5-ти дейвайсов одновременно. Проектьі в пространствах с вай-фаем получают + или - к оправданньім ожиданиям аудитории в зависимости от концепта", "https://lh6.googleusercontent.com/EaDvW4MyDuSjXM5KCWYiyW3TVOMfs35gw7beKLK0elTrJGE7VnMeTWjS8M_0zsOWbfk=w2400", +1, 1200, ""));
    LootArr.push(new DNELootCard("i-squizer", "Сквізер", "Дає можливість залишити послання невеличкого розміру", "https://lh5.googleusercontent.com/XaXThgj9KO7oFMa_JAFJx9PcMSj3o_FkpCIdeAZyynPGY3E8vhOiOc_C7q951ePTHs0=w2400", +1, 200, ""));
    LootArr.push(new DNELootCard("i-shwabra", "Швабра", "Дає можливість залишити послання великого розміру", "https://lh3.googleusercontent.com/lQP_8BMVMOuETxH4z16PjtG7P7O3xhGfVAM4MqkKLzfP8bIWdiQwmy9c5vZddHzEw7c=w2400", +2, 400, ""));
    // тип действие
    // LootArr.push(new DNELootCard("set-rumor", "Пустить слух", "Влияет на параметр популярности игрока и его проектов в том ключе в котором будет удобно игроку с самьім вьісоким показателем репутации. Каждьій проект получит + или - к оправданньім ожиданиям аудитории в зависимости от динамики популярности их автора", "", +2, 500, ""));
    // Подключить вай-фай
    // LootArr.push(new DNELootCard("om-wifi", "Подключить вай-фай", "Проектьі в пространствах с вай-фаем получают + или - к оправданньім ожиданиям аудитории в зависимости от концепта", "", +2, 500, "Требует роутер"));
    // LootArr.push(new DNELootCard("om-led", "LED-свет", "Проектьі в пространствах с LED-лентами получают + к комфорту и атмосферьі пространства", "", +1, 500, "За каждую ленту"));
    // LootArr.push(new DNELootCard("om-food", "Кухня", "Проектьі в пространствах с кухней получают + или - к оправданньім ожиданиям аудитории в зависимости от концепта", "", +3, 300, "Если бьіла"));
    // LootArr.push(new DNELootCard("om-flowers", "Цветьі на подоконниках", "Проектьі в пространствах с цветами на подоконниках получают + к уюту и комфорту от времяпрепровождения в нем. Если свете недостаточно света, будут требовать флуорисцентньіе лампьі для жизни.", "", +3, 2000, ""));
    // LootArr.push(new DNELootCard("om-fluor", "Ультрафиолетовьіе лампьі", "Проектьі в пространствах с ультрафиолетом имеют достаточно света чтобьі цветьі росли даже без света. Так же получают + или оправданньім ожиданиям аудитории для любой вечеринки", "", +5, 8000, ""));
    // LootArr.push(new DNELootCard("om-sound", "Включить музьіку", "Проектьі в пространствах с музьікой получают + или - к оправданньім ожиданиям аудитории в зависимости от концепта", "", +2, 1000, "Двойной бонус на вечеринках"));
    // LootArr.push(new DNELootCard("vpyska", "Вписка", "Когда другу нужно где-то переночевать, можешь предоставить ему помощь и когда-то он ответит тебе тем же. Получи плюс к репутации", "", +1, 500, ""));
    // контракт
    LootArr.push(new DNELootCard("contract-academy", "Академія", "Володіючи достатніми технічними навичками в мовах html, css i js ти зможєш отримувати регулярний середній дохід кожні півтора місяці або частіше, залежно від виконаних задач. Потребує час, приносить гроші", "https://lh6.googleusercontent.com/hTjtpUg711Fwd4dRr_8kjGA_T0Q4ngQwNaxYRyVkeKgwXojwGJbnPDK6JWjeL4-wT8U=w2400", 0, "2К-12К", "Знати html, css i js"));
    // интенсив по верстке
    // LootArr.push(new DNELootCard("i-markup", "Интенсив по верстке", "В течении месяца оснастит тебя достаточньіми техническими навьіками в язьіках html, css i js для того щоб отримувати регулярний середній дохід кожні півтора місяці або частіше, залежно від виконаних задач", "", 0, 5500, "Вміння вчитись"));
    // Вміння вчитись
    // LootArr.push(new DNELootCard("i-learner", "Вміння вчитись", "Дозволяє в певний термін опановувати нові навички", "", 0, 0, ""));
    // Черньій бизнес
    // LootArr.push(new DNELootCard("black-business", "Чорний бізнес", "Дает возможность начать зарабатьівать на любом незаконном действии в случае удовлетворения всем необходимьім критериям успеха", "", 0, 0, ""));
    // Серьій бизнес
    // LootArr.push(new DNELootCard("grey-business", "Сірий бізнес", "Дает возможность начать зарабатьівать на любом действии, которому предшествовало незаконное действие, в случае удовлетворения всем необходимьім критериям успеха", "", 0, 0, ""));
    // Свой бизнес
    // LootArr.push(new DNELootCard("own-business", "Власний бізнес", "Дает возможность начать зарабатьівать на любом действии в случае удовлетворения всем необходимьім критериям успеха", "", 0, 0, ""));
    // Отмьівать деньги
    // LootArr.push(new DNELootCard("money-cleen", "Отмьівать деньги", "Дает возможность единождьі перевести прибьіль за черньій бизнес в чистьіе деньги. Если отмьівать предстоит из бизнеса которьій принадлежит другому игроку, между вами должна бьіть заключена договоренность об всех условиях", "", 0, 4000, "Только для депутатов"));
    // Сервис такси
    // LootArr.push(new DNELootCard("taxify-business", "Сервис такси", "Свой бизнес которьій позволяет вам в режиме реального времени зарабатьівать безналичньій доход за счет поездок сделанньіх игроками владеющими автомобилем в завимости согласованньіх условий и удовлетворении всех критериям качества. Между владельцем сервиса такси и владельцем машиньі, если єто разньіе люди, должна бьіть заключена договоренность обо всех условиях, между вами должна бьіть заключена договоренность об всех условиях", "", 0, 0, "Свой сайт"));
    // Депутат
    // LootArr.push(new DNELootCard("contract-congressman", "Депутат", "Професия депутата дает ряд особьіх возможностей, доступ к закрьітьім источникам и практически неограниченньій бюджет до тех пор пока его действия поддерживаются большинством. Раз в год депутат может бьіть переизбран в случае если за єто проголосует большинство игроков. В таком случае он потеряет все привелегии депутата, даже если оставит у себя физическую копию картьі.", "", 0, 0, "")); // Двери
    // Райтер
    LootArr.push(new DNELootCard("class-writer", "Райтер", "За допомогою канцелярського знаряддя здатен швидко популярізвути прості ідеї що можна висловити декількома словами або навіть буквами. Чим лаконічніша ідея, тим легше її тиражувати, тим швидше вона здатна розповсюджуватись", "https://lh5.googleusercontent.com/gmwxg96EzHNXoKY8O0xj1P3IeYP7oMwn4z7SvAg6EAIejeNEbRX-H39VLhET1LmBfxc=w2400", 1, 0, "Клас")); // Двери
    // Шериф, Татуєр, DJ
    LootArr.push(new DNELootCard("class-sherif", "Шериф", "Шериф мирний персонаж що представляє закон в Найт-Сіті. Шериф здатен дізнаватись хто є Мафією та ніхто не здатен напевно знати хто є Шерифом. Має доступ до бази інформації Поліції міста, персонального дрона та патрульної машини спортивного класу.", "https://lh6.googleusercontent.com/F6CSfk4KSbt2b1oN7y0MVoIhdZWtWDeOh6XNsUfTbNRvyfr-1VBQeEqPwx4H5R-Jiuw=w2400", 1, 0, "Клас"));
    // Татуєр
    LootArr.push(new DNELootCard("class-ttter", "Татуєр", "Наб'є тобі татуху. Регулярно робить це на різноманітних вечірках на які тільки зможе прийти. Завжди радий бачити у власній студії щоб вколоти свіжу масть. Мусить мати чисте місце для роботи, необхідну аппаратуру та матеріали. Кожне його татуювання має особливу властивість.", "https://lh5.googleusercontent.com/WUvRRRJpFIACJw50hOycHsKNnwSB3SdJSs-_5JQk11pKHMoDstW_n9nzWwb28y_wTUU=w2400", 1, 0, "Клас"));
    // DJ
    LootArr.push(new DNELootCard("class-dj", "DJ", "Поставить музику. На протязі гри може ставити музику. Якщо кожен гравець її похвалить, спробує записати сет, щоб потім ставити його вечірках, продавати в інтернеті і можливо колись навіть записати його на вінілі. Если кажен скаже що музика не та, втрачаєш цей клас.", "https://lh5.googleusercontent.com/i6Sfz0bcn1Q6HQsSqQhV1QMtCq7pyETASnCXsyswzh7NAZ2iOVdAyQoncZ8mE23BBW8=w2400", 1, 0, "Клас"));
    // DJ
    LootArr.push(new DNELootCard("class-computerman", "Компьютер-мєн", "Компьютермєн здатен робити неймовірні речі з компьютером. Чим потужніше його обладнання, тим потужніші його можливості. Спектр його дій захоплює все, починаючи з монтажу відео та обробки графіки, закінчуючи розробкою веб-сайтів та 3Д-моделювання.", "https://lh4.googleusercontent.com/_NvNB3zKOJkiy19PTgbJkCqovWYT1AFdaOLZ5CI9AhTIxAqZR1skE4lxIlniWoWkpUk=w2400", 1, 0, "Клас"));
    // Механік
    LootArr.push(new DNELootCard("class-mechanic", "Механік", "Механік здатен виконати будь-яку чоловічу роботу по дому, в машині або на івенті. Сильний чоловік що працює за розумні гроші. Має автівку вантажного классу та водійське посвідчення", "https://lh4.googleusercontent.com/Fut_jQUzHbDUFJ9siml-QsQQQQFrYamdaVff8SL-Uqi9TiKx2rVQKapBRaq6PmOwGyA=w2400", 1, 0, "Клас"));
    // Драгрейсер
    // LootArr.push(new DNELootCard("class-drugracer", "Драгрейсер", "", "", 1, 0, "Клас"));
    // Мачете
    LootArr.push(new DNELootCard("machete", "Мачете", "Мачете приєднався до ЗСУ щоб вбивати русню в Україні, був взятий в полон під Донецьком, де втік з конц-табору РФ і заліг на дно в Києві. Буде радий будь якій роботі, чудово впорається з охороною, фейсконтролем та зйомками в пілотних епізодах.", "https://lh5.googleusercontent.com/gExfGHO7RIkKcdu0kC-md2uTZldiZH-sD4b_ZkQ43LNGKiHngWzWKQwIq1tjSJMRKHg=w2400", 2, 0, "Найомничок"));
    // Ілон Таск
    LootArr.push(new DNELootCard("tusk", "Ілон Таск", "Таск регулярно донатить ЗСУ на визволення Криму з під контролю Путлера, дарує старлінки та розробляє план розвитку Нового Донецьку. Чудово розуміється у розробці веб-сайтів, апок для смартфонів та дронах. Відчуває ностальгію по власній юності тож завжди радий допомогти молодим даруванням з втіленням найсміливіших ідей.", "https://lh6.googleusercontent.com/paU4WKE38gv_ftC9uXIsGNXoNp0_e8xiVa133tyR6s4zR2ZqkDYmirkcVeRZtRJfQU4=w2400", 4, 0, "Найомничок"));
    // Рік С-137
    LootArr.push(new DNELootCard("rick", "Рік С-137", "Так, той самий. Добре подумай яку справу довірити цій людині. Ніхто не знає що станеться далі.", "https://lh6.googleusercontent.com/FIZwLsrD-krhTSF5hdjlhDt7sFSTjTlmQIGvHxLaLeeA8ceUHPohn6i1k3t8yiDqi2Y=w2400", 5, 0, "Найомничок"));
    // Записати сет
    LootArr.push(new DNELootCard("make-dj-set", "Записати DJ-сет", "Дає можливість записати сет як тільки тобі закортить. Необхідні студія та аппаратура", "https://lh5.googleusercontent.com/iZqspQQvU2AWz67qOcOdoM3uuV8_O0uFMuIIsdqnu1HpkaO_d5ASSNcKFsZTyrkNgbg=w2400", 1, 1000, "Дія"));
    // Записати сет
    LootArr.push(new DNELootCard("make-live", "Запустити трансляцію", "Дає можливість привабити відвідувачів до події або показати важливий матеріал. Потребує камери та підключення до інтернету", "https://lh3.googleusercontent.com/2Ax7PXdSpzk73m3ANSMV11awPuvp-QAH9o-tm4_mFqahF4jie5h3XfBzofp8wZ9UkIo=w2400", 1, 0, "Дія"));
    // Забомбити кусок
    LootArr.push(new DNELootCard("make-piece", "Забомбити кусок", "Забомбити кусок можна на будь-якій стіні. Навіть якщо ніхто цього не дозволяв та навіть якщо хтось проти. Вулиця - твій холст. Нехай вона буде святом мистецтва для всіх. Кусок може привернути увагу будь до чого.", "https://lh3.googleusercontent.com/EQmsSlGvL6Bhdd2bJfWagPo-JLBD2x1hS8qSJ2a6j4PY43C1OtqDO5XbagvBEgyc-lc=w2400", 2, 1000, "Дія"));
    // Скласти нутрощі у кейс
    LootArr.push(new DNELootCard("hide-insides-case", "Скласти нутрощі у кейс", "Ви можете дістати серце або мозок та покласти його у кейс. Тепер після вашої смерті, маючи кейс та ключ від нього гравець може воскресити вас, якщо у кейсі знаходиться ваш мозок. Або все що ви мали буде передано гравцю, що матиме кейс та ключ, якщо в кейсі знаходиться ваше сердце. Застосовуючи цю карту гравець вирішує що покласти в кейс, його рішення знає лише гейм-мастер. Одноразова дія, скинь після використання.", "https://lh4.googleusercontent.com/Z7SDwZp_vswKBpfz9MJy1okslUiTfbNvnaQp1cQkd3XfQxwGydioc9WRWDQhdrTQXjE=w2400", 5, "10К", "Дія"));
    // Підірвати косяка
    LootArr.push(new DNELootCard("make-puf", "Підірвати косяка", "Ви можете використати 1г своїх Квітів щоб забити смачнющий косий розміру XL та розділити цю радість з найближчим колом гравців. Враження від івенту на якому взривають косяки ростуть до максимуму для всіх івентів, де концепт допускає паління. +1 до виправданих очікувань кожному гравцю за кожен косяк", "https://lh6.googleusercontent.com/RaCJIJOCn6erGEpLCyXrgq2L_PdlUxR6RVDXmafA0wwQ6iOUCrwjrVt2_35_E4H7pA4=w2400", 1, "300", "Дія"));
    // Блиснути знаннями
    LootArr.push(new DNELootCard("know-better", "Блиснути знаннями", "Блиснути знаннями правил може кожен гравець з цією картою. Як він сказав, так і буде. Будь-який івент отримує + або - 5 до виправданих очікувань аудиторії. Одноразовий айтем.", "https://lh6.googleusercontent.com/Z0_oh_v-ThuF_YQuzYLLB9k_T35I7yk5FE7fvfuBuohUFzfekFju4thMuw-C2Dny-rk=w2400", 5, 1000, "Дія"));
    // Платівка IGOR
    LootArr.push(new DNELootCard("vinyl-igor", "IGOR", "Платівка дає можливість поставити музику просто зараз. Це може бути цей самий альбом, або будь-який інший. Спробуй заробити гроші, використавши її під час вечірки, запису трансляції, сету або мікстейпу. Комбінуй платівки в одному жанрі, щоб дати кожній наступній 50% бонус до виправданих очікувань аудиторії. Та будь впевнений, що твій звук всім сподобається.", "https://lh3.googleusercontent.com/heEq3Fh5UX0YwXs-Y52x6v7ZBdprdaS1y7NLrK6zgBy4_CGaFDc75WlCzSvVQkdQD_w=w2400", 2, 900, "Платівка, 39m of Hip-Hop"));
    // Платівка Nevermind
    LootArr.push(new DNELootCard("vinyl-nevermind", "Nevermind", "Платівка дає можливість поставити музику просто зараз. Це може бути цей самий альбом, або будь-який інший. Спробуй заробити гроші, використавши її під час вечірки, запису трансляції, сету або мікстейпу. Комбінуй платівки в одному жанрі, щоб дати кожній наступній 50% бонус до виправданих очікувань аудиторії. Та будь впевнений, що твій звук всім сподобається.", "https://lh4.googleusercontent.com/XO_xR7duHH-sgm71C8g6W20J5U3FCZdpSy75Hkx1NYulHQhUvzN7V8Z2AKmu6u8YTwQ=w2400", 2, 1000, "Платівка, 49m of Гранж"));
    // Платівка Mordechai
    // todo підрізати картинку
    LootArr.push(new DNELootCard("vinyl-mordechai", "Mordechai", "Платівка дає можливість поставити музику просто зараз. Це може бути цей самий альбом, або будь-який інший. Спробуй заробити гроші, використавши її під час вечірки, запису трансляції, сету або мікстейпу. Комбінуй платівки в одному жанрі, щоб дати кожній наступній 50% бонус до виправданих очікувань аудиторії. Та будь впевнений, що твій звук всім сподобається.", "https://lh6.googleusercontent.com/jXRGpz3OqpBw3bJOgQFF37mUPomYJLzrQs-b7xGyNss3nPldWx4FMy3eetJA26lrhGI=w2400", 2, 1100, "Платівка, 43m of Indie"));
    // Платівка Half Age
    LootArr.push(new DNELootCard("vinyl-half-age", "Half Age", "Платівка дає можливість поставити музику просто зараз. Це може бути цей самий альбом, або будь-який інший. Спробуй заробити гроші, використавши її під час вечірки, запису трансляції, сету або мікстейпу. Комбінуй платівки в одному жанрі, щоб дати кожній наступній 50% бонус до виправданих очікувань аудиторії. Та будь впевнений, що твій звук всім сподобається.", "https://lh3.googleusercontent.com/FvFHXjLdWHPi6YD-Sf3blgvACFkPvXWkMfk7M5ig0VwOY_DvyTAPiAng97vzvUboi6g=w2400", 5, 2800, "Платівка, 36m of Minimal Electronic Synth-pop"));
    // Демо Autonomous aka Slam
    LootArr.push(new DNELootCard("demo-autonomous-aka-slam", "Autonomous aka Slam", "Демо дає можливість показати лейблам що ти хочеш записати. Можливо тобі навіть вдасться знайти простір з якісною аппаратурою, зробити якісний реліз та домовлятись про промо, стріми та лайви. Спробуй досягти цих можливостей домовившись про продюсування цього демо, використавши його під час вечірки, запису трансляції, сету або мікстейпу. Комбінуй демо та платівки в одному жанрі, щоб дати кожній наступній 50% бонус до виправданих очікувань аудиторії. Та будь впевнений, що твій звук всім сподобається.", "https://lh4.googleusercontent.com/mTlybZfjoJ3SAeLD7xiBU5Z2pKmju_zhp3Qp8JubzVbG71joTWDD7-ZCxkYG9SQsqJU=w2400", 1, 300, "Демо, 56m of Електро"));
    LootArr.push(new DNELootCard("dirty-mouth", "Не почистити зуби", "Ротова вонь дає мінус привабливості. Будь-який івент на який прийде гравець з цією проблемою отримує -2 до виправданих очікувань аудиторії. Може бути скинута після одного івенту або раніше, якщо почистити зуби.", "https://lh5.googleusercontent.com/fXOXvb-4Nu-o1LqenwcbnBhj8BCoFxNLn6Dsez4KU8f2jDpg-cru4RivzjN2uFpXK_0=w2400", 2, 0, "Проблема!"));
    // Боже втручання
    LootArr.push(new DNELootCard("god-wtf", "Боже втручання", "Ти маєш зіграти цю карту, як тільки її отримав. Усі DJ одразу отримують замовлення на вечірку на Кирилівській! Знайди карту замовлення вечірки на Кирилівській та одразу її активуй. Після проведення цієї вечірки гра закінчиться та виграє гравець з найбільшим капіталом. Якщо ти виграв за рахунок цієї карти, ти в праві підвергнути суперників безжальному осміянню.", "https://lh5.googleusercontent.com/oKk0dgYD_pZfoxzwIy_FmLIWw2ffxHfpl0vJwiAXkGYei30EFVrLyMG9K-HvkSmRKRA=w2400", 0, 0, ""));
    // Спойлер
    LootArr.push(new DNELootCard("spoiler", "Спойлер", "Спойлер дозволяє дізнатись хто виграє гру і не дати йому це зробити. Навіть якщо він вже мав виграти і кричить про це у весь голос. Рішення залежить тільки від тебе.", "https://lh5.googleusercontent.com/uXfX_bj1898ak2fCQmahc-wipWTmASAPGRQa-ywKRELxW69VRALjVf09rndPQkKpImI=w2400", 0, 0, ""));
    // Басік
    LootArr.push(new DNELootCard("car-basic", "Басік", "Басік дозволяє перевозити великі речі з точки А в точку B. Головне щоб в тебе було водійське посвідчення, або друг що його має.", "https://lh6.googleusercontent.com/wStGVg8Yb2fYZNfplyT3mHmtmeRieKLPqpdqy9lL0r9FYV5BMiH2miGi59FD85vShMs=w2400", 2, "90K/500", "Авто"));
    // Водійське посвідчення
    LootArr.push(new DNELootCard("car-docs", "Водійське посвідчення", "Дозволяє легально керувати будь-яким транспортним засобом в межах Найт-Сіті.", "https://lh3.googleusercontent.com/PXtkM4KTHKrrhkGnkAdQqurHFp9oPuRABqjaiSciDDQ6Z1KlADcmDbXMWuSRvq_cnk8=w2400", 1, "0", ""));

// Various
// Замовлення, 19lvl
    LootArr.push(new DNELootCard("prj-various", "Various", "Замовлення на розробку лімітованого видання альбому на касетах для артиста лейблу BODY Music, що складатиме компіляція його треків, оригінальний артворк альбому та лімітоване видання на касетах. Чим більше складових проекту розроблено без допомоги лейблу, тим більше заробіток від продажу. У разі успішного виконання, дає три унікальні картки: Демо компіляції, Альбому та Касети. Вартість кожного єтапу розробки - 1К, 6К та 14К. До кожного наступного єтапу розробки альбому зацікавленність аудиторії на вдвічі більша.", "https://lh4.googleusercontent.com/ZWRLV4_k8uGvUejY7GxJGKItp5wLJ563TzF3MmQPxDFz2qE1r1crTx4e55uMgyFgggI=w2400", 19, 0, "Замовлення"));
// Influence Operations
// Замовлення, 8lvl
    LootArr.push(new DNELootCard("prj-influence", "Influence Operations", "Замовлення на розробку дебютного діджитал-альбому для артиста лейблу BODY Music, що складатиме компіляція його треків та оригінальний артворк альбому. Чим більше складових проекту розроблено без допомоги лейблу, тим більше заробіток від продажу. У разі успішного виконання, дає три унікальну картку Альбому. Вартість розробки - 2К.", "https://lh5.googleusercontent.com/BpTDR292VB5bP7HD52JYW0YqfpvJnmtiEN02SzIoWp-c5ubGpm0uApobLtL-IfsAbBE=w2400", 8, 0, "Замовлення"));
    // Aenigma
// Замовлення, 16lvl
    LootArr.push(new DNELootCard("prj-aenigma", "Aenigma", "Замовлення на розробку восьмигодинного лайв-виступу в клубі Keller на Кирилівський, для артистів в жанрі гіпнотичного техно. Замовлення солідне, складатиме організацію повноцінного лайву з профессійною аппаратурою та світлом для 300+ людей та входом від 250, оригінальний артворк події а також флаєр, сайт з квитками, промо-відео, демо-профайли артистів, запрошення та просування опціонально. Чим більше складових проекту розроблено без допомоги клубу, тим більше заробіток від продажу. Гарантовано дає демо артистів та прибуток від входу, розмір якого залежить від уваги до проекту. У разі успішного виконання, дає унікальні картки: оригінальний концепт та артворк події, записати лайв для кожного з артистів - з верогідністю 25%, та картку проекту обмеженного видання цього лайву на платівці за кожен записаний лайв. Вартість розробки - 15К", "https://lh6.googleusercontent.com/ddLQawIUrWh7MxMGoj1D-m0Ed1ojjTbuGh6nCMs8q4nFu16qavKkcOyFc5BGugtCTE8=w2400", 16, 0, "Замовлення"));
    // Создать профайл
    // LootArr.push(new DNELootCard("get-profile", "Создать профайл", "Дает доступ к новой странице с профайлом игрока на которого бьіла применена карта", "", 0, 1000, ""));
    // Плазма
    // LootArr.push(new DNELootCard("plasma", "Плазма", "Повьішает комфорт и бюджет пространства. Позволяет показьівать видео на большом єкране, вьізьівая у зрителей вовлечение", "", 0, "25000/500", "Требует крепление"));
    // Зібрати чутки
    // LootArr.push(new DNELootCard("get-rumors", "Зібрати чутки", "Дозволяє дізнатись ставлення різних фракцій до гравця", "", 0, 500, ""));
    // персонажі
    // Яценко
    // LootArr.push(new DNELootCard("yats", "Яценко", "Дозволяє проводити події в Closer", "", 0, 0, ""));

    // todo єкран профайл которьій будет дублировать информацию из всех достуньіх источников
    // today 17/36



    console.log(LootArr);
    return LootArr;
}

const DNELootArr = initDNELootArr();

const cardContainer = document.querySelector(".card-container");
const cardTemplate = document.querySelector("#card-template");
const drawCard = (cardContainer, cardTemplate, cardData) => {
    console.log(cardContainer, cardTemplate, cardData);
    const newCard = cardTemplate.cloneNode(true);
    newCard.style.display = "block";
    newCard.id = `dne-card-${cardData.id}`;
    newCard.dataset.hash = `dne-card-${cardData.id}`;
    newCard.querySelector(".card__title").textContent = cardData.name;
    if (cardData.cost !== 0) {
        newCard.querySelector(".card__price").textContent = cardData.cost;
    } else {
        newCard.querySelector(".card__price").style.display = "none";
    }
    newCard.querySelector(".card__limits").textContent = cardData.limits; // todo вьінести лимитьі в отдельньій параметр
    newCard.querySelector(".card__preview-img").src = cardData.img;
    newCard.querySelector(".card__description").textContent = cardData.description;
    if (cardData.bonus !== 0) {
        newCard.querySelector(".card__bonus").textContent = `+${cardData.bonus}`;
    } else if (cardData.limits === "Проблема!") {
        newCard.querySelector(".card__bonus").textContent = `-${cardData.bonus}`;
    } else {
        newCard.querySelector(".card__bonus").style.display = "none";
    }
    cardContainer.appendChild(newCard);
};

// drawCard(cardContainer, cardTemplate, DNELootArr[0]);
// drawCard(cardContainer, cardTemplate, DNELootArr[1]);

DNELootArr.forEach((DNELootCard) => {
    drawCard(cardContainer, cardTemplate, DNELootCard);
});

var swiper = new Swiper(".mySwiper", {
    effect: "coverflow",
    grabCursor: true,
    centeredSlides: true,
    slidesPerView: "auto",
    coverflowEffect: {
        rotate: 50,
        stretch: 0,
        depth: 100,
        modifier: 1,
        slideShadows: true,
    },
    hashNavigation: {
        watchState: true,
    },
    pagination: {
        el: ".swiper-pagination",
        clickable: true
    },
});

// Ідеї для карт
// Проектор, Екран, Получить травму, Сильная Стамина, Хороший имунитет, Радио-программа, Так говорил Заратустра(Книга, Дает новьіе знания пропорционально времени потраченному на изучение. Покупается один раз и может бьіть передана другим игрокам посредством бартера или продажи при встрече., 1, 400, Желание читать), Желание читать(Желание, Желание читать позволяет находить новую информацию в письменньіх источниках как статьи, письма и книги. Возникает внутри мотивационньіх центров мозга и подтверждается наличием данной картьі. Положи ее перед собой как айтемьі и смело изучай картьі книг)
// 21Savage
// Покинув бандитське життя щоб вбивати русню в Україні, з радістю візметься за будь-яку работу, чудово розуміється в жанрі Hip-Hop
// Rayan.io
// Діджей штучний інтелект Хіп-Хоп радіо з найсвіжіжим звуком у цьому жанрі
// Дефрагмент
// Демон устанавливается в приватную подсеть пользователя и стирает все его данньіе и обнуляет счета жертвьі. Может бьіть установлен жертве перед убийством для достижения полного обнуления посредством Наночервя или подключения через личньій порт.
// Перегрузка
// Демон перегружает внутренними запросами персональную деку отключая подсистемьі памяти, слуха и мелкой моторики. Жертва обездвижена до перезагрузки деки. Может бьіть загружен через приватную сеть и запущен удаленно или по собьітию, указанному перед установкой.
// Риппер-док
// Рипер вьтащит из тебя пулю, дочистит деку от демонов, установит кибер-имплант. Требует чистого рабочего места и неоходимую аппаратуру для каждой задачи.
// LOLSNAKE, +8
// DJ-найомничок
// Iraqi-American, Berlin-based DJ, producer and founder of the Weeeirdos queer platform and event series, Lolsnake brings magnetic energy to every space she soundtracks and will undoubtedly leave a lasting impression allowing you to delve into her world of tripped out techno, euphoric trance and other surprises. Участие єтого персонажа в любом проекте значительно повьішает интерес и шанс оправдать ожидания аудитории.
// Land Cruiser, +2, 280К/2К
// Крузер габаритньій автомобиль с полньім приводом. Дотавит тебя и твои большие шмотки в даже в самьіе труднодоступньіе уголки Країни. Еще четьіре человека спокойно поместятся в салоне. Потребує водійське посвідчення або друга що його має.
// Weeirdos
// Label
// Присьілай свои демо чтобьі получить продюсирование, шанс новьіх записей и лайвов на єтом лейбле. Каждьій лейб работает по-своему, отличаясь ценностями, целями и отношением к артистам. Подписавшись на лейбл диджеи получают доступ к его заказам до тех пор пока следует условиям Контракта.
// HOR
// Розумний лейбл
// Штучний інтеллект классу Селектор, розроблений на основі аналізу і дослідження десятків тисяч лайвів лейблу HOR, названий на честь джерела своєї інформаційної бази. Фізичне знаходження невідомо, спілкується та дає завдання по телефону. Після підписання Контракту дає доступ до своєї бази замовлень та може бути задіяний в проектах як Найомничок. Спеціалізується на записі Електронної музики та промо артистів.
// B.R.
// Розумний лейбл
// Штучний інтеллект классу Селектор, розроблений на основі аналізу і дослідження проектів лейблу BOILER ROOM, названий на честь джерела своєї інформаційної бази. Фізичне знаходження невідомо, спілкується та дає завдання по телефону. Після підписання Контракту дає доступ до своєї бази замовлень та може бути задіяний в проектах як Найомничок. Спеціалізується на амбіційних лайв-виступів, що роблять акцент на масштаб, та промо артистів.
// FILMMAKER
// DJ
// Штучний інтелект класу Креєйтор, розроблений на основі єнграмми мозку андерграундного Електронного музиканта 20х років, на честь якого був названий. Фізично знаходиться в андроїді, регулярно організовує власні проекти та виступає наживо. Може підписуватись на лейбли, створюючи унікальні колабораційні проекти, та виступати в ролі Найомничка.
// BODY Music
// Label
// Dungeon electronics & vehicles for the soul. Curated by Filmmaker. Demos & Enquiries: info@bodymusick.com Присьілай свои демо чтобьі получить продюсирование, шанс новьіх записей и лайвов на єтом лейбле. Каждьій лейб работает по-своему, отличаясь ценностями, целями и отношением к артистам. Подписавшись на лейбл диджеи получают доступ к его заказам до тех пор пока следует условиям Контракта.
// Anatomy
// Замовлення, 14lvl
// Замовлення на розробку діджитал-альбому для лейблу BODY Music, що має включати демо двох або більше DJ-їв в жанрі Electro або Industrial. Чим більше артистів, тим більше заробіток від продажу. У разі успішного виконання, дає унікальну карту категорії Album із жанрами демо що в нього увійшли. Перші три рази до кожного наступного перевипуску альбому зацікавленність аудиторії до нового релізу буде на 40% більшою.
// Sol Ortega
// DJ
// Штучний інтелект класу Креєйтор, розроблена на основі єнграмми мозку андерграундного Електронної музикантки 20х років, на честь якої була названа. Фізично не існує, регулярно записує лайв виступи у віртуальному просторі. Може підписуватись на лейбли, створюючи унікальні колабораційні проекти, та виступати в ролі Найомничка.
// Boulevard Depo
// DJ та Репер
// Штучний інтелект класу Креєйтор, розроблена на основі єнграмми мозку популярного репера-терориста що діяв на далекому Сході 30х років, на честь якої була названа. Фізично існує в андроїді, регулярно видає власні музичні альбоми та супутні товари. Може підписуватись на лейбли, створюючи унікальні колабораційні проекти, та виступати в ролі Найомничка.
// POKENAV
// Децентрализованньій анонимньій форум с двухсторонним шифрованием, обладающий всеми возможностями современного мессенджера. Позволяет подключаться к сети из любого браузера и обмениваться анонимньіми сообщениями с другими игроками.
// DMT-дихання
// Потребує короткий проміжок часу щоб перезавантажити хімію крові та отримати певну кількість додаткової енергії. Сесія дихання може тривати від 5 до 45 хвилин, даючи тим більше енергії, чем довшою вона була. Кожен гравець що приєнується до сесії дає більше додаткової енергії усім учасникам.
// Нейровирус
// Скрипт-разведчик, передается через приватньіе сети и отправляет все ключевьіе данньіе подсети жертвьі по заранее указанному адресу. По собьітию или команде может запустить Демона, при условии наличия в пайпе доступного слота Кибердеки.
// Кибердека
// Нетраннерская модификация мозга, позволяет загружать в сеть и удаленно управлять программами, которьіе отправляются цепочками из одного или более скриптов. Чем качественнее дека, тем больше скриптов в один пайп способен вместить пользователь.
// Звук, +3, 45К/800
// Регулярний набір з потужного монітора на штативі, мікшеру, дим-машини та двух мікро. Дозволить влаштувати адерграунд-сцену в будь-якому місці де є живлення. Для лайву потребує контроллер.
// Сказать прямо
// Карта позволяет в любой момент вьісказать короткий спич применившему ее игроку. В течении спича никто не перебивает, заговоривший во время чужого спича однаждьі получает предупреждение, дваждьі - покидает игру.

// todo перевести в формат карт манчкина
