const COMMANDS = {
    plus: "+",
    buy: "buy",
    rent: "rent",
    talk: "talk",
    sell: "sell"
};

const CARD_TYPES = {
    npc: "npc",
    class: "class",
    loot: "loot",
    sound: "sound",
    prj: "prj",
    dia: "dia",
    anti: "anti"
}

const STRINGS = {
    COMPANION_LONGLINE: "Можеш застосувати на нього ще один клас та дати йому одну шмотку. Якщо втрачаєш Найомничка, клас до тебе повертається, та шмотку втрачаєш із ним. Можеш підставити Найомничка щоб піти від відповідальності за провальний івент.",
    ALBUM_LONGLINE: "Міксуй альбоми на вечірках, один жанр - сильніший ефект.",
    ALBUM_LONGLINE_2: "Міксуй альбоми на вечірках, один жанр - сильніший ефект.<br><br>Комбінуй звук в одному жанрі щоб посилити враження",
    VINYL_LONGLINE: "Платівки можна ставити на вечірках з вініловим звуком.<br><br>Комбінуй звук в одному жанрі щоб посилити враження",
    DEMO_LONGLINE: "Демо можна відправити Лейблу, зіграти на вечірці <br>або навідь видати на вінілі.<br><br>Більше людей його почують, більше шанс на нове замовлення.<br>Комбінуй звук в одному жанрі щоб посилити враження",
    DEMO_LONGLINE_SHORT: "Демо можна відправити Лейблу, зіграти на вечірці <br>або навідь видати на вінілі. <br><br>Комбінуй звук в одному жанрі щоб посилити враження",
    DEMO_LONGLINE_SHORT_2: "Демо можна відправити Лейблу, зіграти на вечірці <br>або навідь видати на вінілі. <br><br>Більше людей його почують, більше шанс на нове замовлення."
}

export { COMMANDS, CARD_TYPES, STRINGS };
