import { DNELootCard, DNEDoorCard, DNEMonsterCard, DNEBUGCard } from "./interface.cards.js";
import { setSoundStat } from "../utils/setSoundStat.js";
import { initSoundCards } from "./dataSound.cards.js";

//=> LOOT START

const initDNELootArr = () => {
    const LootArr = [];


    const ddj400 = new DNELootCard("ddj400", "DDJ-400", "Дозволяє зводити дві стежки, задовольняючи потреби 80% аудиторії будь-якого івенту.", `../img/loot/ddj400.jpg`, 2, "16K/400", "Бонус для DJ-їв", "Дозволяє зводити дві стежки, модифікувати та записувати музику", "", true, true, "loot");
    ddj400.collection = "soundTool";
    LootArr.push(ddj400);

    const plx500 = new DNELootCard("plx500", "PLX-500", "Дозволяє зводити на одну стежку вінілу більше, за наявності Мікшера, задовольняючи потреби 100% аудиторії та підвищуючи задоволення діджеїв від івенту до високого рівня. З ним починаючі артисти готові грати безкоштовно", `../img/loot/plx500.jpg`, 3, "16K/400", "Бонус для DJ-їв", "Дозволяє зводити на одну стежку вінілу більше, за наявності Мікшера, модифікувати та записувати музику.", "", true, true, "loot");
    plx500.collection = "soundTool";
    LootArr.push(plx500);

    const ddjrev1 = new DNELootCard("ddjrev1", "DDJ-REV1", "Дозволяє зводити дві стежки, задовольняючи потреби 100% аудиторії та підвищуючи задоволення діджеїв від івенту до високого рівня. З ним починаючі артисти готові грати безкоштовно", `../img/loot/ddjrev1.png`, 2, "17K/400", "Бонус для DJ-їв", "Дозволяє зводити дві стежки, модифікувати та записувати музику.", "", true, true, "loot");
    ddjrev1.collection = "soundTool";
    LootArr.push(ddjrev1);

    const djflx6 = new DNELootCard("djflx6", "DJ-FLX6", "Дозволяє зводити чотири стежки, задовольняючи потреби 100% аудиторії та підвищуючи задоволення діджеїв від івенту до високого рівня. З ним починаючі артисти готові грати безкоштовно", `../img/loot/djflx6.png`, 4, "36K/700", "Бонус для DJ-їв", "Дозволяє зводити чотири стежки, модифікувати та записувати музику.", "", true, true, "loot");
    djflx6.collection = "soundTool";
    LootArr.push(djflx6);

    const ddjxp2 = new DNELootCard("ddjxp2", "DDJ-XP2", "Додає сетапу ще 32 перформанс пади, що дозволять гнучкіше маніпулювати та модифікувати стежки на льоту. З ним починаючі артисти готові грати безкоштовно", `../img/loot/ddjxp2.jpg`, 2, "19K/300", "Бонус для DJ-їв", "Додає сетапу ще 32 перформанс пади, що дозволять гнучкіше маніпулювати та модифікувати стежки на льоту.", "", true, true, "loot");
    ddjxp2.collection = "soundTool";
    LootArr.push(ddjxp2);

    // const AORUS_SHORTLINE = "Відкриває можливість в режимі реального часу переглядати свій цифровий худ, статистику гравця та можливість зберігати прогрес в LocalStorage. Дає особливі здібності для кожного класу."; // todo добавить возможность шерить на других игроков
    // const AORUS_LONGLINE = `Портативний компьютер на прямому нейронному інтерфейсі, дозволяє пірнати в Кібер-простір, отримуючи так чином доступ до усіх переваг доступних профессійним Нетраннерам. ${AORUS_SHORTLINE}`;
    // LootArr.push(new DNELootCard("aorus5-se4", "AORUS 5 SE4", AORUS_LONGLINE, "https://lh3.googleusercontent.com/-8zozTgk_gMZXuEodcSS5zaBawwHmRZU-0OO9ym3ZOiy3CAYComQSPZqHgZrE_5WXak=w2400", 3, 66999, "", AORUS_SHORTLINE, "", false, true, "loot")); // todo додати в майбутньому каталог, систему прокачки та особливі здібності для кожного классу, що має цей айтем

    const cdj3000 = new DNELootCard("cdj3000", "CDJ-3000", "Дозволяє зводити на одну стежку більше, за наявності Мікшера, задовольняючи потреби 100% аудиторії та підвищуючи задоволення діджеїв від івенту до високого рівня. З ним починаючі артисти готові грати безкоштовно", `../img/loot/cdj3000.jpg`, 3, "130K/1K", "Бонус для DJ-їв", "Дозволяє зводити на одну стежку більше, за наявності Мікшера, модифікувати та записувати музику.", "", true, true, "loot");
    cdj3000.collection = "soundTool";
    LootArr.push(cdj3000);

    const djm250mk2 = new DNELootCard("djm250mk2", "DJM-250MK2", "Дозволяє зводити дві стежки, як з вінілових, так із цифрових програвачів, модифікувати та записувати музику.", `../img/loot/djm250mk2.png`, 2, "12K/200", "Бонус для DJ-їв", "Дозволяє зводити дві стежки, як з вінілових, так із цифрових програвачів, модифікувати та записувати музику.", "", true, true, "loot");
    djm250mk2.collection = "soundTool";
    LootArr.push(djm250mk2);

    const djm750mk2 = new DNELootCard("djm750mk2", "DJM-750MK2", "Дозволяє зводити чотири стежки, як з вінілових, так із цифрових програвачів, модифікувати та записувати музику.", `../img/loot/djm750mk2.png`, 4, "39K/400", "Бонус для DJ-їв", "Дозволяє зводити чотири стежки, як з вінілових, так із цифрових програвачів, модифікувати та записувати музику.", "", true, true, "loot");
    djm750mk2.collection = "soundTool";
    LootArr.push(djm750mk2);

    const djms11 = new DNELootCard("djms11", "DJM-S11", "Дозволяє зводити чотири стежки, як з вінілових, так із цифрових програвачів, модифікувати та записувати музику.", `../img/loot/djms11.png`, 4, "87K/800", "Бонус для DJ-їв", "Дозволяє зводити чотири стежки, як з вінілових, так із цифрових програвачів, модифікувати та записувати музику.", "", true, true, "loot");
    djms11.collection = "soundTool";
    LootArr.push(djms11);

    // const sps585 = new DNELootCard("sps585", "SPS-585", "", `../img/loot/sps585.png`, 2, "2300", "+2 з DDJ-400", "Проста та надійна акустична система на 3.5мм, з якою впорається навіть маля.<br><br>Чудово поєднується з DDJ-400, отримай +2 та ще +1, якщо ти DJ.", "", true, true, "loot");
    // sps585.collection = "soundTool";
    // LootArr.push(sps585);

    // GOPRO
    // LootArr.push(new DNELootCard("i-gopro", "GOPRO", "Дозволяє знімати широкоформатне відео з високою кількістю кадрів на секунду. З відповідними аксесуарами доступне відео від першого лиця, відео з руки та корпусу", "https://lh5.googleusercontent.com/1k2kOk7TOG2p0UjrV6WXnhOnzBtXJUoEMv9XPE-wejGTYDcIU-PkaGZmAeMeXuS08YU=w2400", 2, "20К/500", "Бонус для Відеомейкер"));
    // CASE
    // LootArr.push(new DNELootCard("i-case", "Кейс", "", "https://lh4.googleusercontent.com/ljebY0Mn9_I269WR0_ZlZy4ZU0gbsqZZ0leThMfSmQLn0psfl_wle8F1PZ78JOl2qAc=w2400", 0, "1K", "+1 для Татуєра", "Дозволяє сховати будь-яку кількість предметів загальною площею 21х30х10см, доступ до яких можна отримати лише маючи предмет ключа до цього кейсу", "", false, true, "loot"));
    // CASE KEY
    // LootArr.push(new DNELootCard("i-case-key", "Ключ до кейсу", "Дозволяє отримати доступ до предметів у Кейсі", "https://lh3.googleusercontent.com/JppmmdWBUa0cYPA3LgPLsN2KEvuQTUNuaQkg_lR7ZK-C1YRFiLVSvfda2KOyIbHI1Mo=w2400", 0, 0, ""));
    // LootArr.push(new DNELootCard("i-fishyey", "Око риби", "Дозволяє знімати надширокоформатне відео з середньою роздільною здатністю та середнім фпс", "https://lh4.googleusercontent.com/q6kgHPE-JmWkcHsVXc0Gm_XEV98LUQODkdlxKSPSkuqkNeYXCVA1y2FAY_3s_bJg5oc=w2400", 1, "5К", "Бонус для Відеомейкер"));
    // LootArr.push(new DNELootCard("i-canon", "Професійний фотоапарат", "Дозволяє робити високоякісні цифрові знімки, що можуть бути корисними в різних обставинах. З кожним новим івентом отримуєш атмосферні знімки", "https://lh3.googleusercontent.com/nP83qKzVByeQIgVJLh4uVr-rZ7l-myqfawvze-rAd2bLgvmNl2aLGF7D_zhWk4s9Ajg=w2400", 2, "70K/500", "", "Дозволяє робити високоякісні цифрові знімки, що можуть бути корисними в різних обставинах. З кожним новим івентом отримуєш атмосферні знімки", "", false, true, "loot"));

    // const I_LAMP_IMG_ID = `1d8WtQSXTKoc10IC21YmCHqNnatnadFRK`;
    // const I_LAMP_IMG = `https://drive.google.com/uc?id=${I_LAMP_IMG_ID}`;
    // LootArr.push(new DNELootCard("i-lamp", "Гравілампа", "Кільцева лампа діаметром 55' здатна знаходитись в будь-якій точці простору та освітлювати простір великих розмірів.", I_LAMP_IMG, 1, 5000, "", "Кільцева лампа діаметром 55' здатна знаходитись в будь-якій точці простору та освітлювати простір великих розмірів.", "", false, true, "loot"));
    //
    // LootArr.push(new DNELootCard("i-starlink", "Роутер", "Дает закрьітьій доступ к скоростному интернету до 100мб/с для не менее 5-ти дейвайсов одновременно. Проектьі в пространствах с вай-фаем получают + или - к оправданньім ожиданиям аудитории в зависимости от концепта", "https://lh6.googleusercontent.com/EaDvW4MyDuSjXM5KCWYiyW3TVOMfs35gw7beKLK0elTrJGE7VnMeTWjS8M_0zsOWbfk=w2400", 1, 1200, ""));
    // LootArr.push(new DNELootCard("i-squizer", "Сквізер", "Дає можливість залишити послання невеличкого розміру", "https://lh5.googleusercontent.com/XaXThgj9KO7oFMa_JAFJx9PcMSj3o_FkpCIdeAZyynPGY3E8vhOiOc_C7q951ePTHs0=w2400", 1, 200, "Бонус для Райтера"));
    // LootArr.push(new DNELootCard("i-shwabra", "Швабра", "Дає можливість залишити послання великого розміру", "https://lh3.googleusercontent.com/lQP_8BMVMOuETxH4z16PjtG7P7O3xhGfVAM4MqkKLzfP8bIWdiQwmy9c5vZddHzEw7c=w2400", 2, 400, "Бонус для Райтера"));

    const initFoodCards = () => {
        const FOOD_LONGLINE = (paste) => `Можливість насолодитися ${paste} в компанії друзів просто зараз. Ефект подвоюється якщо разом з нею використати Спалах`;
        // Банан
        //
        //
        const BANAN_LONGLINE = FOOD_LONGLINE("солодким Бананом");
        const BANAN_SHORTLINE = `Satisfaction`;
        const iBanan = new DNELootCard("i-banan", "Банан", BANAN_LONGLINE, `../img/loot/banan.jpg`, 1, 50, "", BANAN_SHORTLINE, "", true, true, "loot");
        iBanan.collection = "food";
        LootArr.push(iBanan);

        // Сінабон
        //
        //
        const SINABON_LONGLINE = FOOD_LONGLINE("смачнющим Сінабоном");
        const SINABON_SHORTLINE = `Eat me`;
        const iSinabon = new DNELootCard("i-sinabon", "Сінабон", SINABON_LONGLINE, `../img/loot/sinabon.jpg`, 1, 100, "", SINABON_SHORTLINE, "", true, true, "loot")
        iSinabon.collection = "food";
        LootArr.push(iSinabon);

        const iHappy = new DNELootCard("i-happy", "Хеппі-Міл", FOOD_LONGLINE("смачнющим Хеппі-Міл"), `../img/loot/happy.png`, 1, 180, "", "Знаю, ти мене хочеш", "", true, true, "loot");
        iHappy.collection = "food";
        LootArr.push(iHappy);

        const iMacMenu = new DNELootCard("i-macmenu", "Мак-Меню", FOOD_LONGLINE("смачнющим Мак-Меню"), `../img/loot/bigmac.jpg`, 1, 240, "", "О так, візьми мене", "", true, true, "loot");
        iMacMenu.collection = "food";
        LootArr.push(iMacMenu);

        const iPizza = new DNELootCard("i-pizza", "Піца", FOOD_LONGLINE("смачнющою Тоні Пепероні з Домінос"), `../img/loot/pizza.jpg`, 2, 420, "", "Смачнюща Тоні Пепероні вже стукає в твої двері. Не змушуй її чекати", "", true, true, "loot");
        iPizza.collection = "food";
        LootArr.push(iPizza);
    }

    // initFoodCards();

    const iFathersSound = new DNELootCard("i-fathers-sound", "Батьків звук", "Раритетний сет звукового обладнання потужністю в 200вт, в який входить: монітор, мікшер та дротова система що живиться від розетки 220V. З якісним контроллером та Діджеєм може розкачати невеличкий натовп до 30 людей, дає широкі можливості для своєї вартості.", `../img/loot/fathers-sound.jpg`, 3, "2K/300", "Велика", "Звук дає можливість ділитися своєю музикою з натовпом. Чим гучніше, тим більше людей зачепить.", "", true, true, "loot");
    iFathersSound.collection = "soundSystem";
    LootArr.push(iFathersSound);

    const iLegacySound = new DNELootCard("i-legacy-sound", "Професійний звук минулого", "Раритетний сет звукового обладнання потужністю в 300вт, в який входить: монітор, мікшер, касетний програвач та дротова система що живиться від розетки 220V. З якісним контроллером та Діджеєм може розкачати невеличкий натовп до 80 людей, дає широкі можливості для своєї вартості.", `../img/loot/legacy-sound.jpg`, 4, "15K/400", "Велика", "Звук дає можливість ділитися своєю музикою з натовпом. Чим гучніше, тим більше людей зачепить.", "", true, true, "loot");
    iLegacySound.collection = "soundSystem";
    LootArr.push(iLegacySound);

    const iRegularSound = new DNELootCard("i-regular-sound", "Потужний звук", "Професійний сет звукового обладнання потужністю в 600вт, в який входить: монітор, мікшер Yamaha, два безпровідні мікро, дим машина, штатив та дротова система що живиться від розетки 220V. З якісним контроллером та Діджеєм може розкачати натовп до 50 людей, чудово підходить для невеликих приміщень.", `../img/loot/regular-sound.jpg`, 6, "40K/1800", "Велика", "Звук дає можливість ділитися своєю музикою з натовпом. Чим гучніше, тим більше людей зачепить.", "", true, true, "loot");
    iRegularSound.collection = "soundSystem";
    LootArr.push(iRegularSound);

    const iVinylSound = new DNELootCard("i-vinyl-sound", "Потужний вініловий звук", "Професійний сет звукового обладнання потужністю в 600вт, в який входить: два монітори, мікшер та два вінілові програвачі, дим машина, штатив та дротова система що живиться від розетки 220V. З якісним контроллером та Діджеєм може підтримувати в тонусі або розкачати натовп до 100 людей, чудово підходить для невеликих та середніх приміщень.", `../img/loot/vinyl-sound.png`, 7, "60K/2800", "Велика", "Звук дає можливість ділитися своєю музикою з натовпом. Чим гучніше, тим більше людей зачепить.<br><br> Дозволяє грати вініл.", "", true, true, "loot");
    iVinylSound.collection = "soundSystem";
    LootArr.push(iVinylSound);

    const iBunnySound = new DNELootCard("i-bunny-sound", "Преміум звук", "Професійний сет домашнього звукового обладнання преміального классу потужністю в 500вт, в який входить: два монітор, мікшер, дим машина та дротова система що живиться від розетки 220V. З якісним контроллером та Діджеєм може підтримувати в тонусі невелике приміщення людей до 30 осіб. Чудово підходить для середніх частот в невеличкому просторі затишних приміщеннь.", `../img/loot/bunny-sound.png`, 5, "80K/1200", "Велика", "Звук дає можливість ділитися своєю музикою з натовпом. Чим гучніше, тим більше людей зачепить.", "", true, true, "loot");
    iBunnySound.collection = "soundSystem";
    LootArr.push(iBunnySound);

    const iPowerfulSound = new DNELootCard("i-powerful-sound", "Надпотужний звук", "Професійний сет звукового обладнання потужністю в 1200вт, в який входить: два монітори, мікшер Yamaha, два безпровідні мікро, дим машина, штатив та дротова система що живиться від розетки 220V. З якісним контроллером та Діджеєм може розкачати натовп до 200 людей, чудово підходить для невеликих та середіх приміщень. В житлових зонах на таке обладнання можуть скаржитись сусіди.", `../img/loot/powerful-sound.jpg`, 10, "70K/3200", "Тільки для DJ. Велика", "Звук дає можливість ділитися своєю музикою з натовпом. Чим гучніше, тим більше людей зачепить.", "", true, true, "loot");
    iPowerfulSound.collection = "soundSystem";
    LootArr.push(iPowerfulSound);

    const iSilentSound = new DNELootCard("i-silent-sound", "Ізольований b2b звук", "Професійний сет звукового обладнання потужністю в 900вт, в який входить: два монітори, мікшер Yamaha, два підвішені мікро, дим машина, штатив та дротова система що живиться від розетки 220V. З якісним контроллером та Діджеєм може розкачати натовп до 100 людей, чудово підходить для невеликих та середіх приміщень. Спеціальзується на одночасному записі, може вмістити до 4х артистів. Завдяки звукоізоляціі навіть в житлових зонах на таке обладнання не буде скарг від сусідів.", `../img/loot/silent-sound.jpg`, 9, "90K/2800", "Велика", "Звук дає можливість ділитися своєю музикою з натовпом. Чим гучніше, тим більше людей зачепить.", "", true, true, "loot");
    iSilentSound.collection = "soundSystem";
    LootArr.push(iSilentSound);

    const iGamerSound = new DNELootCard("i-gamer-sound", "Стрімерський звук", "Професійний сет звукового обладнання потужністю в 400вт, в який входить: два монітори, один вініловий програвач, касетний плеєр, мікшер Yamaha, два бездротові мікро, дим машина, штатив та дротова система що живиться від розетки 220V. З якісним контроллером та Діджеєм може розкачати натовп до 40 людей та підтримувати його в тонусі, чудово підходить для невеликих приміщень. Завдяки звукоізоляціі навіть в житлових зонах на таке обладнання не буде скарг від сусідів.", `../img/loot/gamer-sound.png`, 8, "120K/3400", "Велика", "Звук дає можливість ділитися своєю музикою з натовпом. Чим гучніше, тим більше людей зачепить.", "", true, true, "loot");
    iGamerSound.collection = "soundSystem";
    LootArr.push(iGamerSound);

    const iSpacefulSound = new DNELootCard("i-spacefull-sound", "Просторий звук", "Професійний сет звукового обладнання потужністю в 2000вт, спецільно для якісного наповнення звуком просторих приміщень в який входить: п'ять моніторів, мікшер Yamaha, два безпровідні мікро, дві потужні дим машини, штативи та дротова система що живиться від розетки 220V. З якісним контроллером та Діджеєм може розкачати натовп до 300 людей, чудово підходить для середіх та великих приміщень.", `../img/loot/spacefull-sound.jpg`, 16, "270K/5800", "Тільки для DJ. Велика", "Звук дає можливість ділитися своєю музикою з натовпом. Чим гучніше, тим більше людей зачепить.", "", true, true, "loot");
    iSpacefulSound.collection = "soundSystem";
    LootArr.push(iSpacefulSound);

    const initCarCards = () => {

        // Басік
        const basicCar = new DNELootCard("car-basic", "Басік", "Басік дозволяє перевозити великі речі з точки А в точку B. Головне щоб в тебе було водійське посвідчення, або друг що його має.", `../img/loot/basic.jpg`, 2, "90K/500", "Авто", "Басік дозволяє перевозити великі речі з точки А в точку B. Головне щоб в тебе було водійське посвідчення, або друг що його має.", "", true, true, "loot");
        basicCar.collection = "car";
        LootArr.push(basicCar);
        // Таємничий фургон
        const mysteryTrack = new DNELootCard("car-mystery-track", "Таємничий фургон", "Дозволяє перевозити великі речі з точки А в точку B. Продавець сказав, що має якусь особливість, та не сказав яку.", `../img/loot/mystery-track.png`, 2, "110K/700", "Авто", "Дозволяє перевозити великі речі з точки А в точку B. Продавець сказав, що має якусь особливість, та не сказав яку.", "", true, true, "loot");
        mysteryTrack.collection = "car";
        LootArr.push(mysteryTrack);

        const myAvi = new DNELootCard("car-mini-avi", "Міні-аві", "Дозволяє перевозити великі речі з точки А в точку B. Літає так швидко, що не наздогнати.", `../img/loot/mini-avi.png`, 3, "220K/1700", "Авто", "Дозволяє перевозити великі речі з точки А в точку B. Літає так швидко, що не наздогнати.", "", true, true, "loot");
        myAvi.collection = "car";
        LootArr.push(myAvi);

        const cosmobus = new DNELootCard("car-cosmobus", "Космос-бас", "Дозволяє перевозити великі речі та безліч Найомничків з точки А в точку B. Літає так швидко, що не наздогнати.", `../img/loot/cosmobus.jpg`, 3, "240K/1400", "Авто", "Дозволяє перевозити великі речі та безліч Найомничків з точки А в точку B. Літає так швидко, що не наздогнати.", "", true, true, "loot");
        cosmobus.collection = "car";
        LootArr.push(cosmobus);

        const CAR_FERRARI_SHORTLINE = "Найшвидший транспорт на земній поверхні. Підходить для замовлень де швидкість на першому місці.";
        const CAR_FERRARI_LONGLINE = "Дозволяє перевозити великі речі та одного Найомничка з точки А в точку B.<br><br> Пристебни ремінь, крихітко.";
        const ferrari = new DNELootCard("car-ferrari", "Ферарі", CAR_FERRARI_LONGLINE, `../img/loot/ferrari.jpg`, 4, "370K/5K", "Авто", CAR_FERRARI_SHORTLINE, "", true, true, "loot");
        ferrari.collection = "car";
        LootArr.push(ferrari);
    }

    // initCarCards();

    // Аватар
    //
    //
    const AVATARS_IMG = [
        {
            id: "ttter",
            img: `1qbAUvoaeM9h5RSevlXBIukqjIXeuaisX`
        },
        {
            id: "support",
            img: `1oGR5pBAN1MAzTqjJPmjJEn71grIeH4ml`
        },
        {
            id: "writer",
            img: `1ck2tmnoBqNo3oxRCo7GbESc9F1df9r9I`
        },
        {
            id: "netrunner",
            img: `1ZLp6spRdHVPDXf3BdMc2F60mtWIZn5rY`
        },
        {
            id: "dj",
            img: `1MUH8aWJtvLnkK09q5ZFPQVlImzW1HS24`
        },
        {
            id: "dragonborn",
            img: `16-Pudgm3T9YBQ5lxDANy3laIb-67lZVa`
        },
        {
            id: "olivye",
            img: `1j8UhFJu4jVExfpLUZt3YFE99OjIVvyVD`
        }
    ];
    const initAvatar = (avatarObj) => {
        const AVATAR_LONGLINE = "";
        const AVATAR_SHORTLINE = ``;
        const AVATAR_IMG_ID = `${avatarObj.id}`;
        const AVATAR_IMG = `img/avatars/${AVATAR_IMG_ID}.jpg`;

        LootArr.push(new DNELootCard(`avatar-${avatarObj.id}`, "", AVATAR_LONGLINE, AVATAR_IMG, 0, 0, "", AVATAR_SHORTLINE, "", true, true, "avatar"));
    }
    AVATARS_IMG.forEach((avatarObj) => initAvatar(avatarObj));


    // LootArr.push(new DNELootCard("i-from-paris-wl", "Ваза кокаїну", "Так, це зовсім незаконно. Цю картку можна просто скинути.<br><br> А можна і залишити)", "https://lh4.googleusercontent.com/3EXp5XTiFmNzh17E373Q5eRFptHUJYDzeGaIRMhG07HXXJynWKqbrqZgVzSVKdyqhco=w2400", "13", "800K", "Шериф цим зацікавиться"));
    // LootArr.push(new DNELootCard("i-from-kherson-wl", "Центнер бошок", "Боже правий", "https://lh6.googleusercontent.com/p-HwPSacUlld8yDTA-4yajUhEsUznscnT7M5xfsA1e7K1JpEMGs9vrHr0eT1SpiBqDk=w2400", "25", "5КK", "Шериф цим серйозно зацікавиться"));
    // LootArr.push(new DNELootCard("i-censored-mod", "На любое дерьмо", "Дає можливість отримати легендарні карти неймовірної сили та цінності. Їх використання може призвести до будь-яких наслідків, давай собі в цьому розуміння, якщо наважишся це робити.", "https://lh6.googleusercontent.com/p-HwPSacUlld8yDTA-4yajUhEsUznscnT7M5xfsA1e7K1JpEMGs9vrHr0eT1SpiBqDk=w2400", 0, 0, "Мод"));
    // тип действие
    // LootArr.push(new DNELootCard("set-rumor", "Пустить слух", "Влияет на параметр популярности игрока и его проектов в том ключе в котором будет удобно игроку с самьім вьісоким показателем репутации. Каждьій проект получит + или - к оправданньім ожиданиям аудитории в зависимости от динамики популярности их автора", "", +2, 500, ""));
    // Подключить вай-фай
    // LootArr.push(new DNELootCard("om-wifi", "Подключить вай-фай", "Проектьі в пространствах с вай-фаем получают + или - к оправданньім ожиданиям аудитории в зависимости от концепта", "", +2, 500, "Требует роутер"));
    // LootArr.push(new DNELootCard("om-led", "LED-свет", "Проектьі в пространствах с LED-лентами получают + к комфорту и атмосферьі пространства", "", +1, 500, "За каждую ленту"));
    // LootArr.push(new DNELootCard("om-food", "Кухня", "Проектьі в пространствах с кухней получают + или - к оправданньім ожиданиям аудитории в зависимости от концепта", "", +3, 300, "Если бьіла"));
    // LootArr.push(new DNELootCard("om-flowers", "Цветьі на подоконниках", "Проектьі в пространствах с цветами на подоконниках получают + к уюту и комфорту от времяпрепровождения в нем. Если свете недостаточно света, будут требовать флуорисцентньіе лампьі для жизни.", "", +3, 2000, ""));
    // LootArr.push(new DNELootCard("om-fluor", "Ультрафиолетовьіе лампьі", "Проектьі в пространствах с ультрафиолетом имеют достаточно света чтобьі цветьі росли даже без света. Так же получают + или оправданньім ожиданиям аудитории для любой вечеринки", "", +5, 8000, ""));
    // LootArr.push(new DNELootCard("om-sound", "Включить музьіку", "Проектьі в пространствах с музьікой получают + или - к оправданньім ожиданиям аудитории в зависимости от концепта", "", +2, 1000, "Двойной бонус на вечеринках"));
    // LootArr.push(new DNELootCard("vpyska", "Вписка", "Когда другу нужно где-то переночевать, можешь предоставить ему помощь и когда-то он ответит тебе тем же. Получи плюс к репутации", "", +1, 500, ""));
    // контракт
    // LootArr.push(new DNELootCard("contract-academy", "Академія", "Володіючи достатніми технічними навичками в мовах html, css i js ти зможєш отримувати регулярний середній дохід кожні півтора місяці або частіше, залежно від виконаних задач. Потребує час, приносить гроші", "https://lh6.googleusercontent.com/hTjtpUg711Fwd4dRr_8kjGA_T0Q4ngQwNaxYRyVkeKgwXojwGJbnPDK6JWjeL4-wT8U=w2400", 0, "2h-16h 2К-24К", "Знати html, css i js"));
    // интенсив по верстке
    // LootArr.push(new DNELootCard("i-markup", "Интенсив по верстке", "В течении месяца оснастит тебя достаточньіми техническими навьіками в язьіках html, css i js для того щоб отримувати регулярний середній дохід кожні півтора місяці або частіше, залежно від виконаних задач", "", 0, 5500, "Вміння вчитись"));
    // Вміння вчитись
    // LootArr.push(new DNELootCard("i-learner", "Вміння вчитись", "Дозволяє в певний термін опановувати нові навички", "", 0, 0, ""));
    // Черньій бизнес
    // LootArr.push(new DNELootCard("black-business", "Чорний бізнес", "Дает возможность начать зарабатьівать на любом незаконном действии в случае удовлетворения всем необходимьім критериям успеха", "", 0, 0, ""));
    // Серьій бизнес
    // LootArr.push(new DNELootCard("grey-business", "Сірий бізнес", "Дает возможность начать зарабатьівать на любом действии, которому предшествовало незаконное действие, в случае удовлетворения всем необходимьім критериям успеха", "", 0, 0, ""));
    // Свой бизнес
    // LootArr.push(new DNELootCard("own-business", "Власний бізнес", "Дает возможность начать зарабатьівать на любом действии в случае удовлетворения всем необходимьім критериям успеха", "", 0, 0, ""));
    // Отмьівать деньги
    // LootArr.push(new DNELootCard("money-cleen", "Отмьівать деньги", "Дает возможность единождьі перевести прибьіль за черньій бизнес в чистьіе деньги. Если отмьівать предстоит из бизнеса которьій принадлежит другому игроку, между вами должна бьіть заключена договоренность об всех условиях", "", 0, 4000, "Только для депутатов"));
    // Сервис такси
    // LootArr.push(new DNELootCard("taxify-business", "Сервис такси", "Свой бизнес которьій позволяет вам в режиме реального времени зарабатьівать безналичньій доход за счет поездок сделанньіх игроками владеющими автомобилем в завимости согласованньіх условий и удовлетворении всех критериям качества. Между владельцем сервиса такси и владельцем машиньі, если єто разньіе люди, должна бьіть заключена договоренность обо всех условиях, между вами должна бьіть заключена договоренность об всех условиях", "", 0, 0, "Свой сайт"));
    // Депутат
    // LootArr.push(new DNELootCard("contract-congressman", "Депутат", "Професия депутата дает ряд особьіх возможностей, доступ к закрьітьім источникам и практически неограниченньій бюджет до тех пор пока его действия поддерживаются большинством. Раз в год депутат может бьіть переизбран в случае если за єто проголосует большинство игроков. В таком случае он потеряет все привелегии депутата, даже если оставит у себя физическую копию картьі.", "", 0, 0, "")); // Двери
    // Райтер
    // LootArr.push(new DNELootCard("class-writer", "Райтер", "Здатен бомбити великі шматки, кожен з яких даватиме автору постійний бонус доки його не бафнуть. Чудовий спосіб привернути увагу до події. Бомбити графіті - найдешевший та найшвидший спосіб гучно заявити про своє існування в будь-якому районі Найт-Сіті. За допомогою канцелярського знаряддя здатен швидко популярізвути прості ідеї що можна висловити декількома словами або навіть буквами. Чим лаконічніша ідея, тим легше її тиражувати, тим швидше вона здатна розповсюджуватись. Шериф не залишить це без уваги але і просто так звинуватити не зможе. Пильнуй щоб він був найдалі коли працюєш.", "https://lh5.googleusercontent.com/gmwxg96EzHNXoKY8O0xj1P3IeYP7oMwn4z7SvAg6EAIejeNEbRX-H39VLhET1LmBfxc=w2400", 1, 0, "Клас", "Здатен бомбити великі шматки, кожен з яких даватиме автору постійний бонус доки його не бафнуть.", "", true, true, "class")); // Двери
    // Шериф, Татуєр, DJ
    // LootArr.push(new DNELootCard("class-sherif", "Шериф", "Шериф мирний персонаж що представляє закон в Найт-Сіті. Шериф здатен дізнаватись хто є Мафією та ніхто не здатен напевно знати хто є Шерифом. Має доступ до бази інформації Поліції міста, персонального дрона та патрульної машини спортивного класу.", "https://lh6.googleusercontent.com/F6CSfk4KSbt2b1oN7y0MVoIhdZWtWDeOh6XNsUfTbNRvyfr-1VBQeEqPwx4H5R-Jiuw=w2400", 1, 0, "Клас"));
    // Татуєр
    // LootArr.push(new DNELootCard("class-ttter", "Татуєр", "Наб'є тобі татуху. Регулярно робить це на різноманітних вечірках на які тільки зможе прийти. Завжди радий бачити у власній студії щоб вколоти свіжу масть. Мусить мати чисте місце для роботи, необхідну аппаратуру та матеріали. Кожне його татуювання має особливу властивість. Наб'є тобі татуху. Кожне тату дає власнику особливу властивість до кінця гри, яку саме - обирає татуєр та гейм-майстер. Власник може попросити татуєра дати татуюванню якусь певну властивість, та чи зробить він це знатиме лише гейм-майстер.", "https://lh5.googleusercontent.com/WUvRRRJpFIACJw50hOycHsKNnwSB3SdJSs-_5JQk11pKHMoDstW_n9nzWwb28y_wTUU=w2400", 1, 0, "Клас", "Наб'є тобі татуху. Кожне тату дає власнику особливу властивість до кінця гри, яку саме дізнаєшся лише згодом.", "", true, true, "class"));
    // DJ
    // LootArr.push(new DNELootCard("class-dj", "DJ", "Поставить музику. На протязі гри може ставити музику. Якщо кожен гравець її похвалить, спробує записати Демо, щоб потім ставити його на вечірках, продавати як Альбом в інтернеті і можливо колись навіть записати його на вінілі.<br> Якщо кожен гравець визнає що музика не та, той хто її ставив втрачає цей клас.", "https://lh5.googleusercontent.com/i6Sfz0bcn1Q6HQsSqQhV1QMtCq7pyETASnCXsyswzh7NAZ2iOVdAyQoncZ8mE23BBW8=w2400", 1, 0, "Клас", "Ставить музику. Ти відповідальний за звук, enjoy!", "", true, true, "class"));


    // const NETRUNNER_LONGLINE = "Нетраннер здатен робити неймовірні речі з компьютером. Чим потужніше його обладнання, тим потужніші його можливості. Спектр його дій захоплює все, починаючи з монтажу відео та обробки графіки, закінчуючи розробкою веб-сайтів та 3Д-моделювання.";
    // const NETRUNNER_SHORTLINE = "Нетраннер здатен робити неймовірні речі з компьютером. Чим потужніше його обладнання, тим потужніші його можливості. Спектр його дій захоплює все.";
    // LootArr.push(new DNELootCard("class-netrunner", "Техношаман", NETRUNNER_LONGLINE, "https://lh4.googleusercontent.com/_NvNB3zKOJkiy19PTgbJkCqovWYT1AFdaOLZ5CI9AhTIxAqZR1skE4lxIlniWoWkpUk=w2400", 1, 0, "Клас", NETRUNNER_SHORTLINE, "", true, true, "class"));
    // LootArr.push(new DNELootCard("botnet", "Ботнет", "Мережа фейкових користувачів Instagram що виглядають як звичайні люди, коментують один одного, репостять та надсилають повідомлення з рандомізованим контентом. Можуть миттєво популярізувати будь яку ідею на всю свою аудиторію. Розробити такий не складко, потрібно трохи технічних навичок та багато креативності. Мережевий Дозор зацікавиться їх власником.", "https://lh4.googleusercontent.com/esZ8EbhZ6W4wudZe-Kjm442KRBg_1P3-lePD8HJddEOErmflqrhrVjl3vFHzFhDywFA=w2400", 6, "3К", "Тільки для Компьютермена"));
    // LootArr.push(new DNELootCard("law-belford", "Закон Белфорда", "Математичний закон, що дозволяє перевіряти масиви данних будь-якого об'єму на фальсифікацію.", "", 0, 0, "Тільки для Компьютермена"));
    // LootArr.push(new DNELootCard("class-riper-doc", "Ріпер-док", "Рипер вьтащит из тебя пулю, дочистит деку от демонов, установит кибер-имплант. Требует чистого рабочего места и неоходимую аппаратуру для каждой задачи.", "https://lh4.googleusercontent.com/dCcYzvFtdty2YemyWeXVuSufgM-cBjEQitKSc0hNJd0LbAxk3U6mYsvy-P-z72aFuF4=w2400", 1, 0, "Клас"));
    // LootArr.push(new DNELootCard("i-cyberdeck", "Кібер-дека", "Нетраннерська модифікація мозку, дозволяє завантажувати в мережу та віддалено керувати программами, які відправляються ланцюгами з одного або більше скриптів. Чим якісніша дека, тим більше скриптів в один пайп здатен вмістити її користувач. Об'єм пам'яті: 2 слоти", "https://lh3.googleusercontent.com/d1L38A_1BkvWOxovw9VXYP7N43Nf3lzr0694rItzFJkcdzp1V-28OQaE7um0LPMFGQc=w2400", 1, "10К", "Кібер-імплант"));
    // LootArr.push(new DNELootCard("i-stack", "Карбоновий стек", "Дозволяє зберегти єнграмму особистості щоб завантажити в інше тіло. Процес не є приємним, відновлення може займати від декількох годин, до декількох днів. Таким чином незворотно вбити власника стеку можна лише фізично знищивши стек з енергетичної зброї.", "https://lh6.googleusercontent.com/tnZoBgsKRJl80CrR9alTbiItgE6plsJRSGd83Hts9vEmC3cvGc0WV9MrvEKg22GyO3Q=w2400", 1, "400К", "Кібер-імплант"));
    // LootArr.push(new DNELootCard("class-collector", "Коллекціонер", "Зробить відео-контент з будь-якого творчого задуму. Спробуй використати отримані матеріали щоб розповісти у відео-форматі про свою справу. Хтось може звернути на це увагу та запропонувати тобі роботу.", "https://lh6.googleusercontent.com/c1TwnNfpDleCf4bJp00yiswT7zTrzzfhSjwTWXdBLALXUHYy9dEmYMCEKpHdbWuKfE4=w2400", 1, 0, "Клас", "Здатен бачити спражню цінність предметів, виділяти серед них драгоцінні.<br><br> Надає цю інформацію за розумний відсоток або соковитий аванс", "", true, true, "class"));
    // const BARBER_LONGLINE = "Підстреже тебе швидко та якісно. Гарна новина: Ти маєш постійну роботу в мережі барберів та стабільний заробіток відносно рангу. Погана новина: Ти жінка.<br> Щасти<br><br> Міні-гра:<br>Не дивись їй під спідницю.";
    // LootArr.push(new DNELootCard("class-barber", "Барбер", BARBER_LONGLINE, "https://lh5.googleusercontent.com/swk49Cl7o0LdJzLglojbUTrMZVPS1j2fkGa7-rMJcpuDCwv5HBkunz_vIjrwQa45UFA=w2400", 1, 0, "Клас", BARBER_LONGLINE, "", true, true, "class"));
    // LootArr.push(new DNELootCard("class-videomaker", "Відео-<br>мейкер", "Зробить відео-контент з будь-якого творчого задуму. Спробуй використати отримані матеріали щоб розповісти у відео-форматі про свою справу. Хтось може звернути на це увагу та запропонувати тобі роботу.", "https://lh4.googleusercontent.com/FZFTYr__oUeAQtVUxdlG0AT7A2BMWGKmCL9KECct9KeZK6iacLswIjCpc2aEWfqjk64=w2400", 1, 0, "Клас", "Створює відео-контент з івентів, на які приходить.", "", true));
    // LootArr.push(new DNELootCard("class-shoplifter", "Шопліфтер", "Може дістати для тебе будь-який айтем з магазину вдвічі дешевше, не питай як. Може скинути будь-яку картку з руки щоб з верогідністю 30% вкрасти будь-яку річ іншого гравця, що знаходиться з ним в одному приміщенні та не захищена ключем. Крадіжка важливих предметів, наприклад звуку під час вечірки може призвести до найкатастрофічніших наслідків. В разі невдалої крадіжки тобі доведеться заплатити її власнику компенсацію до 50% від вартості айтему. Охороничок допоможе залишати Шопліфтера за дверима.", "https://lh3.googleusercontent.com/6Wd_TULgCtwHpTisY2Nivlpvcwy8xRw9I6jgMeWF0NMnSZwHA86gcw5RD0fq6-GPFmE=w2400", 1, 0, "Клас", "Може дістати для тебе будь-який айтем з магазину вдвічі дешевше, не питай як.<br><br> Підріж айтем іншого гравця з верогідністю 33% скинувши картку з руки.", "", true, true, "class"));
    // LootArr.push(new DNELootCard("class-seller", "Селлер", "Може продавати айтеми дорожче їх собівартості, та обов'язково попросить відсоток, чим кращий продавець, тим більший. Має можливість працювати на івентах із мерчем та магазинах, щоб отримати додатковий дохід.", "https://lh3.googleusercontent.com/fWeM_q6WoqvpbeZHsyZGK3T1c7l4-xddZJJnNPF0rpEqDyIGzKWynUshmb27N7F_MOs=w2400", 1, 0, "Клас", "Може продати айтеми дорожче собівартості, та обов'язкого візьме відсоток.", "", true, true, "class"));
    // LootArr.push(new DNELootCard("class-streamer", "Стрімер", "Може отримувати донати під час трансляцій. Чим більшу аудиторію має стрімер, тим більше верогідність розмір та кількість донатів. Має можливість працювати на івентах із мерчем, щоб отримати додатковий дохід.", "https://lh4.googleusercontent.com/uWaxdPO9xe4sZXU4UZGrMBx5hQ0GVXnV4Vk-WaqWbokv14PdbenppCzovLvbc4Rw5WM=w2400", 1, 0, "Клас", "Може отримувати донати під час трансляцій. Чим більшу аудиторію має стрімер, тим більше верогідність розмір та кількість донатів.<br> Має можливість працювати на івентах із мерчем, щоб отримати додатковий дохід.", "", true, true, "class"));
    // LootArr.push(new DNELootCard("class-jeweller", "Ювелір", "Вітання, тепер ти маєш здатність створювати дорогоцінні речі з металу та каменю.<br><br> Та май на увазі, постійне використання здібностей такого роду призводить певні метаморфози.", "https://lh6.googleusercontent.com/vZeo459Kvfml9PNnrpt6aB175VWeNr8EEmVo60Ukk64PF7NxGr1rNjJlXAXY8kxC9ZU=w2400", 1, 0, "Клас", "Вітання, тепер ти маєш здатність створювати дорогоцінні речі з металу та каменю.<br><br> Та май на увазі, постійне використання здібностей такого роду призводить певні метаморфози.", "", true, true, "class"));
    // LootArr.push(new DNELootCard("class-photographer", "Фотограф", "Зробить тобі якісні знімки. В істаграмі вартість будь чого росте в рази, коли має якісні знімки, будь це івент, простір або татуювання. Зробивши фото гравця ти маєш шанс згенерувати персонажа на основі його образу. Має можливість працювати на івентах, щоб принести йому більше популярності, шанс нових замовлень та отримати за це додатковий дохід.", "https://lh3.googleusercontent.com/V43LauxtU-trhnzgphBra9iro6BlfDJ3mYQfCSP6jdCkXQY2FTZsBndJvT8Cc6UM-dk=w2400", 1, 0, "Клас"));

    // Шинобі
    //
    //
    // const SHINOBI_CLASS_LONGLINE = "Мистецтво Шинобі - іллюзія. Здатен вивчати бойові мистецтва, дзютсу та використовувати їх у бою";
    // const SHINOBI_CLASS_SHORTLINE = `Здатен вивчати мистецтва ведення бою, Дзютсу та використовувати їх на свою користь.`;
    // const SHINOBI_CLASS_IMG_ID = ``;
    // const SHINOBI_CLASS_IMG = `https://lh3.googleusercontent.com/J9zfpfgBU-x_Ix5SfbLtxnJe7717J__pqa5zGGQ8l_CYeDSOB-xXvDOXcC2jv7aLePI=w2400`;

    // LootArr.push(new DNELootCard("class-shinobi", "Шинобі", SHINOBI_CLASS_LONGLINE, SHINOBI_CLASS_IMG, 1, 0, "Клас", SHINOBI_CLASS_SHORTLINE, "", true, true, "class"));

    // Майстер Бою
    //
    //
    // const COMBAT_MASTER_LONGLINE = "";
    // const COMBAT_MASTER_SHORTLINE = `Пройди курс бойової підготовки, щоб відкривати в собі навички ведення бою.<br><br> Досвідчені фахівці отримують високооплачувану роботу на проєктній основі.<br><br> Чим складніше завдання,<br> тим вище ставки.`;
    // const COMBAT_MASTER_IMG_ID = `1nWqUkT3EPwJ-nw2nwhgWTEsp7Wec4R7I`;
    // const COMBAT_MASTER_IMG = `https://drive.google.com/uc?id=${COMBAT_MASTER_IMG_ID}`;

    // LootArr.push(new DNELootCard("combat-master", "Майстер Бою", COMBAT_MASTER_LONGLINE, COMBAT_MASTER_IMG, 1, 0, "Клас", COMBAT_MASTER_SHORTLINE, "", true, true, "class"));

    // Драйвер
    //
    //
    // const DRIVER_CLASS_LONGLINE = `
    // Щоб освоїти цей клас та отримати доступ до можливостей Драйвера, ти маєш використовувати Душу, кожного разу отримуючи нові здібності натомість.
    // Виконай квест "Перша доставка".
    // Ти музикант, приїхав у нове місто та влаштувався в анонімну службу доставки Клаудпанк.
    // Ти завантажуєш свого вихованця як кастомну особу борт-помічника.
    // Тобі потрібні гроші, щоб знайти нове синтетичне тіло собаки для нього.
    // Доставляючи посилки під всевидячим оком крила корпорацій та пильним наглядом блок постів міста у тебе виникають сумніви у легальному статусі свого роботодавця.`;
    // const DRIVER_CLASS_SHORTLINE = `Драйвер здатен<br> водити Авто як завгодно,<br> та далеко не хто завгодно<br> здатен водити Авто<br><br> як Драйвер.`;
    // const DRIVER_CLASS_IMG_ID = `11vbz4Dx3UfPLTR2GdbhFFDpkGq4LXwWc`;
    // const DRIVER_CLASS_IMG = `https://drive.google.com/uc?id=${DRIVER_CLASS_IMG_ID}`;

    // LootArr.push(new DNELootCard("class-driver", "Драйвер", DRIVER_CLASS_LONGLINE, DRIVER_CLASS_IMG, 1, 0, "Клас", DRIVER_CLASS_SHORTLINE, "", true, true, "class"));

    // Манчкін
    //
    //
    // const MUNCHKIN_LONGLINE = "Грає карти Манчкіну коли йому заманеться, згідно правил, які сам вигадує.<br><br>Можеш не розповідати йому, що це інша гра, він все одно не повірить.";
    // const MUNCHKIN_SHORTLINE = `Грає карти Манчкіну коли йому заманеться, згідно правил, які сам вигадує.`;
    // const MUNCHKIN_IMG_ID = `1MHnPkUgirqzQFRtRoWTMsjdo9zSHTA_X`;
    // const MUNCHKIN_IMG = `https://drive.google.com/uc?id=${MUNCHKIN_IMG_ID}`;

    // LootArr.push(new DNELootCard("class-munchkin", "Манчкін", MUNCHKIN_LONGLINE, MUNCHKIN_IMG, 1, 0, "Клас", MUNCHKIN_SHORTLINE, "", true, true, "class"));


    // Драгрейсер
    // LootArr.push(new DNELootCard("class-drugracer", "Драгрейсер", "", "", 1, 0, "Клас"));
    // LootArr.push(new DNELootCard("class-typograf", "Типограф", "Типограф надрукує тобі будь-яку картку та віддасть за розумний відсоток від її вартості.", "https://lh6.googleusercontent.com/o75I3KWBcZNK5MEn9EYCKrvJK7SYlc65cGLIlDnpf7O5OZsSNQIRtQ7rzY8TXEr-1a8=w2400", 1, 0, "Клас", "Типограф надрукує тобі будь-яку картку та віддасть за розумний відсоток від її вартості.", "", true, true, "class"));

    // Рокраннер
    //
    //
    // const ROCKRUNNER_CLASS_LONGLINE = "Рок-музиканти, співаки, заколотники XXI століття, які перетворили свою музику на зброю і направили її проти корпорацій та урядів, на боротьбу з системою, використовують своє мистецтво для вираження своїх поглядів на політичну чи соціальну ситуацію, відрізняються непохитністю, радикальними висловлюваннями та виступами, що запам'ятовуються.";
    // const ROCKRUNNER_CLASS_SHORTLINE = `Розірве натовп своїм соло, збере гурт та організує виступ<br> за вихідні.<br><br> Щоб на наступні<br> зробити це знову.`;
    // const ROCKRUNNER_CLASS_IMG_ID = `1aOmIiNYZ1cvlIgKUmF3TmWNMdAddpgAg`;
    // const ROCKRUNNER_CLASS_IMG = `https://drive.google.com/uc?id=${ROCKRUNNER_CLASS_IMG_ID}`;

    // LootArr.push(new DNELootCard("class-rockrunner", "Рокраннер", ROCKRUNNER_CLASS_LONGLINE, ROCKRUNNER_CLASS_IMG, 1, 0, "Клас", ROCKRUNNER_CLASS_SHORTLINE, "", true, true, "class"));


    // 2-D
    //
    //
    const TOD_LONGLINE = "";
    const TOD_SHORTLINE = ``;
    const TOD_IMG = `../img/npc/2-D.jpg`;

    LootArr.push(new DNELootCard("i2-d", "2-D", TOD_LONGLINE, TOD_IMG, 0, 0, "Найомничок", TOD_SHORTLINE, "", true, false, "npc"));

    // Murdoc
    //
    //
    const MURDOC_LONGLINE = "";
    const MURDOC_SHORTLINE = ``;
    const MURDOC_IMG = `../img/npc/Murdoc.jpg`;

    LootArr.push(new DNELootCard("murdoc", "Murdoc", MURDOC_LONGLINE, MURDOC_IMG, 0, 0, "Найомничок", MURDOC_SHORTLINE, "", true, false, "npc"));

    // Noodle
    //
    //
    const NOODLE_LONGLINE = "";
    const NOODLE_SHORTLINE = ``;
    const NOODLE_IMG = `../img/npc/Noodle.jpg`;

    LootArr.push(new DNELootCard("noodle", "Noodle", NOODLE_LONGLINE, NOODLE_IMG, 0, 0, "Найомничок", NOODLE_SHORTLINE, "", true, false, "npc"));

    // Noodle
    //
    //
    const RUSSEL_LONGLINE = "";
    const RUSSEL_SHORTLINE = ``;
    const RUSSEL_IMG = `../img/npc/Russel.jpg`;

    LootArr.push(new DNELootCard("russel", "Russel", RUSSEL_LONGLINE, RUSSEL_IMG, 0, 0, "Найомничок", RUSSEL_SHORTLINE, "", true, false, "npc"));

    const GABE_LONGLINE = "Любить своїх фанів. Відповідає на твої імейли. Оплачує своїм робітникам та їх родинам подорож на Гаваї.<br><br>Звісно в нього ти знайдеш найкращий лут, або навідь зможеш придбати.";
    LootArr.push(new DNELootCard("gabe", "Гейб", GABE_LONGLINE, "../img/npc/gabe.jpg", 0, 0, "Мільярдер", GABE_LONGLINE, "", true, true, "npc"));

    // Гейм-майстер
    //
    //
    // const GM_LONGLINE = "Ти - гейм-майстер, розум всесвіту в який отримують запрошення Гравці. Історія їх рішень веде свою розповідь твоїм мовчанням та закінчується твоїм словом.";
    // const GM_SHORTLINE = `Ти - гейм-майстер, розум всесвіту в який отримують запрошення Гравці.<br><br> Історія їх рішень веде свою розповідь твоїм мовчанням та закінчується твоїм словом.`;
    // const GM_IMG_ID = ``;
    // const GM_IMG = `https://lh3.googleusercontent.com/ZTuvzKcI1DXRXzBe7dMlO1oS1TH9KWmfNayttkFz6fw6wEnptPQozduYQHDtjSZOE4M=w2400`;

    // LootArr.push(new DNELootCard("gm", "Гейм-майстер", GM_LONGLINE, GM_IMG, 0, 0, "А", GM_SHORTLINE, "", true, true, "class"));

    // LootArr.push(new DNELootCard("class-engramma", "Енграма", "Якщо тобі ніхто не допомагає можеш зіграти одну карту з руки як копію найсильнішої карти у твоєму лайнапі, тепер їх бонус стає рівним, але додатково не множиться за рахунок жанрів.", "img/avatars/engramma.png", 0, 0, "Клас", "", "", true, true, "class", false));
    LootArr.push(new DNELootCard("class-proxy", "Проксі", "Якщо тобі ніхто не допомагає можеш зіграти одну карту з руки як копію найсильнішої карти у твоєму лайнапі, тепер їх бонус стає рівним, але додатково не множиться за рахунок жанрів.<br><br>Скинь душу на початку свого ходу і кинь d20, випало <br>&gt;15 - виконай його<br>замість іншого<br>гравця на твій вибір,<br>випало інше<br>- хід доведеться<br>пропустити,<br>якщо це 1<br>- втрать душу.", "img/avatars/engramma.png", 0, 0, "Клас", "", "", true, true, "class", false));
    LootArr.push(new DNELootCard("class-dj", "DJ", "У свій хід можеш скинути карту та обрати суперника, обидва киньте d6, якщо в тебе випало число більше, він зобов'язаний тобі допомогти, не вимагаючи нагороди. В іншому випадку можеш скинути карту і спробувати іншого суперника. Не можна перемогти у грі за допомогою цієї здібності. Сума бонусу карт, викладених тобою не може бути менше за суму бонусу карт підкинутих Рятівником.<br><br>Драфти на одну карту більше, подивися отримані карти та одразу скинь одну з них на свій вибір.", "img/avatars/dj.jpg", 0, 0, "Клас", "", "", true, true, "class", false));
    LootArr.push(new DNELootCard("class-writer", "Райтер", "Кинь d6 і зіграй карту Звуку наче її бонус дорівнює числу що випало. Повторюй доки не закінчаться карти в руці. Ти перемагаєш за рівності сил.", "img/avatars/writer.jpg", 0, 0, "Клас", "", "", true, true, "class", false));
    LootArr.push(new DNELootCard("class-ttter", "Татуер", "Коли належить драфтити карти, можеш замість усіх або деяких взяти верхню карту зі скиду.<br>Потім за кожну \"повернуту\" карту скинь одну картку з руки.<br><br>Якщо у твій хід відбулося вторгнення, можеш зіграти до трьох карток, кинувши d6.<br>Їх бонус дорівнюватиме числу що випало.", "img/avatars/ttter.jpg", 0, 0, "Клас", "", "", true, true, "class", false));
    LootArr.push(new DNELootCard("class-support", "Найомничок", "Зіткнувшись із вторгненням у свій хід можеш скинути одну<br>душу, щоб миттєво<br>змусити<br>загарбника<br>забрати свої<br>карти на руку<br>і вийти з<br>раунду.<br><br>Якщо рівень<br>твого лайнапу<br>перевищує рівень очікувань більше,<br>ніж на 9, отримай додаткову душу за перемогу в раунді.", "img/avatars/support.jpg", 0, 0, "Клас", "", "", true, true, "class", false));
    LootArr.push(new DNELootCard("class-olivye", "Олів'є", "Раз на хід можеш скинути одну карту, щоб взяти дві нові.<br>Можеш тримати в руці 6 карток.", "img/avatars/olivye.jpg", 0, 0, "Клас", "", "", true, true, "class", false));
    LootArr.push(new DNELootCard("class-alien", "Прибулець", "Раз на хід скинь будь-яку карту, щоб додати випадкову карту звуку в будь-який лайнап.<br><br>Ти отримуєш на одну душу більше за допомогу. У тебе +1 на змивку.", "img/avatars/alien.jpg", 0, 0, "Клас", "", "", true, true, "class", false));
    LootArr.push(new DNELootCard("class-dragonborn", "Драконо<br>народжений", "Під час вторгнення картки чий бонус менший або дорівнює трьом подвоюють свій бонус.<br>У тебе +1 на змивку якщо ти зібрав лайнап вище 10-го рівня або +2 - якщо вище 15-го.", "img/avatars/dragonborn.jpg", 0, 0, "Клас", "", "", true, true, "class", false));
    LootArr.push(new DNELootCard("class-netrunner", "Нетранер", "Скинь всю руку(не менше 3 карт), ти не втратиш душі в цьому раунді. Отримай карти Звуку, які одержав би за перемогу.<br>Скинь до трьох карт після кидка змивки; кожна дасть +1 на змивку<br>Або одну перед Рейвом, щоб взяти випадкову карту Багу на руку", "img/avatars/netrunner.png", 0, 0, "Клас", "", "", true, true, "class", false));

    // Міхалич
    //
    //
    const MICKHALYCH_LONGLINE = `
        Є справа, друже. Треба знайти декого у місті.<br>
        Він ніс мені важливу інформацію. Зник він десь у районі мосту. Його треба знайти та забрати інформацію, у живого чи мертвого — мені все одно.<br>
        <br>Знайди Вовка на локації, розпитай його. Напевно, він знає, де той може бути.
    `;
    const MICKHALYCH_SHORTLINE = `Тримає Магазин рідкостей у Києві. Хоч і скупий, та досвідчені Шинобі його поважають.<br><br> За свої послуги бере багато, але допомагає новачкам вижити.`;
    const MICKHALYCH_IMG = `../img/npc/mickhalych.png`;

    LootArr.push(new DNELootCard("michalych", "Міхалич", "", MICKHALYCH_IMG, 0, 0, "Найомничок", "", "", true, true, "npc"));

    // LootArr.push(new DNELootCard("support", "Найомничок", "Можеш застосувати на нього ще один клас та дати йому одну шмотку. Якщо втрачаєш Найомничка, клас до тебе повертається, та шмотку втрачаєш із ним. Можеш підставити Найомничка щоб піти від відповідальності за провальний івент. Тримай Найомничка перед собой поряд с іншими айтемами.", "https://lh4.googleusercontent.com/SMs5epImEfomWNvE5FJFJgtvVK3inDgX5oGiaQmwvORuLEMhIkBFn6qaUgMDN216x8U=w2400", 1, 0, "", STRINGS.COMPANION_SHORTLINE, "", true, true, "npc"));

    // const SONYA_LONGLINE = `Бот-найомничок в уборі андроіда, може допомогати, виконуючи прості команди. При активації система дозволяє завантажити будь-яку особистість, що була попередньо записана на носій пам'яті. Відрізняється від інших Найомничків тим що у якості головного модулю встановлена акустична система XB77 із штучним інтелектом Hypnosoft. З встановленою Кібердекою має здатність завантажуваи саунд з будь-яких ресурсів, розпізнавати його та створювати інтерактивні плей-листи. Тож фактично має здатність виконувати роль DJ. Можеш застосувати на нього ще один клас та дати йому одну шмотку. Якщо втрачаєш Найомничка, клас до тебе повертається, та шмотку втрачаєш із ним. Можеш підставити Найомничка щоб піти від відповідальності за провальний івент. Тримай Найомничка перед собой поряд с іншими айтемами.`;
    // const SONYA_SHORTLINE = `Бот-найомничок в уборі андроіда, може допомогати, виконуючи прості команди.<br><br> Завантажувати будь-яку особистість та саунд з будь-яких ресурсів і розпізнавати їх, фактично виконуючи роль DJ або звичайного Найомничка. <br><br>Дай йому клас та шмотку за бажанням.`;
    // const SONYA_IMG_ID = `1kxGyXmYD_Abakvcrc26JAIsNmFZdKiOV`;
    // const SONYA_IMG = `https://drive.google.com/uc?id=${SONYA_IMG_ID}`;
    // LootArr.push(new DNELootCard("sonya-xb77", "Sonya XB77", SONYA_LONGLINE, SONYA_IMG, 1, 0, "Бот-Найомничок", SONYA_SHORTLINE, "", true, true, "npc"));

    // Хайред
    //
    //
    const HIRED_LONGLINE = "";
    const HIRED_SHORTLINE = `Молодий стажер з Пекла, не боїться важкої праці та чудово керує персоналом.`;
    const HIRED_IMG = `../img/npc/hired.png`;

    LootArr.push(new DNELootCard("hired", "Хайред", HIRED_LONGLINE, HIRED_IMG, 0, 0, "Найомничок", HIRED_SHORTLINE, "", true, true, "npc"));

    // Снуп
    //
    //
    const SNOOP_LONGLINE = "";
    const SNOOP_SHORTLINE = `Легенда Хіп-Хоп культури, завжди на висоті і готовий до фристайлу, завжди привітний і перманентно палає.`;
    const SNOOP_IMG = `../img/npc/snoop.png`;

    // -MC
    LootArr.push(new DNELootCard("snoop-dog", "Снуп Дог", SNOOP_LONGLINE, SNOOP_IMG, 0, 0, "Найомничок", SNOOP_SHORTLINE, "", true, true, "npc"));

    // Ребека
    //
    //
    const REBECA_LONGLINE = "";
    const REBECA_SHORTLINE = `Вона повернулась, щоб змінити свою долю назавжди.`;
    const REBECA_IMG = `../img/npc/rebeca.jpg`;

    LootArr.push(new DNELootCard("rebeca", "Ребека", REBECA_LONGLINE, REBECA_IMG, 0, 0, "Найомничок", REBECA_SHORTLINE, "", true, true, "npc"));


    //  Лусіо
    //
    //
    const LUCIO_LONGLINE = "";
    const LUCIO_SHORTLINE = `Try to match <br>this BPM!`;
    const LUCIO_IMG = `../img/npc/lucio.png`;

    // -DJ
    LootArr.push(new DNELootCard("lucio", "Лусіо", LUCIO_LONGLINE, LUCIO_IMG, 0, 0, "Найомничок", LUCIO_SHORTLINE, "", true, true, "npc"));


    // Лялька
    //
    //
    const DOLL_LONGLINE = "";
    const DOLL_SHORTLINE = `Welcome home, good hunter`;
    const DOLL_IMG = `../img/npc/doll.jpg`;

    LootArr.push(new DNELootCard("doll", "Doll", DOLL_LONGLINE, DOLL_IMG, 0, 0, "Найомничок", DOLL_SHORTLINE, "", true, true, "npc"));

    // Механік здатен виконати будь-яку чоловічу роботу по дому, в машині або на івенті. Сильний чоловік що працює за розумні гроші. Має автівку вантажного классу та водійське посвідчення
    LootArr.push(new DNELootCard("mechanic", "Механік", "", "../img/npc/mechanic.png", 0, 0, "Найомничок", "", "", true, true, "npc"));

    // Бойовий Механік
    //
    //
    const COMBAT_MECHANIC_LONGLINE = "Бойовий механік здатна виконати будь-яку роботу не тільки в приміщенні або машині, а навідь на полі бою та прямо під час сутички. Незамінний помічник, елітного рівня, що виручить усюди.";
    const COMBAT_MECHANIC_SHORTLINE = `Бойовий механік здатна виконати будь-яку роботу не тільки в приміщенні або машині, а навідь на полі бою та прямо під час`;
    const COMBAT_MECHANIC_IMG = `../img/npc/combat-mechanic.jpg`;

    LootArr.push(new DNELootCard("combat-mechanic", "Бойовий Механік", "", COMBAT_MECHANIC_IMG, 0, 0, "Найомничок", "", "", true, true, "npc"));

    // LootArr.push(new DNELootCard("porn-prince", "Порно-принц", "Здатен створити гарячий відео-контент з будь-якого творчого задуму. Спробуй використати отримані матеріали щоб розповісти у відео-форматі про свою справу. Хтось може звернути на це увагу та запропонувати тобі роботу.", "https://lh4.googleusercontent.com/FZFTYr__oUeAQtVUxdlG0AT7A2BMWGKmCL9KECct9KeZK6iacLswIjCpc2aEWfqjk64=w2400", 1, 0, "Найомничок", "Здатен створити гарячий відео-контент з будь-якого творчого задуму на твоєму івенті.<br><br> Забезпеч його апаратурою,усе інше - справа техніки.", "", true, true, "npc"));

    // Єва
    //
    //
    const EVA_LONGLINE = "";
    const EVA_SHORTLINE = `Молода дівчина успішно стрімить, майструє крихітні прикраси з епоксидної смоли та дарує Найомничкам, заряджаючи їх енергією.`;
    const EVA_IMG = `../img/npc/eva.jpg`;

    // -Стрімер
    LootArr.push(new DNELootCard("eva", "Єва", "", EVA_IMG, 0, 0, "Найомничок", "", "", true, true, "npc"));

    // Проклятий янгол з сумними очима. Чудово продає речі, бо здатна відрізнити оригінал від підробки та цінує свій відсоток.
    LootArr.push(new DNELootCard("alise", "Aліс`е", "", "../img/npc/alise.png", 0, 0, "Найомничок", "", "", true, true, "npc"));

    // Макіма
    //
    //
    const MAKIMA_LONGLINE = "";
    const MAKIMA_SHORTLINE = `Високопоставлений мисливець на демонів, що служить у Бюро Громадської Безпеки.`;
    const MAKIMA_IMG = `../img/npc/makima.jpg`;

    LootArr.push(new DNELootCard("makima", "Макіма", MAKIMA_LONGLINE, MAKIMA_IMG, 0, 0, "Найомничок", MAKIMA_SHORTLINE, "", true, true, "npc"));


    // Мисливець
    //
    //
    const HUNTER_LONGLINE = "";
    const HUNTER_SHORTLINE = `Полює на монстрів. Захистить твій івент від них за потреби та допоможе здихатись Відповідальності за провал.`;
    const HUNTER_IMG = `../img/npc/lilith.jpg`;

    LootArr.push(new DNELootCard("lilith", "Ліліт", HUNTER_LONGLINE, HUNTER_IMG, 0, 0, "Найомничок", HUNTER_SHORTLINE, "", true, true, "npc"));

    // Діксі
    //
    //
    const DIXI_LONGLINE = "";
    const DIXI_SHORTLINE = `Професійний боєць проїздом з Найт-Сіті. Має найдсучасне кібернетичне тіло та схильність до Кіберпсихозу.<br><br> Її дії не передбачувані, а зброя смертоносна.`;
    const DIXI_IMG = `../img/npc/dixi.jpg`;

    LootArr.push(new DNELootCard("dixi", "Діксі", DIXI_LONGLINE, DIXI_IMG, 0, 0, "Найомничок", DIXI_SHORTLINE, "", true, true, "npc"));


    // i2B
    //
    //
    const I2B_LONGLINE = "";
    const I2B_SHORTLINE = `Бойовий-андроід із твоїх мрій. Допомогає, захищає, муркоче.`;
    const I2B_IMG = `../img/npc/2B.jpg`;

    LootArr.push(new DNELootCard("i2b", "i2B", I2B_LONGLINE, I2B_IMG, 0, 0, "Найомничок", I2B_SHORTLINE, "", true, true, "npc"));

    // Варгус має талант до продажу речей людям та живе щасливим життям, підпрацьовуючи в секс-шопі, у вільний час від книжок та рольових ігор. З радістю допоможе тобі в продажі товарів на івентах, та обов'язково візьме відсоток. Навіть не думай, в неї є подруга.
    LootArr.push(new DNELootCard("vargus", "Варгус", "", "../img/npc/vargus.jpg", 0, 0, "Найомничок", "", "", true, true, "npc"));
    // LootArr.push(new DNELootCard("olivye", "Олів'є", "Олів'є - людина перформанс. Він перетворить на захопливу пригоду навідь звичайнісінький день. Перетворить на товар буквально будь-що, з радістю допоможе тобі в продажі та обов'язково візьме відсоток.", "https://lh6.googleusercontent.com/UPZBku2FlEp8bXCBMhdsRXu2ZRWVrAyLidobt8lMhi82Fudyxexfi7rwCHubrAGSgM4=w2400", 1, 0, "Найомничок", "Олів'є - людина перформанс. Перетворить на товар буквально будь-що, з радістю допоможе тобі в продажі та обов'язково візьме відсоток.", "", true, true, "npc"));
    // Середа переїхала з Харкова і захопилася Київською натурою, від тоді нічне життя столиці її не відпускає. Має талант до продажу рослин та речей з органічних матеріалів. З радістю допоможе тобі в продажі товарів на івентах, та обов'язково візьме відсоток.
    LootArr.push(new DNELootCard("wednesday", "Середа", "", "../img/npc/frog-seller.jpg", 0, 0, "Найомничок", "", "", true, true, "npc"));
    // Клео - надійний товариш, доки ти її друг. Переїхавши з Берліну почала займатися організацією і доводі успішно. Має власне авто, талант до продажу та організації, та працює лише за ідею і тільки з одним гравцем за всю партію.
    // -DJ
    LootArr.push(new DNELootCard("cleo", "Клео", "", "../img/npc/cleo.jpg", 0, 0, "Найомничок", "", "", true, true, "npc"));

    // Сенсей
    //
    //
    const SENSEI_LONGLINE = "";
    const SENSEI_SHORTLINE = `Помстись ворогам. Поверни свою честь. Опануй мистецтво смертельного бою.`;
    const SENSEI_IMG = `../img/npc/sensei.jpg`;

    LootArr.push(new DNELootCard("sensei", "Сенсей", "", SENSEI_IMG, 0, 0, "Найомничок", "", "", true, true, "npc"));

    // Смертельно небезпечний та фантастично дорогий.
    LootArr.push(new DNELootCard("zer0", "0", "", "../img/npc/zer0.png", 0, 0, "Найомничок", "", "", true, true, "npc"));

    // 47
    //
    //
    const F7_LONGLINE = `Agent 47 (also known as \"The Hitman\", or simply by his birth name \"47\", ... the first time as well as Lucas Grey's death, with 47 saying \"he made it count\".`;
    const F7_SHORTLINE = `The IOI<br> bold experiment also known<br> as \"The Hitman\", or simply<br> by his birth name \"47\"`;
    const F7_IMG = `../img/npc/i47.jpg`;

    LootArr.push(new DNELootCard("i47", "47", "", F7_IMG, 0, 0, "Найомничок", "", "", true, true, "npc"));

    // LootArr.push(new DNELootCard("i61", "61", "Trust me, i`am i61", "https://lh6.googleusercontent.com/qumGC_im9tZgoM_aMaItCmCqO37bUO2EYilop2w6PZPSvJQbXmfomdP_tyjrrWux-Rk=w2400", 1, 0, "Найомничок", "Trust me, i`am i61", "", true, true, "npc"));

    // Ghost Dog
    //
    //
    const GHOST_DOG_LONGLINE = "";
    const GHOST_DOG_SHORTLINE = ``;
    const GHOST_DOG_IMG = `../img/npc/ghost-dog.jpg`;

    LootArr.push(new DNELootCard("ghost-dog", "Ghost<br>Dog", GHOST_DOG_LONGLINE, GHOST_DOG_IMG, 0, 0, "Найомничок", GHOST_DOG_SHORTLINE, "", true, true, "npc"));

    // LootArr.push(new DNELootCard("upgrade", "UPGRADE", "Після страшенних травм важко сумісних з життям ви стали учасником державної програми відновлення Апгрейд. Титанові кістки в поєднанні з надсучасним інтерфейсом карбонового спинного мозку роблять можливість в автоматичному режимі чинити опір агресору у ситуаціях рівня небезпеки S та нижче, поки ваша свідомість повністю підтримує лінгвістичні здібності.", "https://lh3.googleusercontent.com/hjjlI54RXzntVQCU3Wluj_wZMKhlxkPth3kQGXeHRqVjyHAeJunEYCI2z5LhYWMup2A=w2400", 1, 0, "", "Після страшенних травм важко сумісних з життям ви стали учасником державної програми відновлення Апгрейд.<br> Титанові кістки в поєднанні з надсучасним інтерфейсом карбонового спинного мозку роблять можливість в автоматичному режимі чинити опір агресору у ситуаціях рівня небезпеки S та нижче.<br><br> Тим часом ваша свідомість повністю підтримує лінгвістичні здібності.", "", true, true, "anti"));
    // LootArr.push(new DNELootCard("upgrade", "UPGRADE", "Після страшенних травм важко сумісних з життям ви стали учасником державної програми відновлення Апгрейд. Титанові кістки в поєднанні з надсучасним інтерфейсом карбонового спинного мозку роблять можливість в автоматичному режимі чинити опір агресору у ситуаціях рівня небезпеки S та нижче, поки ваша свідомість повністю підтримує лінгвістичні здібності.", "https://lh3.googleusercontent.com/hjjlI54RXzntVQCU3Wluj_wZMKhlxkPth3kQGXeHRqVjyHAeJunEYCI2z5LhYWMup2A=w2400", 1, 0, "", "Після страшенних травм важко сумісних з життям ви стали учасником державної програми відновлення Апгрейд.<br> Титанові кістки в поєднанні з надсучасним інтерфейсом карбонового спинного мозку роблять можливість в автоматичному режимі чинити опір агресору у ситуаціях рівня небезпеки S та нижче.<br><br> Тим часом ваша свідомість повністю підтримує лінгвістичні здібності.", "", false, "anti"));
    // Мачете приєднався до ЗСУ щоб вбивати русню в Україні, був взятий в полон під Донецьком, де втік з конц-табору РФ і заліг на дно в Києві. Буде радий будь якій роботі, чудово впорається з охороною, фейсконтролем та зйомками в пілотних епізодах.
    LootArr.push(new DNELootCard("machete", "Мачете", "", "../img/npc/machete.jpg", 0, 0, "Найомничок", "", "", true, true, "npc"));
    // LootArr.push(new DNELootCard("machete", "Мачете", "Мачете приєднався до ЗСУ щоб вбивати русню в Україні, був взятий в полон під Донецьком, де втік з конц-табору РФ і заліг на дно в Києві. Буде радий будь якій роботі, чудово впорається з охороною, фейсконтролем та зйомками в пілотних епізодах.", "https://lh5.googleusercontent.com/gExfGHO7RIkKcdu0kC-md2uTZldiZH-sD4b_ZkQ43LNGKiHngWzWKQwIq1tjSJMRKHg=w2400", 1, 0, "Найомничок", "Охоронничок від бога і співрозмовник чудовий, легко впорається навіть з баром або фейсом", "", true));
    // Молода та відважна рудовласа бестія з півночі. Відома шанувальниця темного етнічного звучання в важкій музиці та впевнений організатор івентів в жанрі Rock. Легендарна організаторка серії підпільних вечірок Зима Близько на підтримку ЗСУ.
    // -Рокраннер
    LootArr.push(new DNELootCard("sansa-stark", "Санса Старк", "", "../img/npc/sansa-stark.png", 0, 0, "Найомничок", "", "", true, true, "npc"));
    // Завжди прийде на поміч якщо ти його друг. З цип хлопцем і в вогонь і в воду, ніколи тебе не залишить, навіть якщо перейшов до іншого гравця.
    LootArr.push(new DNELootCard("naruto", "Наруто", "", "../img/npc/naruto.png", 0, 0, "Найомничок", "", "", true, true, "npc"));
    // Тінь вирішив відпочити від свого всесвіту і чілить у Києві останні місяці. Кажуть від привіз із собою смарагд Хаосу. Спробуй спитати як в нього справи, для твоєї вечірки може бути корисною його знатність рухатись з неймовірною швидкістю.
    LootArr.push(new DNELootCard("shadow", "Тінь", "", "../img/npc/shadow.png", 0, 0, "Найомничок", "", "", true, true, "npc"));
    // LootArr.push(new DNELootCard("gorillaz", "Gorillaz", "Купа підлідків зібрали Рок-гурт та вирішили спробувати свої сили у Києві. Створюють експерементальний саунд, поєднуючи Electro, Рок та Хіп-Хоп напрями. Звучить надсучасно, сподіваюсь їх хтось помітить.", "https://lh4.googleusercontent.com/-dJLEO2gYvSlpBUlUkHuc24Cegq32ZLTrn83vDiOf8-hwuYAkW8eLMHkwKoBvFT8b8k=w2400", 4, 0, "4 Найомничка", "Четверо хлопців шукають роботу.<br><br> Здається, в них власний гурт, створюють експерементальний саунд, поєднуючи<br> Electro, Рок та Хіп-Хоп.<br><br> Звучить надсучасно, сподіваюсь їх хтось помітить.", "", true, true, "npc"));

    const SAYLOR_MOON_LONGLINE = "";
    const SAYLOR_MOON_SHORTLINE = "Юна леді вчиться контролювати свої здібності, пізнаючи себе та світ творчості.<br><br> Відкриття власного клубу та створення дружньої спільноти - її пристрасть та найбільша мрія.";
    LootArr.push(new DNELootCard("saylor-moon", "Сейлор Мун", "", "../img/npc/saylor-moon.jpg", 0, 0, "Найомничок", "", "", true, true, "npc"));

    // Сашко Злих
    //
    //
    const ZLYKH_LONGLINE = "";
    const ZLYKH_SHORTLINE = ``;
    const ZLYKH_IMG = `../img/npc/zlych.jpg`;

    // -DJ
    LootArr.push(new DNELootCard("zlykh", "Сашко Злих", "", ZLYKH_IMG, 0, 0, "Найомничок", "", "", true, true, "npc"));

    const TWINS_LONGLINE = "";
    const TWINS_SHORTLINE = "Близнюки чудово розуміються на командній роботі, як пристрасть до Індустріального звучання, вона в них в крові.";
    LootArr.push(new DNELootCard("twins", "Близнята", "", "../img/npc/twins.jpg", 0, 0, "Найомнички", TWINS_SHORTLINE, "", true, true, "npc"));


    const CHAOS_GREEN_LONGLINE = "Подвоює інкам від івенту.";
    LootArr.push(new DNELootCard("chaos-green", "Смарагд Хаосу", CHAOS_GREEN_LONGLINE, `../img/loot/chaos-green.png`, 0, "222K", "", CHAOS_GREEN_LONGLINE, "", true, true, "loot"));
    // Таємнича княжа особа веде свій бізнес чисто та обачно. Латекс та шкіра - для неї головна пристрасть, а про її івенти складають легенди.
    LootArr.push(new DNELootCard("lady-falko", "Леді Фалько", "", "../img/npc/lady-falko.jpg", 0, 0, "Найомничок", "", "", true, true, "npc"));
    // Всім іноді потрібна перерва. Рок музика дала можливість Эдварду Элрику зробити її для себе. Кажуть він чудово проявляє себе в організації івентів з рок-музикою. Чутово мати такого хлопця в команді, якщо збираєшся влаштувати івент в цьому жанрі.
    // -Рокраннер
    LootArr.push(new DNELootCard("iron-alchemic", "Сталевий Алхімік", "", "../img/npc/iron-alchemic.jpg", 0, 0, "Найомничок", "", "", true, true, "npc"));
    // LootArr.push(new DNELootCard("philosopher-stone", "Філососький камінь", "Дозволяє три рази за гру перетворити одну карту айтему на будь-яку іншу картку айтему. Навіть якщо ця картка одна в грі і вже комусь належить. Айтем, на який було використано камінь набуває усіх властивостей нового айтему, а попередні - втрачає. Від тепер це дві ідеальні копії.", `../img/loot/philosopher-stone.jpg`, 8, "333K", "Тільки для Сталевого Алхіміка", "Дозволяє три рази за гру перетворити одну карту айтему на будь-яку іншу картку айтему. <br><br>Айтем, на який було використано камінь набуває усіх властивостей нового айтему, а попередні - втрачає.<br>Від тепер це дві ідеальні копії.", "", true, true, "loot"));
    // LootArr.push(new DNELootCard("xenium", "Зеній", "Дає можливість перегорнути гру. Тепер для перемоги необхідно досягти протилежного результату відповідно попередньої мети.", "img/loot/xenium.webp", 9, "444K", "", "Дає можливість перегорнути гру.", "", true, true, "loot"));
    // LootArr.push(new DNELootCard("elias-jensen", "Alias Jensen", "", "https://drive.google.com/file/d/1AaIOpGM8FoHQ-LNlqXVIUDvyru5Wl2hC/view?usp=share_link", 1, 0, "Найомничок-MC", "Амбітний новачок нізвідки шукає роботу. Має талант до продажу, пристрасть до Хіп-Хопу та обмаль часу.", "", true, true, "npc"));

    // Elias Jensen
    //
    //
    const ELIAS_JENSEN_LONGLINE = "";
    const ELIAS_JENSEN_SHORTLINE = `Легендарний DJ Детройтської сцени та професійний продюсер з платиновими платівками в таких жанрах як Industrial та EDM`;
    const ELIAS_JENSEN_IMG = `../img/npc/elias-jensen.jpg`;

    // -DJ
    LootArr.push(new DNELootCard("elias-jensen", "Elias Jensen", "", ELIAS_JENSEN_IMG, 0, 0, "Найомничок", "", "", true, true, "npc"));

    // Toxic
    //
    //
    // const TOXIC_LONGLINE = "Купа новачків шукає роботу у місті. Один з таких, кажуть раньше був кухарем, знається на організації публічних івентів. Від MCів завжди чекай біди, а від невідомих MCів тим паче.";
    // const TOXIC_SHORTLINE = `Амбітний новачок нізвідки шукає роботу. Має талант до продажу, пристрасть до Хіп-Хопу та обмаль часу аби зустрітись.`;
    // const TOXIC_IMG_ID = `1-xnMSwzvFqT6NizOFr-4LOruZD1AMqOa`;
    // const TOXIC_IMG = `https://drive.google.com/uc?id=${TOXIC_IMG_ID}`;

    // LootArr.push(new DNELootCard("toxic", "Sertolovo Toxic", TOXIC_LONGLINE, TOXIC_IMG, 1, 0, "Найомничок-MC", TOXIC_SHORTLINE, "", true, true, "npc"));
    // LootArr.push(new DNELootCard("i-sneeker-trunk", "Багажник кросів", "Багажник рідкісних вінтажних кросів, як мене запевнив їх продавець. Звідки вони в нього, я не питав. Цю купу брухту в ідеалі привести до ладу та реалізувати. Гравець або найомничок з класом Продавець здатен продати їх втричі дорожче, але обов'язково візьме відсоток.", "https://lh3.googleusercontent.com/cq-AdJ91YqaIIgmGibDDEP5Vpi77Ppzb3rXXxMzA14r--Tnk1ODXZGpnEaKjMQgjqso=w2400", 0, "80K", "Велика", "Багажник рідкісних вінтажних кросів, як мене запевнив їх продавець.", "", false, true, "anti"));
    // Ілон Таск
    // Таск регулярно донатить ЗСУ на визволення Криму з під контролю Путлера, дарує старлінки та розробляє план розвитку Нового Донецьку. Чудово розуміється у розробці веб-сайтів, апок для смартфонів та дронах. Відчуває ностальгію по власній юності тож завжди радий допомогти молодим даруванням з втіленням найсміливіших ідей.
    // Чудово розуміється на Electroнній музиці та техніці, може домовитись їх придбати вдвічі дешевше, не просто ж так він мільярдер.
    LootArr.push(new DNELootCard("tusk", "Ілон Таск", "", "../img/npc/tusk.png", 0, 0, "Мільярдер", "", "", true, true, "npc"));
    // Рік С-137
    // Так, той самий. В нього завжди при собі його портальна пушка та хто в біса зна що ще. Добре подумай яку справу довірити цій людині. Ніхто не знає що станеться далі.
    // Так, той самий. З ядерним перегаром, літаючою тарілкою зі сміття та мікровсесвітом, накшталт твого, під капотом
    LootArr.push(new DNELootCard("rick", "Рік С-137", "", "../img/npc/rick.png", 0, 0, "Найомничок", "", "", true, true, "npc"));

    // Дідусь Влад
    //
    //
    const VLAD_LONGLINE = "";
    const VLAD_SHORTLINE = ``;
    const VLAD_IMG = `../img/npc/grandfather-vlad.png`;

    LootArr.push(new DNELootCard("vlad", "Дідусь Влад", "", VLAD_IMG, 0, 0, "Найомничок", "", "", true, true, "npc"));

    // A
    //
    //
    const A_LONGLINE = "";
    const A_SHORTLINE = ``;
    const A_IMG = `../img/npc/a.png`;

    LootArr.push(new DNELootCard("a", "A", A_LONGLINE, A_IMG, 0, 0, "Найомничок", A_SHORTLINE, "", true, true, "npc"));

    // D
    //
    //
    const D_LONGLINE = "";
    const D_SHORTLINE = ``;
    const D_IMG = `../img/npc/b.png`;

    LootArr.push(new DNELootCard("d", "D", D_LONGLINE, D_IMG, 0, 0, "Найомничок", D_SHORTLINE, "", true, true, "npc"));

    // LootArr.push(new DNELootCard("ricks-second-portalgun", "Запасна портальна пушка Ріка", "Дозволяє миттєво переміщатись з пункту А в пункт Б. В часі з нею не поподорожуєш, бо Рік зробив її щоб Морті міг швидко ходити за пивом. Не заправляй її спрайтом.", "https://lh5.googleusercontent.com/FvLcgRozAUKRG7UniV9wQnIoNEvckTZ_g8DvU0so9nsPalQfPtkGfHzsNVH14obqe6o=w2400", 5, "300К/5К", "Авто"));
    // Так, поклич цього хлопця, що може піти не так?)
    // Виглядає як порядний Охороничок та вправний Водій
    LootArr.push(new DNELootCard("v", "V", "", "../img/npc/v.png", 0, 0, "Найомничок", "", "", true, true, "npc"));
    // I solve problems
    LootArr.push(new DNELootCard("wolf", "THE WOLF", "", "../img/npc/wolf.jpg", 0, 0, "Найомничок", "I solve problems", "", true, true, "npc"));

    // GENDALF
    //
    //
    const GENDALF_LONGLINE = "";
    const GENDALF_SHORTLINE = `Старий чарівник пристосувався до нових умов.`;
    const GENDALF_IMG_ID = `1xPCA3ckLOBJTJ_cfQ2SZNbkACdnwGiUc`;
    const GENDALF_IMG = `../img/npc/gendalf.jpg`;

    LootArr.push(new DNELootCard("gendalf", "Гендальф", "", GENDALF_IMG, 0, 0, "Найомничок", "", "", true, true, "npc"));

    const LISOVA_MAVKA_LONGLINE = "";
    const LISOVA_MAVKA_SHORTLINE = "Здатна створювати неймовірні напої з природніх речовин та залюбки реалізує свій продукт на твоєму івенті.";
    LootArr.push(new DNELootCard("lisova-mavka", "Лісова Діва", "", "../img/npc/lisova-mavka.jpg", 0, 0, "Найомничок", "", "", true, true, "npc"));

    // SHAMAN
    //
    //
    const SHAMAN_LONGLINE = "";
    const SHAMAN_SHORTLINE = `Майстер дихання та традиційної китайської чайної церемонії.`;
    const SHAMAN_IMG = `../img/npc/shaman.jpeg`;

    LootArr.push(new DNELootCard("shaman", "Шаман", "", SHAMAN_IMG, 0, 0, "Найомничок", "", "", true, true, "npc"));

    // Почіта
    //
    //
    const POCHITA_LONGLINE = `Смерть із цією Тваринкою запускає вступний квест "Одна ніч у Києві" якщо встановлений Мод "Ніч на Землі".`;
    const POCHITA_SHORTLINE = `Може принести себе в жертву, щоб дати воскреснути своєму господареві, коли він зустріне Смерть.`;
    const POCHITA_IMG = `../img/npc/pochita.png`;

    LootArr.push(new DNELootCard("pochita", "Почіта", "", POCHITA_IMG, 0, 0, "Тваринка", "", "", true, true, "npc"));

    // Фелікс
    //
    //
    const FELIX_LONGLINE = "";
    const FELIX_SHORTLINE = `Зіграє з тобою сет b2b. Зігріває та муркоче, загортається в м'які речі і заряджається на сонечку.`;
    const FELIX_IMG = `../img/npc/felix.jpg`;

    LootArr.push(new DNELootCard("felix", "Фелікс", "", FELIX_IMG, 0, 0, "Тваринка-DJ", "", "", true, true, "npc"));

    // Пограти
    //
    //
    const PLAY_LONGLINE = "";
    const PLAY_SHORTLINE = `Дозволь собі зануритись у світ гри на пів годинки`;
    const PLAY_IMG_ID = `1Qoa0B40mSFTaZ7pYDECC8dHgL-xufmsZ`;
    const PLAY_IMG = `https://drive.google.com/uc?id=${PLAY_IMG_ID}`;

    LootArr.push(new DNELootCard("dia-play", "Пограти", PLAY_LONGLINE, PLAY_IMG, 1, "30m", "Дія", PLAY_SHORTLINE, "", true, true, "dia"));

    // Пограти для себе
    //
    //
    const PLAY_FOR_YOURSELF_LONGLINE = "";
    const PLAY_FOR_YOURSELF_SHORTLINE = `Невимушена сесія лише для тебе. Насолоджуйся.`;
    const PLAY_FOR_YOURSELF_IMG_ID = `1MpvpA01Rw-lGIx-7tYMY7Rc8TK_1ZgeN`;
    const PLAY_FOR_YOURSELF_IMG = `https://drive.google.com/uc?id=${PLAY_FOR_YOURSELF_IMG_ID}`;

    LootArr.push(new DNELootCard("dia-play-for-yourself", "Пограти для себе", PLAY_FOR_YOURSELF_LONGLINE, PLAY_FOR_YOURSELF_IMG, 1, "20m", "Дія", PLAY_FOR_YOURSELF_SHORTLINE, "", true, true, "dia"));

    // Нічна гра
    //
    //
    const DIA_NIGHT_PLAY_LONGLINE = "";
    const DIA_NIGHT_PLAY_SHORTLINE = `Одягай кегурумі, кутайся в пледик, хапай ніштяки та пішли скоріш, Сонька чекає.`;
    const DIA_NIGHT_PLAY_IMG_ID = `1EZ8ai1v7_s0ZCtbeQ8JIoXjnTPBq83Kp`;
    const DIA_NIGHT_PLAY_IMG = `https://drive.google.com/uc?id=${DIA_NIGHT_PLAY_IMG_ID}`;

    LootArr.push(new DNELootCard("dia-night-play", "Нічна гра", DIA_NIGHT_PLAY_LONGLINE, DIA_NIGHT_PLAY_IMG, 1, "1⚡ 2h", "Дія", DIA_NIGHT_PLAY_SHORTLINE, "", true, true, "dia"));

    const CALL_MARSELLUS_LONGLINE = "";
    const CALL_MARSELLUS_SHORTLINE = "В тебе нема проблем, друже";
    LootArr.push(new DNELootCard("call-marsellus", "Подзвонити Марселасу", CALL_MARSELLUS_LONGLINE, "https://lh5.googleusercontent.com/kV-iYymA8Iz_UVYOgazjCYk6Mcy_IBTzqnqQ78M_VWGrrY5EIKbeY11VDKhu1Qxq7nw=w2400", 0, "5⚡", "Дія", CALL_MARSELLUS_SHORTLINE, "", true, true, "dia"));

    // Записати сет
    LootArr.push(new DNELootCard("make-dj-set", "Записати професійний DJ-сет", "Дає можливість записати професійний DJ-сет як тільки тобі закортить. Необхідна лише аппаратура та за бажанням камера. Якщо маєш студію, використай цю карту лише за рахунок енергії. Зніми на камеру та зроби трансляцію щоб отримати +1 до бонусу за кожну дію та шанс своїм демо привернути увагу лейблів або отримати проект.", "https://lh5.googleusercontent.com/iZqspQQvU2AWz67qOcOdoM3uuV8_O0uFMuIIsdqnu1HpkaO_d5ASSNcKFsZTyrkNgbg=w2400", 1, "1⚡ 500", "Дія", "Дає можливість записати професійний DJ-сет як тільки тобі закортить.<br><br> Необхідна лише аппаратура та, за бажанням, камера.<br><br> Якщо маєш студію, використай цю карту лише за рахунок енергії.", "", true, true, "dia"));
    // Записати годинний сет
    // У тебе буде година в студії з апаратурою. Бери свій контроллер та показуй що вмієш. Гравець виростивший цю Дію в свій хід гарантовано свій запис та має шанс зробити демо. В подальшій грі демо може зацікавити Лейбл, який запропонує контракт по його продюсуванню. Став своє демо на вечірках щоб його помітили.
    // // Записати сет
    // LootArr.push(new DNELootCard("make-dj-set", "Записати DJ-сет", "Дає можливість записати сет як тільки тобі закортить. Необхідні студія та аппаратура", "https://lh5.googleusercontent.com/iZqspQQvU2AWz67qOcOdoM3uuV8_O0uFMuIIsdqnu1HpkaO_d5ASSNcKFsZTyrkNgbg=w2400", 1, 1000, "Дія"));
    // Записати сет
    LootArr.push(new DNELootCard("make-live", "Запустити трансляцію", "Дає можливість привабити відвідувачів до події або показати важливий матеріал. Потребує камери та підключення до інтернету. Приваблює додаткових відвідувачів, виклади дві додаткові карти аудиторії.", "https://lh3.googleusercontent.com/2Ax7PXdSpzk73m3ANSMV11awPuvp-QAH9o-tm4_mFqahF4jie5h3XfBzofp8wZ9UkIo=w2400", 1, "1⚡ 1h", "Дія", "Приваблює додаткових відвідувачів, виклади дві додаткові карти <br>аудиторії.", "", true, true, "dia"));

    LootArr.push(new DNELootCard("dia-draw", "Малювання", "Використовуй час та енергію для отримання малюнків. Чим більше енергії та часу ти в них вкладеш, тим сильнішими вони будуть. Створення графічного зображення є однією з найдревніших медетацій винайдених людством. Від печерних малюнків кров'ю, до чорнил на папері перенесення власного бачення в матеріальний світ заворожувала людину. Просто бери та починай малювати, уява зробить усе інше.", "https://lh3.googleusercontent.com/oprP-CtoxAG5IWogg2Gn56Pu9MBNfNt35n4gQave2BvFfVA7YlExQdgtjL6t9r_kMsg=w2400", 1, "1⚡ 1h", "Дія", "Використай час та енергію для створення малюнку.<br><br> Чим більше енергії та часу ти в нього вкладеш, тим кращий результат чекатиме на тебе в кінці.<br><br>+1 малюнок в твою коллекцію", "", true, true, "dia"));

    // Код
    //
    //
    const DIA_CODE_LONGLINE = "Використовуй час, енергію та свої навички программування, щоб написати апку на js та html/css. Чим більше енергії та часу ти в них вкладеш, тим кориснішою вона буде.";
    const DIA_CODE_SHORTLINE = `Використай час, енергію та свої навички программування для створення коду.<br><br> Чим більше енергії та часу ти в нього вкладеш, тим кращий результат чекатиме на тебе в кінці.<br><br>+1 кодпен в твою коллекцію`;
    const DIA_CODE_IMG_ID = `1_xdG_U2HiygsrK20rd5EvpVAd5IactFi`;
    const DIA_CODE_IMG = `https://drive.google.com/uc?id=${DIA_CODE_IMG_ID}`;

    LootArr.push(new DNELootCard("dia-code", "Код", DIA_CODE_LONGLINE, DIA_CODE_IMG, 1, "1⚡ 1h", "Dia", DIA_CODE_SHORTLINE, "", true, true, "dia"));

    // Сон
    //
    //
    const SLEEP_LONGLINE = "";
    const SLEEP_SHORTLINE = `Відпочинь щоб відновити сили. Загорнись у теплий пледик разом с подругою на величезному ліжку, щоб отримати додаткові +1 за кожен пункт на протязі усього наступного дня.`;
    const SLEEP_IMG_ID = `1OBgmNUQd927sMFp0XkK69PNf8GqASh0i`;
    const SLEEP_IMG = `https://drive.google.com/uc?id=${SLEEP_IMG_ID}`;

    LootArr.push(new DNELootCard("sleep", "Сон", SLEEP_LONGLINE, SLEEP_IMG, 1, "8h", "Дія", SLEEP_SHORTLINE, "", true, true, "dia"));


    // Флоп
    const FLOP_SHORTLINE = "Швидкий, характерно недбалий, закрас та контур за лічені хвилини, опціонально тінь.<br><br>Як правило достатньо двох банок(високий слім+низький фет) контрастних кольорів.<br><br>Намалювати скетч заздалегідь буде супер";
    const FLOP_LONGLINE = ` $Універсальний солдат в арсеналі Вандала, що з двох банок здатен зробити швидкий закрас та контур за лічені хвилини. Опціонально можна намалювати скетч і впевнитись у результаті до початку роботи.`;
    LootArr.push(new DNELootCard("make-flop", "Флоп", FLOP_LONGLINE, "https://lh3.googleusercontent.com/oAnpZMw-GdG79UEJot10AtxR0buHdZ5KAKhuvsOeLbHSPRHN_EW8srN8Ilc6ItibViU=w2400", 1, "1⚡ 500", "Дія", FLOP_SHORTLINE, "", true, true, "dia"));

    // Забомбити кусок
    const MAKE_PIECE_LONGLINE = "Забомбити кусок можна на будь-якій стіні. Навіть якщо ніхто цього не дозволяв та навіть якщо хтось проти. Вулиця - твій холст. Нехай вона буде святом мистецтва для всіх. Кусок може привернути увагу будь до чого.";
    const MAKE_PIECE_SHORTLINE = "Приверни увагу до себе забомбивши на вечірці<br> величезне графіті.<br><br> Потрібна лише фарба. Якщо вона в тебе є, карта спрацює лише за рахунок енергії.";
    LootArr.push(new DNELootCard("make-piece", "Кусок", MAKE_PIECE_LONGLINE, "https://lh5.googleusercontent.com/-LrxKPIJUhhiMqNOVDdPo07vri3pfz1Y_if2szB_lX63yS06ESUebo8_xUEETw22yb8=w2400", 2, "1⚡ 1K", "Дія", MAKE_PIECE_SHORTLINE, "", true, true, "dia"));

    // Сумісний кусок
    const MAKE_COOP_PIECE_LONGLINE = "Скооперуйся з ще одним(або більше) Райтером щоб забомбити сумісний кусок, що даватиме бонус усім. На Стрічкоткацькій давно не фарбували стіни, час це виправити. Дозволяти це звісно ніхто не буде, та якщо ти знайомий з власниками клубів, це може зійти за аргумент. Один охоронець на КПП. Для такого розміру шматка знадобиться драбина, попитай знайомих або придбай сам. Кольори на твій смак, візьми друзів щоб працювати швидше. Зніми на камеру щоб отримати +1 до бонусу та запис процессу.";
    const MAKE_COOP_PIECE_SHORTLINE = "Скооперуйся з ще одним<br>(або більше) Райтером щоб забомбити сумісний кусок, що даватиме бонус усім.";
    LootArr.push(new DNELootCard("make-coop-piece", "Cумісний кусок", MAKE_COOP_PIECE_LONGLINE, "https://lh4.googleusercontent.com/_-QeG9KGhNojivrs6WmQdlomzmgQiX2Cmd-_Srd5eDwFImJgZYk3PDuehvGUzY_PYxc=w2400", 5, "4⚡ 2K", "Дія", MAKE_COOP_PIECE_SHORTLINE, "", true, true, "dia"));

    // Батьків кусок
    //
    //
    const BIG_PIECE_LONGLINE = "";
    const BIG_PIECE_SHORTLINE = `Зроби величезний кусок, захлистнувши пів будинку на тязі чотирьох Монтан Мед Макс надвисокого тиску.<br><br> Може тоді батько зверне на тебе увагу`;
    const BIG_PIECE_IMG = `https://lh6.googleusercontent.com/aRXdCAgO40cEypP8zVLUdBMzgndfPUzyivJuAHve3K7hOqUTyhvznTjIIkKKuJhmEZE=w2400`;

    LootArr.push(new DNELootCard("make-big-piece", "Батьків кусок", BIG_PIECE_LONGLINE, BIG_PIECE_IMG, 6, "6⚡ 1.6K", "Дія", BIG_PIECE_SHORTLINE, "", true, true, "dia"));
    // Потяг
    const MAKE_TRAIN_PIECE_LONGLINE = "";
    const MAKE_TRAIN_PIECE_SHORTLINE = `Роздай стилю прямо на поїзді. Розроби ескіз в діджиталі, забезпеч фарбу та візьми Найомничка(або Гравця) прикрити спину та/або забомбити разом.<br><br> Більше Райтерів, більше шансів на успіх.`;
    LootArr.push(new DNELootCard("make-train-piece", "Потяг", MAKE_TRAIN_PIECE_LONGLINE, "https://lh5.googleusercontent.com/Mf3V9aRudavOj-zjTawLxbihB27qE1d2MoSc5Mi9PSqflqsO1lhKiIBglOF0ko1BL3Q=w2400", 7, "7⚡ 3K", "Дія", MAKE_TRAIN_PIECE_SHORTLINE, "", true, true, "dia"));

    // Скласти нутрощі у кейс
    // LootArr.push(new DNELootCard("hide-insides-case", "Скласти нутрощі у кейс", "Ви можете дістати серце або мозок та покласти його у кейс. Тепер після вашої смерті, маючи кейс та ключ від нього гравець може воскресити вас, якщо у кейсі знаходиться ваш мозок. Або все що ви мали буде передано гравцю, що матиме кейс та ключ, якщо в кейсі знаходиться ваше сердце. Застосовуючи цю карту гравець вирішує що покласти в кейс, його рішення знає лише гейм-мастер. Одноразова дія, скинь після використання.", "https://lh4.googleusercontent.com/Z7SDwZp_vswKBpfz9MJy1okslUiTfbNvnaQp1cQkd3XfQxwGydioc9WRWDQhdrTQXjE=w2400", 5, "10К", "Дія"));
    // Спалах
    LootArr.push(new DNELootCard("make-puf", "Спалах", "Ви можете використати 1г своїх Квітів щоб забити смачнющий косий розміру XL та розділити цю радість з найближчим колом гравців. Ходять чутки, що просунуті гравці здатні творити магію під час Спалаху. Враження від івенту на якому взривають косяки ростуть до максимуму для всіх івентів, де концепт допускає паління. +1 до виправданих очікувань кожному гравцю за кожен косяк.", "https://lh6.googleusercontent.com/RaCJIJOCn6erGEpLCyXrgq2L_PdlUxR6RVDXmafA0wwQ6iOUCrwjrVt2_35_E4H7pA4=w2400", 1, "300", "Дія", "Використай свої квіти, щоб зробити Спалах. Кажуть він має неймовірну силу, особливо під час вечірок.", "", true, true, "dia"));
    // Блиснути знаннями
    LootArr.push(new DNELootCard("know-better", "Блиснути знаннями", "Блиснути знаннями правил може кожен гравець з цією картою. Як він сказав, так і буде. Будь-який івент отримує + або - 5 до виправданих очікувань аудиторії. Одноразовий айтем.", "https://lh6.googleusercontent.com/Z0_oh_v-ThuF_YQuzYLLB9k_T35I7yk5FE7fvfuBuohUFzfekFju4thMuw-C2Dny-rk=w2400", 5, "5⚡", "Дія", "Будь-який івент отримує + або - 5 до виправданих очікувань аудиторії. Одноразовий айтем.", "", true, true, "dia"));
    // Записати сет
    const MAKE_KABANCHIK_LONGLINE = "Дає можливість терміново привезти великі речі з точки А в точку B. Одноразова карта, після використання скинь.";
    LootArr.push(new DNELootCard("make-kabanchik", "Рванути кабанчиком", MAKE_KABANCHIK_LONGLINE, "https://lh3.googleusercontent.com/D3lF7EoLNhW0st7HHOxKHe_NFPBXk2X0WB-ZZ2rE1Qh1uoDmFdZu6-_-4a_8NVmnGoY=w2400", 1, 700, "Дія", MAKE_KABANCHIK_LONGLINE, "", true, true, "dia"));

    const MAKE_ZAYCHICKOM_DESCRIPTION = "Дає можливість терміново привезти айтем в одну руку, що не є великим, з точки А в точку B. Одноразова карта, після використання скинь.";
    LootArr.push(new DNELootCard("make-zaychickom", "Злітати зайцем", MAKE_ZAYCHICKOM_DESCRIPTION, "https://lh5.googleusercontent.com/GRSCU2MwtGB_MFC8rBA8TH-DAM43J5xUobuYvehwwAH8y4fMMvHZ9XpYtfITfrnz3vM=w2400", 1, 400, "Дія", "Дає можливість терміново привезти айтеми, що не є великими.", "", true, true, "dia"));

    LootArr.push(new DNELootCard("make-after-transfer", "Афтер трансфер", "Розвезе всіх гостей по домівках після закінчення вечірки. Повір, вони будуть тобі за це вдячні.", "https://lh6.googleusercontent.com/kb4mpV8o6NAM_5ydJRplk8wgXmPpx8Bdt2NPzxfDFYVRRVEjafmgFvWBVdkC3zAXL8g=w2400", 3, 2500, "Дія", "Розвезе всіх гостей по домівках після закінчення вечірки. Повір, вони будуть тобі за це вдячні.", "", true, true, "dia"));

    LootArr.push(new DNELootCard("make-its-apex-twin", "Ви не розумієте, це Apex Twin", "+3 до крутості твого лайнапу, однарозовий бонус. Використай цю картку під час викладання будь-якого лайнапу, щоб підняти його рівень і одразу скинь її.", "https://lh6.googleusercontent.com/kb4mpV8o6NAM_5ydJRplk8wgXmPpx8Bdt2NPzxfDFYVRRVEjafmgFvWBVdkC3zAXL8g=w2400", 3, 2500, "Дія", "+3 до крутості твого лайнапу, однарозовий бонус", "", true, true, "dia"));

    // Підтримати Найомничків
    //
    //
    const SUPPORT_SUPPORTS_LONGLINE = "";
    const SUPPORT_SUPPORTS_SHORTLINE = `Підтримай Найомничків щоб зарядити їх додатковою енергією.<br><br>Підвези, як маєш автівку, Спалах допоможе розрядити атмосферу.<br><br>Даруй добро навколо і Всесвіт відповість тобі тим же`;
    const SUPPORT_SUPPORTS_IMG_ID = `1e1G9Q0P5WmJJuFpdsayk7B-sd-uY9vJB`;
    const SUPPORT_SUPPORTS_IMG = `https://drive.google.com/uc?id=${SUPPORT_SUPPORTS_IMG_ID}`;

    LootArr.push(new DNELootCard("support-supports", "Підтримати Найомничків", SUPPORT_SUPPORTS_LONGLINE, SUPPORT_SUPPORTS_IMG, 1, "1⚡ 300", "Дія", SUPPORT_SUPPORTS_SHORTLINE, "", true, true, "dia"));

    // LootArr.push(new DNELootCard("make-french-exit", "Піти по-французьки", "Гравець що використав цю карту, дістає вогнепальну зброю и робить постріл у голову гравця, в адресу якого була використана карта.<br><br> Все, цей гравець мертвий, куля в голову як не як.<br><br> А ти що думав з тобою тут хтось сюсюкатись буде?", "https://lh3.googleusercontent.com/VVGoBbf0sATIkcowuVZuAuJrkjF0C6ZKr2bY43f_f4U4B9Hk9au3Q90d9mGiIZDhKso=w2400", 0, 0, "Дія"));


    LootArr.push(...initSoundCards());


    // LootArr.push(new DNELootCard("i-blank-hoodie", "Бланковий худік", "", "", 1, 1500, ""));
    // LootArr.push(new DNELootCard("money", "Гроші", "Коли вони дзвонять, зазвичай беруть слухавку", "", 1, "∞", ""));
    // LootArr.push(new DNELootCard("leak", "Злив", "Старий добрий спосіб швидко та надійно стати цікавою  та популярною. Обов'язково мати камеру що знімає в 1080p, шакальними відео з туалету вже нікого не зацікавиш. Хочеш посилити ефект? Замов рекламу)", "", 10, 0, "Тільки для дівчат"));
    // LootArr.push(new DNELootCard("only-friends", "Only Friends", "Старий добрий спосіб швидко та надійно перетворити свою популярність у стабільний заробіток. Обов'язково мати камеру що знімає в 1080p та доступ до інтернету і що найменше один раз на тиждень приділяти день роботі. Чим вищий профессіоналізм ти будеш демонструвати, тим вище буде винагороджуватись твоя праця.", "", 2, "2К-60K", "Тільки для дівчат"));
    // LootArr.push(new DNELootCard("i-safe", "Сейф", "Дає суттєвий рівень безпеки будь-яким речам площею 30х40см. Доступ до них може отримати лише володар ключа від сейфу, що виготовляється в єдиному єкземплярі при покупці.", "https://lh6.googleusercontent.com/LaTJIdex8PUbPB0NB7g5BhVVnUeTmq3Fh8wUv0PLbudO8PPoSxBMTOpt24cTq0n05sM=w2400", 0, 3400, ""));
    // LootArr.push(new DNELootCard("i-alarm-button", "Тривожна кнопка", "Миттєво викликає патруль озброєної охорони що прибуває напротязі двох хвилин та чемно питає що сталося. У вартість входить: виїзд майстера, додаток, його активація та налаштування, навчання. Додатково оплачується виїзд групи швидкого реагування: 800 — виїзд і кожні 30 хв - ще 500", "https://lh6.googleusercontent.com/5XhLjs9p0Pmxj2OgcIkIvLVDIrThcCjgO8yptC1NlByuFt-EEVRhsc0JSB_eJ382Gek=w2400", 0, "2К+300/міс", ""));

    // LootArr.push(new DNELootCard("dirty-mouth", "Не почистити зуби", "Ротова вонь дає мінус привабливості. Будь-який івент на який прийде гравець з цією проблемою отримує -2 до виправданих очікувань аудиторії. Може бути скинута після одного івенту або раніше, якщо почистити зуби.", "https://lh5.googleusercontent.com/fXOXvb-4Nu-o1LqenwcbnBhj8BCoFxNLn6Dsez4KU8f2jDpg-cru4RivzjN2uFpXK_0=w2400", 2, 0, "Проблема!"));
    // Боже втручання
    // LootArr.push(new DNELootCard("god-wtf", "Боже втручання", "Ти маєш зіграти цю карту, як тільки її отримав. Усі DJ одразу отримують замовлення на вечірку на Кирилівській! Знайди карту замовлення вечірки на Кирилівській та одразу її активуй. Після проведення цієї вечірки гра закінчиться та виграє гравець з найбільшим капіталом. Якщо ти виграв за рахунок цієї карти, ти в праві підвергнути суперників нещадному реготу.", "https://lh5.googleusercontent.com/oKk0dgYD_pZfoxzwIy_FmLIWw2ffxHfpl0vJwiAXkGYei30EFVrLyMG9K-HvkSmRKRA=w2400", 0, 0, "", "Усі DJ-ї отримують рівень просто зараз, навіть якщо це переможний рівень. Якщо ти виграв за рахунок цієї карти, ти в праві підвергнути суперників нещадному реготу.", "", true, true, "dia"));

    // Нокіа
    //
    //
    const NOKIA_LONGLINE = "";
    const NOKIA_SHORTLINE = `Так, ще працює`;
    const NOKIA_IMG_ID = `1pXrDMWoWJquMqkDbb5eyEAUYzOznq4pl`;
    const NOKIA_IMG = `https://drive.google.com/uc?id=${NOKIA_IMG_ID}`;

    LootArr.push(new DNELootCard("nokia", "Нокіа", NOKIA_LONGLINE, NOKIA_IMG, 1, 0, "Фон", NOKIA_SHORTLINE, "", false, true, "anti"));

    // Воскресіння
    //
    //
    // const RESURRECTION_LONGLINE = "";
    // const RESURRECTION_SHORTLINE = `Дозволяє один раз піднятись після Смертельного удару`;
    // const RESURRECTION_IMG_ID = `1yJyUEOVQe7kjHTZUDsaSUhaUTVFt_MPX`;
    // const RESURRECTION_IMG = `https://drive.google.com/uc?id=${RESURRECTION_IMG_ID}`;

    // LootArr.push(new DNELootCard("resurrection", "Воскресіння", RESURRECTION_LONGLINE, RESURRECTION_IMG, 0, 0, "Дзютсу", RESURRECTION_SHORTLINE, "", true, true, "anti"));
    // LootArr.push(new DNELootCard("resurrection", "Воскресіння", RESURRECTION_LONGLINE, RESURRECTION_IMG, 0, 0, "Дзютсу", RESURRECTION_SHORTLINE, "", false, "anti"));

    // LootArr.push(new DNELootCard("soft-paws", "На м'яких лапках", "З ними ти маєш здатність переміщатись непоітно, а твої рухи стають безшумні. Втрать здатність тримати будь що, бо в тебе лапки. Лапки з Навушками створюють неймовірної сили комбо.", "", 0, 0, "", "З ними ти маєш здатність переміщатись непоітно, а твої рухи стають безшумні. Втрать здатність тримати будь що, бо в тебе лапки.", "", false, "loot"));
    // Спойлер
    // LootArr.push(new DNELootCard("spoiler", "Спойлер", "Спойлер дозволяє дізнатись хто виграє гру і не дати йому це зробити. Навіть якщо він вже мав виграти і кричить про це у весь голос. Рішення залежить тільки від тебе.", "https://lh5.googleusercontent.com/uXfX_bj1898ak2fCQmahc-wipWTmASAPGRQa-ywKRELxW69VRALjVf09rndPQkKpImI=w2400", 0, 0, ""));
    // Водійське посвідчення
    // LootArr.push(new DNELootCard("car-docs", "Водійське посвідчення", "Дозволяє уникнути штрафу від Шерифа, якщо керувати будь-яким транспортним засобом в межах Найт-Сіті.", "https://lh3.googleusercontent.com/PXtkM4KTHKrrhkGnkAdQqurHFp9oPuRABqjaiSciDDQ6Z1KlADcmDbXMWuSRvq_cnk8=w2400", 1, "0", ""));
    // Создать профайл
    // LootArr.push(new DNELootCard("get-profile", "Создать профайл", "Дает доступ к новой странице с профайлом игрока на которого бьіла применена карта", "", 0, 1000, ""));
    // Плазма
    // LootArr.push(new DNELootCard("plasma", "Плазма", "Повьішает комфорт и бюджет пространства. Позволяет показьівать видео на большом єкране, вьізьівая у зрителей вовлечение", "", 0, "25000/500", "Требует крепление"));
    // Зібрати чутки
    // LootArr.push(new DNELootCard("get-rumors", "Зібрати чутки", "Дозволяє дізнатись ставлення різних фракцій до гравця", "", 0, 500, ""));
    // персонажі
    // Яценко
    // LootArr.push(new DNELootCard("yats", "Яценко", "Дозволяє проводити події в Closer", "", 0, 0, ""));
    const NO_RULES_DMT_IMG_ID = `1fIo3eHY8kCPqdlF-vnvfZM9iPwmxjDnU`;
    const NO_RULES_DMT_IMG = `https://drive.google.com/uc?id=${NO_RULES_DMT_IMG_ID}`;

    LootArr.push(new DNELootCard("dmt-breathing-no-rules", "DMT-дихання без правил", "Максимально проста заспокійлива медитація на основі практики холотропного дихання. Нічого складного, просто повторюй за майстром та насолоджуйся. Потребує короткий проміжок часу щоб перезавантажити хімію крові та отримати певну кількість додаткової енергії. Сесія дихання може тривати від 5 до 45 хвилин, даючи тим більше енергії, чем довшою вона була. Кожен гравець що приєнується до сесії дає більше додаткової енергії усім учасникам. Дає можливість наситити тіло киснем та отримати енергії на годину. Для підтримання єфекту на задовільному рівні рекомендується використовувати не частіше одного разу на добу.", NO_RULES_DMT_IMG, 1, "5m", "Медитація", "Заспокійлива медитація позбавлена будь яких правил, what ever works best", "", false, true, "anti", "https://youtu.be/YJ0mCDlwi2Q"));

    LootArr.push(new DNELootCard("dmt-breathing", "DMT-дихання", "Максимально проста заспокійлива медитація на основі практики холотропного дихання. Нічого складного, просто повторюй за майстром та насолоджуйся. Потребує короткий проміжок часу щоб перезавантажити хімію крові та отримати певну кількість додаткової енергії. Сесія дихання може тривати від 5 до 45 хвилин, даючи тим більше енергії, чем довшою вона була. Кожен гравець що приєнується до сесії дає більше додаткової енергії усім учасникам. Дає можливість наситити тіло киснем та отримати енергії на годину. Для підтримання єфекту на задовільному рівні рекомендується використовувати не частіше одного разу на добу.", "https://lh5.googleusercontent.com/giP9SpZzE2TghZ_eEbGlFBd6rCj6KtDQdtxWqk4rArsCotYD0kUK_4drDWieWkdUfzw=w2400", 1, "5m", "Медитація", "Проста заспокійлива медитація для відновлення енергії", "", false, true, "anti", "https://youtu.be/WAi868by1aA"));
    LootArr.push(new DNELootCard("dmt-alkaline-breathing", "Tao Te Ching", "Просунута фокусуюча медитація на основі практики холотропного дихання. Нічого складного, просто повторюй за майстром та насолоджуйся. Потребує короткий проміжок часу щоб перезавантажити хімію крові та отримати певну кількість додаткової енергії. Сесія дихання може тривати від 5 до 45 хвилин, даючи тим більше енергії, чем довшою вона була. Кожен гравець що приєнується до сесії дає більше додаткової енергії усім учасникам. Дає можливість наситити тіло киснем та отримати енергії на годину. Для підтримання єфекту на задовільному рівні рекомендується використовувати не частіше одного разу на добу.", "https://lh3.googleusercontent.com/LBMcaimOv_avTcBhSzXZnSrkvPtOQE_pAJpoQApnPQvX0c_b2hof0uFA4SllGn6Vf1U=w2400", 1, "15m", "Alkaline DMT-дихання", "Просунута тонізуюча медитація для додаткової енергії та миттевого фокусу", "", false, true, "anti", "https://youtu.be/eqGoJzM1F9s"));

    LootArr.push(new DNELootCard("dmt-shamanic-technic", "Шаманічне дихання", "Просунута дворівнева техніка дихання через рот, що складається з двох швидких вдохів на половину легень та повний видих в кінці ітерації.", "https://lh6.googleusercontent.com/0oclNbVaoBfebNJiioiBHMNjiFptXElUd4yvLE2_0NPgYH0PVw4Qg0AUVuGwu7fxK4c=w2400", 1, "", "Техніка", "Просунута техніка дихання через рот, що складається з двох швидких вдохів. +1 до медитацій з нею", "", false, true, "anti"));
    LootArr.push(new DNELootCard("dmt-wim-hof-technic", "Дихання Віма-Хова", "Просунута дворівнева техніка дихання через рот, що складається з двох швидких вдохів на половину легень та повний видих в кінці ітерації.", "https://lh3.googleusercontent.com/jLq3nGiyHFsvIQP0N8z8NScEgURv7gK013bVtKGeutejfw2xJRUspz36x4pjzXQD7yM=w2400", 1, "", "Техніка", "Просунута техніка дихання, що складається з одного глибокого вдоху через рот. Отримай +1 до усіх медитацій з цією технікою", "", false, true, "anti"));
    LootArr.push(new DNELootCard("picnick", "Пікнік", "Хапай подругу та на пляж, сонечко на дворі", "https://lh6.googleusercontent.com/JFMHRRTLGPGvIyj5MURCTrcnBSXxQu28Rx4lUl0JmSXF_NUAD9ozjd-QtQPqQpz0pZs=w2400", 1, "3⚡ 5h", "Пригода", "Хапай подругу та на пляж, сонечко на дворі.<br><br>Використай картки Спалаху або Хеппі-Міл аби зробити його особливим", "", false, true, "anti"));

    const POOL_DAY_LONGLINE = "";
    const POOL_DAY_SHORTLINE = "Сонечко сяє, пташки щебечуть, лолі плескають у воді. Твій карман зігріває два здорових косяка. Один, щоб цей день почати, та ще один, щоб його закінчити.";
    LootArr.push(new DNELootCard("pool-day", "День басейну", POOL_DAY_LONGLINE, "https://lh4.googleusercontent.com/n8qFlaoITH-yHq7uGCfyMx2G79_gStc1gjO0ODMaqTwMAq2LrjFXFnYk5FbOvagAI0U=w2400", 1, "4⚡ 8h 1K", "Пригода", POOL_DAY_SHORTLINE, "", false, true, "anti"));


    const FOREST_DAY_LONGLINE = "";
    const FOREST_DAY_SHORTLINE = "";
    LootArr.push(new DNELootCard("forest-day", "День лісу", FOREST_DAY_LONGLINE, "https://lh5.googleusercontent.com/yHJa_BdTAaNBdmpnu5nKnYPAxLus_KsoYAtcPPEXL91qSxo19S71EkVU0JdgQ30h3Ow=w2400", 1, "1⚡ 12h", "Пригода", FOREST_DAY_SHORTLINE, "", false, true, "anti"));

    LootArr.push(new DNELootCard("flower", "Квітка", "Насичує повітря киснем коли ти спиш, та ласує погляд коли прокидаєшся", "https://lh4.googleusercontent.com/G6o_Ys9Md86JRahzppRJv9QauONxab3IBGV05cSE1BoOBarZSPnUmadf0BJJbtaTojg=w2400", 0, "", "", "Насичує повітря киснем коли ти спиш, та ласує погляд коли прокидаєшся", "", false, true, "anti"));

    // Фон
    //
    //
    const FON_LONGLINE = "Портативний комп'ютерний термінал має низку особливих функцій для кожного. Може бути використаний для дзвінків, роутингу, доступу до Кіберпростору та багато іншого. Чим краще технологічно підкований виробник, тим ширшим буде набір можливостей.";
    const FON_SHORTLINE = `Дозволяє дзвонити Найомничкам, виходити в Мережу, бачити цифровий інтерфейс гри.`;
    const FON_IMG_ID = `1AWl-YY9QslohV0-jO4NRKtIX7UqZ06pm`;
    const FON_IMG = `https://drive.google.com/uc?id=${FON_IMG_ID}`;

    LootArr.push(new DNELootCard("ifon", "Фон", FON_LONGLINE, FON_IMG, 1, 4200, "", FON_SHORTLINE, "", false, true, "anti"));

    LootArr.push(new DNELootCard("unprompted-trip", "Спонтанна подорож", "Дає відчути справжній смак життя та розвиває вміння швидко адаптуватися до нових умов. Використовуючи цю карту ти відпускаєш жагу контролю над власним життям та довіряєш свою долю випадку.", "https://lh5.googleusercontent.com/zjsNPBT05XWGt1ThEvkQqxAXhtBDCgdYYiziaXQQcexhtb3rutoHbuk7yTPqaAxR698=w2400", 0, "", "", "Дає відчути справжній смак життя та розвиває вміння швидко адаптуватися до нових умов. Відпусти жагу контролю над життям та довірся випадку.", "", false, true, "anti"));

    // GAMEBOY
    //
    //
    const GAMEBOY_LONGLINE = "Дозволяє зберегти свій прогрес на GAMEBOY. Перезаписуй збереження скільки завгодно разів, та в тебе тільки один слот. Використовуй в будь який момент свого ходу щоб зберегтись або завантажитись. У випадку смерті ти просто завантажуєшся з останнього збереження. Цей предмет не можна обміняти або купити, лише подарувати, отримавши цю картку від Майстра на початку гри";
    const GAMEBOY_SHORTLINE = `Дозволяє зберегти свій прогрес на GAMEBOY. В будь який момент створи збереження та за потреби використай свій GAMEBOY щоб до нього завантажитись.`;
    const GAMEBOY_IMG = `https://lh4.googleusercontent.com/sN9l6r5xenQZTyUKE5O138NHImoBEvUqKk5LT3A5T8VRifLeSY9WcaPSsCgm_bAobrQ=w2400`;

    LootArr.push(new DNELootCard("gameboy", "GAMEBOY", GAMEBOY_LONGLINE, GAMEBOY_IMG, 0, 0, "", GAMEBOY_SHORTLINE, "", false, true, "anti"));

    // Mr. Mistix
    //
    //
    const MR_MISTIX_LONGLINE = "";
    const MR_MISTIX_SHORTLINE = `Присвятить життя тому щоб виконати одне твоє бажання, після чого назавжди зникне`;
    const MR_MISTIX_IMG_ID = `1a1apWkm5lJ3YcKAdvdUnvBUcy8IKmVHB`;
    const MR_MISTIX_IMG = `https://drive.google.com/uc?id=${MR_MISTIX_IMG_ID}`;

    LootArr.push(new DNELootCard("mr-mistix", "Mr. Mistix", MR_MISTIX_LONGLINE, MR_MISTIX_IMG, 0, 0, "Одноразова картка", MR_MISTIX_SHORTLINE, "", false, true, "anti"));

    // Кільце влади
    LootArr.push(new DNELootCard("power-ring", "Кільце влади", "Посилює найсильніші якості носителя, покращуючи їх до максимуму відносно обставин. Кільця влади можуть бути різної форми та рівнів могутності, залежно від майстра що його викував, рідкості матеріалу та каменю. З часом використання пробуджує темні сторони особистості носія та поступово підкоряє його власній волі. Кільце влади завжди вірне лише своєму творцю, завжди прагне до нього і чим більше наближається, тим могутнішим стає.", "https://lh4.googleusercontent.com/dWwMABhNjnvI-OOzxZDgmEqELhIfSJ25Ru8fR0hflXz1Ufd3Tr-jXDtZKTKVQ3dIxzk=w2400", 4, 0, "Драгоцінність", "Посилює найсильніші якості носителя, покращуючи їх до максимуму відносно обставин.", "", false, true, "anti"));

    // 1UP
    //
    //
    const IUP_LONGLINE = "";
    const IUP_SHORTLINE = `Ще одне життя. Так, ти можеш почати усе з початку. Використай цю картку щоб врятувати від Смерті побратима.`;
    const IUP_IMG = `https://lh4.googleusercontent.com/Tp-OCYgwdmmEESRTfr5pVRypB46latBy3uAIOqbhsKlghxUsKAPN48RuUD_leLquyEM=w2400`;

    // LootArr.push(new DNELootCard("iup", "1UP", IUP_LONGLINE, IUP_IMG, 0, 0, "", IUP_SHORTLINE, "", true, true, "anti"));
    LootArr.push(new DNELootCard("iup", "1UP", IUP_LONGLINE, IUP_IMG, 0, 0, "", IUP_SHORTLINE, "", false, "anti"));

    // LootArr.push(new DNELootCard("tea-break", "Перерва на чай", "Дозволяє структурувати думки та наповнитись теплом чаю. Отримай свіжу енергію.", "https://lh6.googleusercontent.com/8MI06infbLkWNJCmXKTVbMgdTpssFnCfwu4A_MdURrkFaJyzWMlbNzd6GOulWRXYUz0=w2400", 1, "15m", ""));
    // LootArr.push(new DNELootCard("moving", "Переїзд", "Використай зв'язки щоб позбавити іншого гравця студії. Він одразу пропускає хід та має витратити 3К щоб перевести свої великі речі на склад, інакше їх буде втрачено.", "https://lh4.googleusercontent.com/6E7iqRHUF0X_5GHgRrD35Zwg0FYMhvc-DdqoZOYlQ44dAbHP79XfUTAnVueigimk_Ts=w2400", 4, 0, "Проблема!"));
    // LootArr.push(new DNELootCard("zero-ambition", "Нульові амбіції", "Зацькуй іншого гравця разом зі своїми Найомничками, щоб позбавити його мотивації діяти. Настіпні три ходи він може тільки витрачати гроші. Щоб використати цю карту, треба мати що найменше 2х найомничків. +1 пропущений хід та -1 бонус за кожного наступного наймничка, якщо їх більше.", "https://lh6.googleusercontent.com/1RPpDAYIjBGRsJJ5TNVSrWO5mtP1hG3PKMx34dwQ4b3c9bwUnz8G9xtNfMGWCAefptc=w2400", 3, 0, "Проблема!"));
    // LootArr.push(new DNELootCard("breakdown", "Панічний ступор", "Накрути іншого гравця разом зі своїми Найомничками, щоб впевнити його що він не встигає. На наступному своєму івенті він має виправдати очікування аудиторії тільки за рахунок лайн-апу. Щоб використати цю карту, треба мати що найменше 2х найомничків. -1 бонус за кожного наступного наймничка, якщо їх більше.", "https://lh6.googleusercontent.com/xffJ6AXD2wxPi3wFRNgga9iUOmIWXQV7QY8QdidqiCytZF57nNHI_zRAAbtqZSXpb0o=w2400", 2, 0, "Проблема!"));
    // LootArr.push(new DNELootCard("seppuku", "Сеппуку", "Ти мертвий.", "https://lh5.googleusercontent.com/zyr6pz4k23-dqGhGpyEe-hJMIxOCR2vjBPYtiBhetHY_TJ9dfJtTEbZ-yipb-TqYYYM=w2400", 0, 0, ""));
    // LootArr.push(new DNELootCard("gameboy", "GAMEBOY", "Дозволяє зберегти свій прогрес на GAMEBOY. Перезаписуй збереження скільки завгодно разів, та в тебе тільки один слот. Використовуй в будь який момент свого ходу щоб зберегтись або завантажитись. У випадку смерті ти просто завантажуєшся з останнього збереження. Цей предмет не можна обміняти або купити, лише подарувати, отримавши цю картку від Майстра на початку гри", "https://lh4.googleusercontent.com/sN9l6r5xenQZTyUKE5O138NHImoBEvUqKk5LT3A5T8VRifLeSY9WcaPSsCgm_bAobrQ=w2400", 0, "0", ""));
    // LootArr.push(new DNELootCard("e", "∄", "Nicht heute", "https://lh3.googleusercontent.com/0lBFAvAVJ4mxoyJ8WNXz8EE_cesilaNQXOMOcHrD1vRr1CG0JVyF9l8oOI4fZo4ivyo=w2400", 0, "0", "", "", "", true, true, "anti", ""));

    return LootArr;
}

const DNELootArr = initDNELootArr().filter(card => card.isBuild);

DNELootArr.forEach((card) => {
    if (card.type === "sound") {
        setSoundStat(card);
    }
});

//=> LOOT END

//=> DOORS START

const initDNEDoorArr = () => {
    const DoorArr = [];

    // 1AM LOFI SESSION
    //
    //
    const BALANCE_LONGLINE = "Старі друзі вриваються на Нижньоюрківську з масштабним івентом на два Клуби та запрошують тебе увірватись разом.";
    const BALANCE_SHORTLINE = `${BALANCE_LONGLINE}`;
    const BALANCE_IMG_ID = `1HmI00iUUFcUbDLR-Vln4RWVKh8vWdWjc`;
    const BALANCE_IMG = `https://drive.google.com/uc?id=${BALANCE_IMG_ID}`;

    DoorArr.push(new DNEDoorCard("prj-balance", "БАЛАНС", BALANCE_LONGLINE, BALANCE_IMG, 7, "16h", "Tea Unity", "DJ,Гейм-майстер,Чайний майстер,Zen-інструктор", "", "?", "Усі доступні", BALANCE_SHORTLINE, "", true, true, "prj"));


    // 1AM LOFI SESSION
    //
    //
    const I_AM_LOFI_SESSION_LONGLINE = "Запиши коротке Демо, до 20m в жанрі Lo-fi, щоб зацікавити лейбл. Можливість записати ексклюзивний сет для видання на касетах або вінілі, якщо твоє демо прозведе враження.";
    const I_AM_LOFI_SESSION_SHORTLINE = `${I_AM_LOFI_SESSION_LONGLINE}`;
    const I_AM_LOFI_SESSION_IMG_ID = `1XTVXsGZvfDQB2rq6c8zpF4CN9sXlkuq3`;
    const I_AM_LOFI_SESSION_IMG = `https://drive.google.com/uc?id=${I_AM_LOFI_SESSION_IMG_ID}`;

    DoorArr.push(new DNEDoorCard("prj-i-am-lofi-session", "1AM LOFI SESSION", I_AM_LOFI_SESSION_LONGLINE, I_AM_LOFI_SESSION_IMG, 1, "1h", "Lofi Girl", "DJ", "", "?", "Платіж", I_AM_LOFI_SESSION_SHORTLINE, "", true, true, "prj"));

    // Cyberpunk Online
    //
    //
    // const CYBERPUNK_ONLINE_LONGLINE = "";
    // const CYBERPUNK_ONLINE_SHORTLINE = `Just do it.`;
    // const CYBERPUNK_ONLINE_IMG_ID = `1SAFT9um4Wk8jr42g5pSzDXPiaZ9VxcRO`;
    // const CYBERPUNK_ONLINE_IMG = `https://drive.google.com/uc?id=${CYBERPUNK_ONLINE_IMG_ID}`;

    // DoorArr.push(new DNEDoorCard("prj-cyberpunk-online", "Cyberpunk Online", CYBERPUNK_ONLINE_LONGLINE, CYBERPUNK_ONLINE_IMG, 40, "?", "Green House", "Найомничок", "Усі витрати на замовнику, виконай роботу на вищому рівні щоб отримати особливий бонус від замовника.", "?", "", "", "", true, true, "prj"));
    DoorArr.push(new DNEDoorCard("prj-game", "Настільна гра", "Ваш друг пропонує вам розробити власну колекційну карткову гру. Виготовіть пілотну партію на 254 картки за тиждень і зіграйте найпершу пригоду в історії зі своїми друзями.", "https://lh6.googleusercontent.com/88QzQQ3A_d2Ay7UT7pakKhHI_JkLFM70HrMOM2IXWLKIRckIMNJ2OR_ynfQMNgouips=w2400", 1, "420 8h", "Green House", "Найомничок", "Усі витрати на тобі", "", "", "Твій друг притяг пусті карти з манчкіну та розповідає що має шалену ідею для гри.", "", true, true, "prj"));
    DoorArr.push(new DNEDoorCard("prj-ee-dragobrat", "EE: <span style='letter-spacing: -2.4px;'>Hi-Lite</span>", "Розробка 8-ми годинного івенту, що складатиме лайв виступи підбірки артистів в жанрі важкої Electroніки. Чим більше організаційних питань вирішено без допомоги клубу, тим більше заробіток від продажу. У разі успішного виконання, картку замовлення можна залишити собі і використати знову, організувавши нову ітерацію цьогож івенту. Вартість організації кожної наступної ітерації подвоюється.", "https://lh3.googleusercontent.com/_fp6uXNNwaRaxoX8ttxY78-UzNOn0nXxL5s4Cxc7nP7lED_U-VqoAo6OMolxR_2k4kQ=w2400", 2, "5К", "EE", "DJ* Татуер* Чай*", "Усі витрати на організаторі, якщо івент зібрав менше 50% від бюджету, карта скидається", "?", "Усі доступні", "Розробка івенту-подорожі в горах на вільних умовах", "", true, true, "prj"));
    // Influence Operations
    // Замовлення, 8lvl
    const PRJ_INFLUENCE_IMG_ID = `139AibVxbAKjyP8dbUdzHR8P0IyqIBcWL`;
    const PRJ_INFLUENCE_IMG = `https://drive.google.com/uc?id=${PRJ_INFLUENCE_IMG_ID}`;
    DoorArr.push(new DNEDoorCard("prj-influence", "Influence Operations", "Замовлення на розробку дебютного діджитал-альбому для артиста лейблу BODY Music, що складатиме мастеринг альбому та продаж в дві хвилі. <br> Картка може бути використана повторно, кожного разу потребуючи новий бюджет та даючи новий прибуток.", PRJ_INFLUENCE_IMG, 4, "2K", "BODY Music", "DJ, Відеомейкер*", "BODY Music має затвердити роботу інакше витрачені час та енергія не будуть сплачені грошима", "7K/14K", "Платіж", "Розробка дебютного альбому. Виконай замовлення повторно, щоб отримати більший профіт.", "", true, true, "prj"));

    DoorArr.push(new DNEDoorCard("prj-open-air", "OPEN AIR", "Розробка 8-ми годинного івенту, що складатиме лайв виступи підбірки артистів в жанрі важкої Electroніки. Чим більше організаційних питань вирішено без допомоги клубу, тим більше заробіток від продажу. У разі успішного виконання, картку замовлення можна залишити собі і використати знову, організувавши нову ітерацію цьогож івенту. Вартість організації кожної наступної ітерації подвоюється.", "https://lh5.googleusercontent.com/scqgFRn9nLg64BMQFcGh6xobDxZAjS1doFaOxvd2ro-q72IhoooxDp_7NeBiGLfSycE=w2400", 5, "6К", "Laboratorium", "DJ Охороничок Фейс* Бармен*", "Усі витрати на організаторі, якщо івент зібрав менше 50% від бюджету, карта скидається", "10K/24K/48K", "Вхід, Бар, Онлайн-каса", "Влаштуй лайтовий музичний вечір для старих знайомих.", "", true, true, "prj"));

    DoorArr.push(new DNEDoorCard("prj-open-air", "STRICHKA", "Розробка 8-ми годинного івенту, що складатиме лайв виступи підбірки артистів в жанрі важкої Electroніки. Чим більше організаційних питань вирішено без допомоги клубу, тим більше заробіток від продажу. У разі успішного виконання, картку замовлення можна залишити собі і використати знову, організувавши нову ітерацію цьогож івенту. Вартість організації кожної наступної ітерації подвоюється.", "https://lh6.googleusercontent.com/ZbX_IVe3LzCa5fqSpfxx0OuLlsIWQQvqD58Z6JUrGxWBVRyDwyJDLwNm7UYGhKvnaj0=w2400", 44, "500К", "Closer", "DJх45, Охоронна компапія, Фейс х3, Бармен х6", "Усі витрати на організаторі, якщо івент зібрав менше 50% від бюджету, організатор виплачує збитки", "2КК", "Виплата"));
    DoorArr.push(new DNEDoorCard("prj-ee-in-the-rain", "EE: <span style='letter-spacing: -2.4px;'>DITR</span>", "Розробка 8-ми годинного івенту, що складатиме лайв виступи підбірки артистів в жанрі важкої Electroніки. Чим більше організаційних питань вирішено без допомоги клубу, тим більше заробіток від продажу. У разі успішного виконання, картку замовлення можна залишити собі і використати знову, організувавши нову ітерацію цьогож івенту. Вартість організації кожної наступної ітерації подвоюється.", "https://lh3.googleusercontent.com/IvwG4edQe9LEYQD1X9AEL5wpFPl5ckAH6vTwClAhsc3qcxVgSE98g-FZfyfMyEhAwgs=w2400", 6, "15К", "EE", ">5DJ Охороничок Фейс* Татуер* Чай* Бармер* Сапорт*", "Усі витрати на організаторі, якщо івент зібрав менше 50% від бюджету, карта скидається", "?", "Вхід Бар* Онлайн-каса*", "Розробка вечірки в жанрі Electro з потужним звуком та 8-ми годинним лайнапом у просторому приміщенні на вільних умовах", "", true, true, "prj"));
    DoorArr.push(new DNEDoorCard("prj-ee-everything-you-wish", "EE: <span style='letter-spacing: -2.4px;'>EYW</span>", "Розробка 8-ми годинного івенту, що складатиме лайв виступи підбірки артистів в жанрі важкої Electroніки. Чим більше організаційних питань вирішено без допомоги клубу, тим більше заробіток від продажу. У разі успішного виконання, картку замовлення можна залишити собі і використати знову, організувавши нову ітерацію цьогож івенту. Вартість організації кожної наступної ітерації подвоюється.", "https://lh6.googleusercontent.com/Ztm83T-tjo2EL3LSmp3XsZZ26BlYTiJEf_vROgQkhsQRn-rv1q_yDOzq4VLa5J7WrLQ=w2400", 7, "15К", "EE", ">8DJ >2Охороничок Фейс* Татуер* Чай* Бармер* >3Сапорт*", "Усі витрати на організаторі, якщо івент зібрав менше 50% від бюджету, карта скидається", "?", "Вхід Бар* Онлайн-каса*", "Розробка вечірки в жанрі Electro з потужним звуком та 12-ти годинним лайнапом у просторому приміщенні на вільних умовах", "", true, true, "prj"));
    DoorArr.push(new DNEDoorCard("prj-mriya", "МРІЯ", "Розробка 6-ти годинного івенту, що складатиме лайв виступи підбірки артистів. Чим більше організаційних питань вирішено без допомоги клубу, тим більше заробіток від продажу. У разі успішного виконання, картку замовлення можна залишити собі і використати знову.", "https://lh4.googleusercontent.com/TmXLWrqcgvg_YxmSARONzYNXFjJJWLB2fb5fI1ZeAyfO75uBnkaQkQFn4x3POUs7W5o=w2400", 8, "15К", "Otel`", "DJ Охороничок Фейс* Бармен*", "Усі витрати на організаторі, якщо івент зібрав менше 50% від бюджету, карта скидається", "30K/50K/80K", "Вхід, Бар, Онлайн-каса", "Розробка 6-ти годинного івенту.", "", true, true, "prj"));

    // Drainvoid
    // Замовлення, 9lvl
    DoorArr.push(new DNEDoorCard("prj-drainvoid-cassets", "Drainvoid Cassets", "Розробка видання альбому на касетах, що складатиме компіляція треків артиста, оригінальний артворк альбому та лімітоване видання на касетах. <br>Чим більше складових проекту розроблено без допомоги лейблу, тим більше заробіток від продажу. Картка може бути використана повторно, кожного разу потребуючи новий бюджет та даючи новий прибуток. В результаті гравець що виконав проект отримує 100 одиниць кассет на руки, що можна продавати в мережі по 420. До кожного наступного єтапу розробки альбому зацікавленність аудиторії на вдвічі більша.", "https://lh3.googleusercontent.com/fPx2-vLS29NA__mguV-mFPstHZuz4TzO-Htx5U2o0RAIiuB4_NHJgk6AOKcvPT7JmIo=w2400", 9, "14К", "BODY Music", "DJ, Відеомейкер*", "BODY Music має затвердити роботу інакше витрачені час та енергія не будуть сплачені грошима", "420/item", "Продукт", "Розробка видання альбому на касетах в 100 одиниць", "", true, true, "prj"));

    // Замовлення, 13lvl
    DoorArr.push(new DNEDoorCard("prj-weedian-greece", "Trip to Greece", "Замовлення на розробку діджитал-альбому культового артиста жанру Stoner Rock спеціально для B.R., що складатиме мастеринг його матеріалу з туру до Греції, фінальний запис у студії на живих інструментах та оригінальний артворк для обкладинки. <br>Чим більше складових проекту розроблено без допомоги лейблу, тим більше заробіток від продажу. Картка може бути використана повторно, кожного разу потребуючи новий бюджет та даючи новий прибуток.", "https://lh3.googleusercontent.com/Z1-pnBGEl5eqzNZcowO-6Ar0YSuA_7iujHC4t6Zs-j3wd_BM5rUajXT4gpg9hzK7rI8=w2400", 6, "5К", "B.R.", "DJ, Відеомейкер*", "B.R. має затвердити роботу інакше витрачені час та енергія не будуть сплачені грошима", "4K/10K/30K", "Платіж"));
    // Various
    // Замовлення, 19lvl
    DoorArr.push(new DNEDoorCard("prj-various", "Various", "Розробка видання альбому на касетах, що складатиме компіляція треків артиста, оригінальний артворк альбому та лімітоване видання на касетах. <br>Чим більше складових проекту розроблено без допомоги лейблу, тим більше заробіток від продажу. Картка може бути використана повторно, кожного разу потребуючи новий бюджет та даючи новий прибуток. Вартість кожного єтапу розробки - 1К, 6К та 14К. До кожного наступного єтапу розробки альбому зацікавленність аудиторії на вдвічі більша.", "https://lh4.googleusercontent.com/ZWRLV4_k8uGvUejY7GxJGKItp5wLJ563TzF3MmQPxDFz2qE1r1crTx4e55uMgyFgggI=w2400", 19, "21К", "BODY Music", "DJ, Відеомейкер*", "BODY Music має затвердити роботу інакше витрачені час та енергія не будуть сплачені грошима", "2К/10К/42K", "Платіж"));

    DoorArr.push(new DNEDoorCard("prj-vinyl-reinvent", "REINVENT", "Розробка лімітованого видання альбому на вінілі в дві хвилі продажів. Дає єдиночасну виплату після кожної хвилі продажів, унікальну картку платівки та право на роялті.<br> Підвищує множитель по жанру для цього альбому до 100%", "https://lh6.googleusercontent.com/KsopzyO244fv6F6DYLNhHQeLVSPh7uu_Odpu2eFOhElDjB4M96UflzZl28elG4YmL0o=w2400", 11, "16K", "BODY Music", "DJ, Продавець, Відеомейкер*", "BODY Music має затвердити роботу інакше витрачені час та енергія не будуть сплачені грошима", "30К/70K<sup>+1K</sup>", "Платіж та роялті", "Розробка видання альбому на вінілі.", "", true, true, "prj"));

    DoorArr.push(new DNEDoorCard("prj-vinyl-vlad-tapes", "VLAD TAPES", "Розробка лімітованого видання альбому на вінілі в три хвилі продажів. Дає єдиночасну виплату після кожної хвилі продажів, унікальну картку платівки та право на роялті.<br> Підвищує множитель по жанру для цього альбому до 100%", "https://lh5.googleusercontent.com/TK4C77xn6pXtigKWguyAkXr7Bv870d8RnVPu4S0ES97c1bvxT_lirN5SWO3v7UxNzOc=w2400", 12, "20K", "BODY Music", "DJ, Продавець, Відеомейкер*", "BODY Music має затвердити роботу інакше витрачені час та енергія не будуть сплачені грошима", "30К/50К/70K<sup>+1K</sup>", "Платіж та роялті", "Розробка видання альбому на вінілі.", "", true, true, "prj"));

    DoorArr.push(new DNEDoorCard("prj-vinyl-drainvoid", "DRAINVOID VINYL", "Розробка лімітованого видання альбому на вінілі для артиста лейблу BODY Music, включає запис, оригінальний артворк та видання на вінілі. В результаті завершення всіх етапів розробки гравець отримує партію з 150 екземплярів, яку можливо реалізувати в інтернеті від 1К за шт.<br> Успішне завершення цього проекту підвищує твій бонус за метч усіх альбомів, що мають з ним спільний жанр до 100%.", "https://lh4.googleusercontent.com/0B-PJPjjTpWWTZen5nItT7jAFT1yqtAemp_qSc8-lyaK8X9xbBClBhbp2xiLsZNm_qI=w2400", 13, "44K", "BODY Music", "DJ, Продавець, Відеомейкер*", "BODY Music має затвердити роботу інакше витрачені час та енергія не будуть сплачені грошима", "1К/item", "Продукт", "Розробка видання альбому на вінілі, партією в 150 одиниць", "", true, true, "prj"));

    DoorArr.push(new DNEDoorCard("prj-mexanika", "МЕХАНІКА", "Розробка 8-ми годинного івенту, що складатиме лайв виступи підбірки артистів в жанрі важкої Electroніки. Чим більше організаційних питань вирішено без допомоги клубу, тим більше заробіток від продажу. У разі успішного виконання, картку замовлення можна залишити собі і використати знову, організувавши нову ітерацію цьогож івенту. Вартість організації кожної наступної ітерації подвоюється.", "https://lh4.googleusercontent.com/dZncA2slFBuTZ1f3YwjQmwEqRM52N7WUtmBTKi3je_F0web2tdrKULaY_itdCgb618U=w2400", 16, "25К", "Keller", "DJ Охороничок Фейс Бармен*", "Усі витрати на організаторі, якщо івент зібрав менше 50% від бюджету, карта скидається", "60K/110K/190K", "Вхід, Бар, Онлайн-каса", "Розробка 8-ми годинного івенту.", "", true, true, "prj"));


    // Aenigma
    // Замовлення, 16lvl
    DoorArr.push(new DNEDoorCard("prj-aenigma", "Aenigma", "Замовлення на розробку восьмигодинного лайв-виступу в клубі Keller на Кирилівський, для артистів в жанрі гіпнотичного техно.<br> Замовлення солідне, складатиме організацію повноцінного лайву з профессійною аппаратурою та світлом для 300+ людей та входом від 250, оригінальний артворк події а також флаєр, сайт з квитками, промо-відео, демо-профайли артистів, запрошення та просування опціонально. <br>Чим більше складових проекту розроблено без допомоги клубу, тим більше заробіток від продажу. Гарантовано дає демо артистів та прибуток від входу, розмір якого залежить від уваги до проекту. У разі успішного виконання, дає високий прибуток з різноманітного спектру джерел. Можливість записати лайв та демо для кожного з артистів та з верогідністю 25% отримати замовлення на запис у студії від кожного з них. Картка може бути використана повторно, кожного разу потребуючи новий бюджет та даючи новий прибуток. Вартість розробки кожного этапу - 15К, 25К, 40К", "https://lh6.googleusercontent.com/ddLQawIUrWh7MxMGoj1D-m0Ed1ojjTbuGh6nCMs8q4nFu16qavKkcOyFc5BGugtCTE8=w2400", 28, "80K", "Keller", "DJ, Охороничок, Фейс*, Бармен*, Сапортики*, Татуер*, Райтер*, Відеомейкер*", "Усі витрати на організаторі, якщо івент зібрав менше 50% від бюджету, карта скидається", "20К/50К/120K", "Бар, Вхід, Онлайн-каса, Мерч, Кухня"));

    // Замовлення, 19lvl
    DoorArr.push(new DNEDoorCard("prj-vinyl-love-market", "LOVE MARKET", "Розробка лімітованого видання альбому на вінілі. Дає єдиночасну виплату одразу після затвердження лейблом, унікальну картку платівки та право на роялті.<br> Підвищує множитель по жанру для цього альбому до 100%", "https://lh3.googleusercontent.com/IXOuUL6ZhG1a2RRJIP9h-6AejjfwVBIJAHOm6X0VJAwUUxnJGRbps-YX4WDCOFbKWTY=w2400", 29, "50К", "BODY Music", "DJ, Продавець, Відеомейкер*", "BODY Music має затвердити роботу інакше витрачені час та енергія не будуть сплачені грошима", "90К/100К/180K<sup>+1K</sup>", "Платіж та роялті"));
    // Замовлення, 19lvl
    DoorArr.push(new DNEDoorCard("prj-vinyl-various-i", "VARIOUS I", "Розробка лімітованого видання альбому на вінілі в два этапи та три хвилі продажів. Дає єдиночасну виплату після кожної хвилі продажів, унікальну картку платівки та право на роялті.<br> Підвищує множитель по жанру для цього альбому до 100%. Вартість кожного этапу розробки 20К та 40К", "https://lh5.googleusercontent.com/5hLta786kJhFTBQJjkPqKc2CTbh2GiQuntiAnGmcLFBWK0XFYLa8sku3YMAvowk02L4=w2400", 22, "60K", "BODY Music", "DJ, Продавець, Відеомейкер*", "BODY Music має затвердити роботу інакше витрачені час та енергія не будуть сплачені грошима", "50К/70К/100K<sup>+1K</sup>", "Платіж та роялті"));
    DoorArr.push(new DNEDoorCard("prj-vinyl-nocturnal", "NOCTURNAL", "Розробка лімітованого видання альбому на вінілі в дві хвилі продажів. Дає єдиночасну виплату після кожної хвилі продажів, унікальну картку платівки та право на роялті.<br> Підвищує множитель по жанру для цього альбому до 100%.", "https://lh3.googleusercontent.com/H4C_Qg_PGYfxghE7AcKFZcj3UOBOkMwJOCrrkVskIQFLJ2gFrJec_yacUOcGmfMGY1o=w2400", 18, "28K", "BODY Music", "DJ, Продавець, Відеомейкер*", "BODY Music має затвердити роботу інакше витрачені час та енергія не будуть сплачені грошима", "50К/70К<sup>+1K</sup>", "Платіж та роялті", "Розробка видання альбому на вінілі", "", true, true, "prj"));

    // DoorsArr.push(new ContractCard('Гикающий гик', '+6 против воинов', 6, 'Стань нормальным, сбрось все ссвои расы и классы', '2 сокровища'));
    // DoorsArr.push(new ContractCard('Сочащаяся слизь', 'Какая мерзость! +4 против эльфов', 1, 'Потеряй надетую обувку. Если нет обувки, потеряй уровень.', '1 сокровище'));
    // DoorsArr.push(new ContractCard('Улетные улитки', 'У тебя на смывку -2', 4, 'Разворовывают твои сокровища. Сбрось столько шмоток из игры или карт с руки(по своему выбору), сколько выпадет на кубике.', '2 сокровища'));
    // DoorsArr.push(new ContractCard('Бигфут', '+3 против дварфов', 12, 'Наступает на тебя и съедает шляпу. Потеряй надетый головняк.', '3 сокровища'));
    // DoorsArr.push(new ContractCard('Гарпистки', 'Сопротивляются магии. +5 против волшебников.', 4, 'Хреново исполняют ужасную музыку. Потеряй 2 уровня.', '2 сокровища'));
    // DoorsArr.push(new ContractCard('Лепрекон', 'Да он отвратителен! +5 против эльфов.', 4, 'Забирает у тебя две шмотки - первую выбирает правый сосед, вторую левый. Сбрось эти шмотки.', '2 сокровища'));
    // DoorsArr.push(new ContractCard('Обдолбанный голем', 'Можешь биться или пройти мимо, плюнув на обдолбанного голема и его сокровища. Исключение: вкусно выглядящим хафлингам придётся биться.', 14, 'Его пробивает на хавку. Ты съеден и мёртв.', '4 сокровища'));
    // DoorsArr.push(new ContractCard('Амазонка', 'Не бьётся с женщинами; вместо боя дает одно сокровище.', 8, 'Тебя вздула женщина! Ущемление гордости в тяжелой форме. Потеряй все свои классы. Если у тебя нет класса, потеряй 3 уровня.', '2 сокровища'));

    // console.log(DoorArr);
    return DoorArr;
}

const DNEDoorArr = initDNEDoorArr().filter(card => card.isBuild);

//=> DOORS END

const DNECards = new Set(DNELootArr.concat(DNEDoorArr));

const initMonsterArr = () => {
    const MonstersArr = [];

    MonstersArr.push(new DNEMonsterCard("under-the-bed", "Монстр з під ліжка", 5, "img/monsters/monster-under-the-bed.png", "-4 якщо маєш Найомничків<br>Візьми душу зверху, якщо впораєшся однією картою", 1, 1, 2, "Що це за звуки з-під ліжка? Де мої Найомнички? Ти їх втрачаєш, як і всі свої душі"));
    MonstersArr.push(new DNEMonsterCard("mr-bones", "Містер Бонес", 6, "img/monsters/monster-mr-bones.png", "Маєш менше 6-ти душ?<br>Отримай карту звуку", 0, 1, 2, "Втрать дві душі. Успішна змивка?<br>Добре, втрать одну душу"));
    MonstersArr.push(new DNEMonsterCard("pinball-lizard", "Пінбольний ящер", 7, "img/monsters/monster-pinball-lizard.png", "Він дійсно круто грає в пінбол.<br>Отримай рису характеру за успіх", 0, 1, 2, "Дзинь! Втрать дві душі і карту з найбільшим бонусом."));
    MonstersArr.push(new DNEMonsterCard("roc-star", "Вьюрок-звезда", 8, "img/monsters/monster-roc-star.png", "Усі карти звуку у жанрі Rock отримують 100% бонус", 0, 1, 2, "Ти неуважно читав його райдер! Cкинь всю руку та душу"));
    MonstersArr.push(new DNEMonsterCard("chocolate-bunny", "Шоколадний заєць", 9, "img/monsters/monster-chocolate-bunny.png", "+3 для самотніх жінок.<br>Зустрінь Найомничка при успіху", 12, 1, 2, "Цукрова кома. До кінця свого наступного ходу не можеш звертатись до Найомничків"));
    // MonstersArr.push(new DNEMonsterCard("the-brothers-grimm", "Брати Грімм", 9, "img/monsters/monster-the-brothers-grimm.png", "Кожен суперник, може скинути карту, щоб підвищити їх рівень на 9. Цей звук також твій, якщо досягнеш успіху", 0, 1, 2, "Втрать дві душі та ще под одній за кожну раніше скинуту суперниками карту"));
    MonstersArr.push(new DNEMonsterCard("misplacer-beast", "Розгубняшка", 10, "img/monsters/monster-misplacer-beast.png", "Увесь свій звук розгубила... кожен суперник, може скинути карту, щоб підвищити її рівень на 10. Цей звук також твій, якщо досягнеш успіху", 20, 1, 2, "Втрать дві душі та ще под одній за кожну раніше скинуту суперниками карту"));
    MonstersArr.push(new DNEMonsterCard("telemarketer", "Телефонний скамер", 11, "img/monsters/monster-telemarketer.png", "Найомнички не допоможуть на цьому рейві", 0, 1, 2, "Кожен суперник, починаючи з лівого, тягне по карті з твоєї руки. Скинь карти що залишаться."));
    MonstersArr.push(new DNEMonsterCard("munchsphinx", "Манчсфінкс", 12, "img/monsters/monster-sphinx.png", "Баги-ескейпи не спрацюють", 0, 1, 2, "Присідає відпочити на твою руку. Тим часом твої сусіди ліворуч та праворуч тягнуть в тебе з руки наосліп по дві карти та залишають собі"));
    MonstersArr.push(new DNEMonsterCard("minor-god", "Дрібний бог", 13, "img/monsters/monster-minor-god.png", "На щось він все-таки здатний. Бонус найсильнішої карти в твоєму лайнапі дорівнює нулю", 0, 1, 3, "Віддай найсильнішу карту зі свого лайнапу гравцю з найменьшою кількістю душ."));
    MonstersArr.push(new DNEMonsterCard("gms-ex-girlfriend", "Колишня подруга майстра", 14, "img/monsters/monster-gms-ex-girlfriend.png", "Тепер вона найстрашніший монстр у його грі... на Рейві з нею маєш впоратись самостійно<br>+4 для самотніх чоловіків", 18, 1, 3, "Жінка втрачає одну душу. Чоловік скидує всю руку, Найомничка та дві душі"));
    MonstersArr.push(new DNEMonsterCard("right-angel", "Прямий янгол", 15, "img/monsters/monster-right-angel.png", "Своєю прямотою ставить тебе в глухий кут.<br>+6 за кожного Найомничка", 21, 1, 3, "Віддай по Найомничку тим хто викине найбільше та найменше число на d6. Якщо не маєш жодного, візьми дві карти звуку"));
    MonstersArr.push(new DNEMonsterCard("floating-nose", "Блукаючий ніс", 16, "img/monsters/monster-floating-nose.png", "Шкода свого носа? Скинь дві карти звуку і він піде.", 0, 1, 3, "Він ще той нюхач. Змитись не вийде. Втрать 3 душі"));
    MonstersArr.push(new DNEMonsterCard("gothyanki", "Готіянкі", 17, "img/monsters/monster-gothyanki.png", "Найомнички та інші гравці не допоможуть, вправний<br>рейвер здатний влаштувати<br>Рейв для Готіянкі власноруч", 0, 1, 3, "Наповнює тебе відчуттям провини. Всі гравці в яких менше душ ніж в тебе отримують по одній. Втрать стільки душ, скільки ці невдахи скопом отримали за твій рахунок."));
    MonstersArr.push(new DNEMonsterCard("net-troll", "Інтернет троль", 18, "img/monsters/monster-net-troll.png", "Нічіго не вміє, тому і біситься.<br>Баги його не беруть, не використовуй їх в цьому рейві", 0, 1, 3, "Йому чхати на баланс. Дозволь гравцям з найбільшою кількістю душ взяти в тебе по карті на їх вибір"));
    MonstersArr.push(new DNEMonsterCard("lawyers", "Адвокат", 19, "img/monsters/monster-lawyers.png", "-9 для жінок", 10, 1, 3, "Кожен суперник отримує душу, а ти втрачаєш їх відповідну кількість і ще одну, адвокату теж треба за щось жити."))
    MonstersArr.push(new DNEMonsterCard("meanderthal", "Поневірянець", 20, "img/monsters/monster-meanderthal.png", "Поневірянця можна запросити на будь-який Рейв, не скидуючи карту.", 0, 1, 3, "Напад щедрості! Віддай половину своїх душ гравцю в якого їх найменше. Їх двоє? Хай забирає другу половину, ти ще заробиш, можливо."));
    MonstersArr.push(new DNEMonsterCard("cat-girl", "Кицьо-дівчина", 21, "img/monsters/monster-cat-girl.png", "+5 за кожного Найомничка.<br>Поклич друга, щоб скинути рівень її очікувань до 1", 26, 1, 3, "Вона забрала в тебе друга та самоповагу! Скинь Найомничка та усі риси характеру"));
    MonstersArr.push(new DNEMonsterCard("frog-prince", "Принц Пепе", 22, "img/monsters/monster-frog-prince.png", "Манери в нього так собі,<br> але яка ж все таки економія на мухоловках!<br>Зустрівши Язичницького демона обидва зникають, залишивши тобі свої карти звуку.", 0, 1, 4, "Скинь карту з бонусом 7 або більше, якщо не маєш такої, розмір твоєї руки стає на карту менше, тримай Принца поруч на згадку про це. Бажальне кільце тобі в поміч... або демон"));
    MonstersArr.push(new DNEMonsterCard("a-cute-angel", "Косий янгол", 23, "img/monsters/monster-a-cute-angel.png", "Його найгірша риса - ніколи не знаєш куди він мітить.<br>+6 для сформованих архетипів,<br>-9 якщо маєш Найомничків", 29, 1, 4, "Втрать три душі, якщо маєш Найомничків. Ще дві, якщо маєш несформований архетип. Ще одну за кожну карту звуку у руці"));
    MonstersArr.push(new DNEMonsterCard("lounge-lizards", "Тусящери", 24, "img/monsters/monster-lounge-lizards.png", "+8 для несформованих архетипів, при зустрічі з Морті дають йому два звуки, старий борг", 32, 1, 4, "Їм завжди треба більше. Кинь d6, викинуте число душ роздай іншим гравцям по колу, якщо випаде 6 - отримай душу"));
    MonstersArr.push(new DNEMonsterCard("ghoulfiends", "Ма<br>демонуазелі", 25, "img/monsters/monster-ghoulfiends.png", "Дають Джері баг-баф при зустрічі та баг-виклик за успіх", 0, 1, 4, "Втрать стільки душ, щоб залилось як у гравця з найменьшою кількістю душ у грі"));
    MonstersArr.push(new DNEMonsterCard("snerks", "Шмурфи", 26, "img/monsters/monster-snerks.png", "Істоти із пекла!<br>+10 в присутності Бульрога, мають тримати імідж", 36, 1, 4, "Скинь дві душі і ще по одній за кожного монстра на рейві, вони точно їм передадуть"));
    MonstersArr.push(new DNEMonsterCard("tongue-demon", "Язичницький демон", 27, "img/monsters/monster-tongue-demon.png", "Пекельне створіння. Скинь карту звуку при зустрічі, якщо ти не Бет, вона отримує баг-ескейп", 0, 1, 4, "Втрать чотири душі. За бажанням кинь d6, випаде 6 - нічого не втрачаєш, інше - втрачай шість душ"));
    MonstersArr.push(new DNEMonsterCard("dragula", "Драгула", 28, "img/monsters/monster-dragula.png", "Від нього неможливо втекти жодним чином, лише Анігіляція здатна його зупинити", 0, 1, 4, "Тебе обнулено: скинь руку, найомничків та усі риси характеру. До наступного ходу ти нічого не робиш"));
    MonstersArr.push(new DNEMonsterCard("failcor", "Фейлкор, Дракон Нещастя", 29, "img/monsters/monster-failcor.png", "Зустрівшись з ним одразу потрапляєш під дію верхньої карти з колоди проблем", 0, 1, 4, "До кінця свого наступного ходу всі проблеми зіграні гравцями зачіпатимуть і тебе"));
    MonstersArr.push(new DNEMonsterCard("kali", "Калі", 30, "img/monsters/monster-kali.png", "+10 для чоловіків", 40, 1, 4, "Тебе жорстоко обнулено: скинь руку, найомничків та усі риси характеру.<br>І наступний хід пропускаєш"));
    MonstersArr.push(new DNEMonsterCard("obsture-angel", "Тупий янгол", 31, "img/monsters/monster-obsture-angel.png", "Здібності архетипів не працюють", 0, 2, 5, "Не такий вже він і тупий. Тебе обнулено: скинь руку, найомничків та усі риси характеру. До наступного ходу ти нічого не робиш"));
    MonstersArr.push(new DNEMonsterCard("oxymoron", "Абихто", 32, "img/monsters/monster-oxymoron.png", "Баги на нього не діють, просто досі не розуміє як ті працюють", 0, 2, 5, "Він не відчепиться. До кінця наступного ходу дія руху не доступна, а влаштуєш рейв знову і він одразу там буде"));
    MonstersArr.push(new DNEMonsterCard("druid", "Друїд", 33, "img/monsters/monster-druid.png", "Друїдський фреш впливає на всіх дуже не передбачувано, до кінця наступного ходу зіграний<br>будь-ким баг замінюється випадковим(визначайте кидком d6)", 0, 2, 5, "Скинь всі свої баги та рису характеру на твій вибір"));
    MonstersArr.push(new DNEMonsterCard("unspeakably-awful-indescribable-horror", "Невимовно жахливий незбагненний жах", 34, "img/monsters/monster-unspeakably-awful-indescribable-horror.png", "Гравці менше ніж з 4-ма душами його не бачать<br>+7 для несформованих архетипів", 41, 2, 5, "Невимовно жахливим чином висмоктує 7 душ у всіх крім Джері. Джері втрачає пам'ять - скинь риси характеру Джері"));
    MonstersArr.push(new DNEMonsterCard("wight-brothers", "Бліді брати", 35, "img/monsters/monster-wight-brothers.png", "Ігнорують рейви гравців, які хоча б сумарно не мають 4 душі, занадто дрібно", 0, 2, 5, "Втрать усі душі"));
    MonstersArr.push(new DNEMonsterCard("the-hand-of-fate", "Рука долі", 36, "img/monsters/monster-the-hand-of-fate.png", "Якщо досягнеш успіху з Рукою долі, вона стане твоїм Найомничком та не покине тебе<br>за жодних умов", 0, 2, 5, "Гравці ліворуч та праворуч забирають в тебе по Найомничку. Ти сумуєш та втрачаєш дві душі за кожного."));
    MonstersArr.push(new DNEMonsterCard("stoned-golem", "Обдовбаний голем", 37, "img/monsters/monster-stoned-golem.png", "Завжди можеш просто піти і забити на його звук", 0, 2, 5, "Він впав тобі на вухо, скинь чотири душі та всі карти звуку, вони тобі не знадобляться, до кінця наступного ходу влаштувати Рейв не вийде, хіба що знайдеш бажальне кільце. Тримай його поруч, щоб не забути"));
    MonstersArr.push(new DNEMonsterCard("bullrog", "Бульрог", 38, "img/monsters/monster-bullrog.png", "Залишиться на рейві гравця<br>з 4-ма душами чи менше,<br>тільки якщо добре попросити", 0, 2, 5, "Твої Найомнички рятуються бігством, інші відмовляються з ним працювати. Приходитиме на кожен твій рейв, доки не досягнеш із ним успіху.. або використаєш бажальне кільце"));
    MonstersArr.push(new DNEMonsterCard("midgard-serpent", "Мідгардський змій", 39, "img/monsters/monster-midgard-serpent.png", "З ним приходить Фімбулвінтер - Довга Зима.<br>+6 для несформованих архетипів", 0, 2, 5, "Кінець світу... принаймні вашого. З цього моменту кожен гравець в кінці свого ходу кидає d6 та скидає стільки карт звуку, скільки випаде або Найомничка. Продовжуйте доки хтось не викине 6 і зима нарешті закінчиться"));
    MonstersArr.push(new DNEMonsterCard("smog", "Смог", 40, "img/monsters/monster-smog.png", "Не переслідує гравців менше ніж з 5-ма душами, натомість дає їм пораду, отримай рису характеру", 0, 2, 5, "Скинь стільки душ, скільки карт було в твоєму лайнапі. В свій наступний хід ти зустрінеш Найомничка.<br>Краще пізніше ніж ніколи"));
    // MonstersArr.push(new DNEMonsterCard("blobgoblin", "Жлобгоблін", 10, "img/monsters/monster-blobgoblin.png", "Баги-ескейпи не спрацюють", 1, 2, "Присідає відпочити на твою руку. Тим часом твої сусіди ліворуч та праворуч тягнуть в тебе з руки наосліп по дві карти та залишають собі"));
    // MonstersArr.push(new DNEMonsterCard("monster", "Монстр", 1, "Монстр почувається нормально. Так він каже. Насправді монстр зробив одне невдале татуювання. Все б нічого, скажеш ти, у кого вони всі вдалі? - І будеш правий. Ось тільки є один нюанс, це здоровенний блекворк на обличчі. Тепер ця чунга чанга збирається в останню путь завтра ввечері. Зроби щось, якщо тобі не начхати"))
    // //delete MonstersArr.push(new DNEMonsterCard("leperchaun", "Лепрікон", 4, "img/monsters/monster-leperchaun.png", "Його фізіологія незбагненна!<br>+5 для Прибульців", 1, 2, "Забирає в тебе дві картки з руки. Одну обирає лівий сусід, іншу - правий. Скинь їх."));
    // //delete MonstersArr.push(new DNEMonsterCard("undead-clowns", "Клоундеди", 16, "img/monsters/monster-undead-clowns.png", "-2 для Нетраннерів та DJ-їв", 2, 4, "Скинь одну карту з інвентарю. Якщо в інвентарі немає карток, тебе обнулено."));
    // //delete MonstersArr.push(new DNEMonsterCard("ghost-in-the-shell", "Привид у панцері", 5, "img/monsters/monster-ghost-in-the-shell.png", "+2 для Нетраннерів та Енграм", 1, 2, "Від переляку впускаєш карти. Скинь одну карту з руки"));
    // //delete MonstersArr.push(new DNEMonsterCard("mud-wrestler", "Багноборка", 3, "img/monsters/monster-mud-wrestler.png", "+2 для жінок. +4 для Татуєрів(вона ж уся в багні!)", 1, 1, "Яка чудова багнюка! Зовсім не відстає. Скинь карту з руки"));
    // //delete MonstersArr.push(new DNEMonsterCard("harpies", "Гарпістки", 4, "img/monsters/monster-harpies.png", "Не піддаються зламу.<br>+5 для Нетраннерів", 1, 2, "Погано виконують жахливу музику. Втрать дві душі"));
    // //delete MonstersArr.push(new DNEMonsterCard("the-three-munchketeers", "Три манчкітери", 13, "img/monsters/monster-the-three-munchketeers.png", "Всі за одного та один за всіх!<br>+2 для Нетраннерів та DJ-їв.<br>-2 для Найомничків", 1, 3, "Скинь три карти з руки, загальним бонусом не менше 9(якщо в тебе є стільки)"));
    // //delete MonstersArr.push(new DNEMonsterCard("lord-tennis-anyone", "Лорд Втенісон", 12, "img/monsters/monster-lord-tennis-anyone.png", "-2 для Райтерів, +4 для Найомничків", 1, 3, "Втрать одну душу"));
    // //delete MonstersArr.push(new DNEMonsterCard("salamander", "Саламандра", 4, "img/monsters/monster-salamander.png", "+4 для Дракононароджених - навіть їх вона насторожує", 1, 2, "Вона палає! Втрать одну душу"));
    // //delete MonstersArr.push(new DNEMonsterCard("cyclops", "Циклоп", 19, "img/monsters/monster-cyclops.png", "Відпускає гравців з 5-ма душами чи менше. -2 для Енграм", 2, 5, "Тебе обнулено"));
    // //delete MonstersArr.push(new DNEMonsterCard("pit-bull", "Пітбуль", 2, "img/monsters/monster-pit-bull.png", "Не можеш перемогти? Скинь одну карту і скажи \"Апорт!\", щоб автоматично змитись", 1, 1, "Втрать дві душі"));
    // //delete MonstersArr.push(new DNEMonsterCard("pukachu", "Ригачу", 6, "img/monsters/monster-pukachu.png", "Отримай додаткову душу, досягнувши успіху використавши лише дві карти і без допомоги", 1, 2, "Скинь всю руку"));
    // //delete MonstersArr.push(new DNEMonsterCard("elmer", "Елмер", 18, "img/monsters/monster-elmer.png", "Чого це він на твої черевики витріщився? +3 для DJ-їв, +2 для Нетраннерів", 2, 4, "Він тобі ласти склеїв. Тебе обнулено"));
    // //delete MonstersArr.push(new DNEMonsterCard("centaurpede", "Сороконячка", 2, "img/monsters/monster-centaurpede.png", "Завжди з собою купа підков - більшої вдачі годі шукати! +3 для Дракононароджених, +2 для DJ-їв", 1, 1, "Скинь одну карту з руки"));
    // //delete MonstersArr.push(new DNEMonsterCard("the-wraith-of-khan", "Привид Хана", 10, "img/monsters/monster-the-wraith-of-khan.png", "+3 для Райтерів.<br>+2 для Найомничків", 1, 3, "Віддай по одній карті усім, крім гравців з найбільшим та найменшим рівнем"));

    return MonstersArr;
}

const DNEMonsterArr = initMonsterArr();

const initBUGArr = () => {
    const BUGArr = [];
    const WANDERING_MONSTER_LONGLINE = `Грай у будь-який Рейв<br>(можна й у свій).<br>Обери верхнього монстра рівнем не більше за очікування і закинь його в цей Рейв.`;
    BUGArr.push(new DNEBUGCard("bug-wandering-monster", "Сором'язлива тварина", "/img/bug/bug-wandering-monster.png", WANDERING_MONSTER_LONGLINE, "", 0, 0, true));
    const WANDERING_MONSTER_LONGLINE_2 = `Грай у будь-який Рейв,<br>скинувши карту звуку.<br>Обери одного з верхніх монстрів і закинь його в цей Рейв.`;
    BUGArr.push(new DNEBUGCard("bug-wandering-monster-2", "Очікувана тварина", "/img/bug/bug-wandering-monster-2.png", WANDERING_MONSTER_LONGLINE_2, "", 0, 0, true));
    const WANDERING_MONSTER_LONGLINE_3 = `Підкинь пасажира в цей Рейв, кинь d4 та поклич монстра відповідного рівня складності:<br>1 - легкий,<br>2 - середній,<br>3 - сильний або<br>4 - особливий.`;
    BUGArr.push(new DNEBUGCard("bug-wandering-monster-3", "Випадкова тварина", "/img/bug/bug-wandering-monster-3.png", WANDERING_MONSTER_LONGLINE_3, "", 0, 0, true));
    const WANDERING_MONSTER_LONGLINE_4 = `Грай у будь-який Рейв.<br>Обери верхнього монстра з більшим рівнем, ніж в будь-якого з монстрів, що вже запрошені, і закинь його в цей Рейв.`;
    BUGArr.push(new DNEBUGCard("bug-wandering-monster-4", "Нарцистична тварина", "/img/bug/bug-wandering-monster-8.png", WANDERING_MONSTER_LONGLINE_4, "", 0, 0, true));
    const WANDERING_MONSTER_LONGLINE_5 = `Грай у будь-який Рейв,<br>скинувши душу.<br>Прочухай усіх монстрів, обери будь-якого і закинь його в цей Рейв.`;
    BUGArr.push(new DNEBUGCard("bug-wandering-monster-5", "Вийняткова тварина", "/img/bug/bug-wandering-monster-5.png", WANDERING_MONSTER_LONGLINE_5, "", 0, 0, true));
    const WANDERING_MONSTER_LONGLINE_6 = `Грай у будь-який Рейв,<br>скинувши душу.<br>Візьми верхнього монстра з колоди кожної складності та закинь їх в цей Рейв.`;
    BUGArr.push(new DNEBUGCard("bug-wandering-monster-6", "Співзалежні тварини", "/img/bug/bug-wandering-monster-9.png", WANDERING_MONSTER_LONGLINE_6, "", 0, 0, true));
    const WANDERING_MONSTER_LONGLINE_7 = `Грай у будь-який Рейв,<br>скинувши душу.<br>Прочухай колоду найвищої складності, обери двох монстрів та закинь їх в цей Рейв.`;
    BUGArr.push(new DNEBUGCard("bug-wandering-monster-7", "Нерозлучні тварини", "/img/bug/bug-wandering-monster-7.png", WANDERING_MONSTER_LONGLINE_7, "", 0, 0, true));
    const DOGPILE_LONGLINE = `Грай у будь-який Рейв(можна у свій). Потім решта гравців може скинути по одній карті Звуку, щоб запросити<br>на Рейв<br>по монстру<br>за кожну.<br>Склади їх рівні<br>з очікуваннями.<br>При невдачі<br>гравець<br>робить<br>окремі<br>кидки<br>змивки<br>для кожного.`;
    BUGArr.push(new DNEBUGCard("bug-dogpile", "Купа мала", "/img/bug/bug-dogpile.png", DOGPILE_LONGLINE, "", 0, 0, true));
    const MONSTER_MASH_LONGLINE = `Грай у будь-який Рейв разом з будь-якою кількістю карт з руки. Запроси на Рейв по монстру за кожну. Склади їх рівні з очікуваннями. При невдачі гравець робить окремі кидки змивки для кожного.`;
    BUGArr.push(new DNEBUGCard("bug-monster-mash", "Тому що ми банда!", "/img/bug/bug-monster-mash.png", MONSTER_MASH_LONGLINE, "", 0, 0, true));
    const LUCKY_TALISMAN_LONGLINE = `Можеш застосувати талісман, щоб перевести дію будь-якої карти гравця на будь-кого іншого на твій вибір. А той вже хай викручується як може. Разова карта.`;
    BUGArr.push(new DNEBUGCard("bug-lucky-talisman", "Талісман вдачі", "/img/bug/bug-lucky-talisman.png", LUCKY_TALISMAN_LONGLINE, "", 0, 0, true)); // 300
    BUGArr.push(new DNEBUGCard("bug-lucky-talisman-2", "Талісман вдачі", "/img/bug/bug-lucky-talisman-2.png", LUCKY_TALISMAN_LONGLINE, "", 0, 0, true)); // 300
    BUGArr.push(new DNEBUGCard("bug-lucky-talisman-3", "Талісман вдачі", "/img/bug/bug-lucky-talisman-3.png", LUCKY_TALISMAN_LONGLINE, "", 0, 0, true)); // 300
    const WISHING_RING_LONGLINE = `Повертає будь-яку зіграну карту відправнику. Грай будь-якої миті. Разова карта.`;
    const WISHING_RING_LONGLINE_2 = `Використай в будь-який момент, щоб змусити суперника повернути зіграну ним карту. До кінця ходу грати цю карту заборонено.`;
    BUGArr.push(new DNEBUGCard("bug-wishing-ring-4", "Бажальне кільце", "/img/bug/bug-wishing-ring.png", WISHING_RING_LONGLINE, "", 0, 0, true));
    BUGArr.push(new DNEBUGCard("bug-wishing-ring", "Бажальне кільце", "/img/bug/bug-wishing-ring-2.png", WISHING_RING_LONGLINE_2, "", 0, 0, true)); // 500
    BUGArr.push(new DNEBUGCard("bug-wishing-ring-2", "Бажальне кільце", "/img/bug/bug-wishing-ring-3.png", WISHING_RING_LONGLINE, "", 0, 0, true)); // 500
    BUGArr.push(new DNEBUGCard("bug-wishing-ring-3", "Бажальне кільце", "/img/bug/bug-wishing-ring-4.png", WISHING_RING_LONGLINE, "", 0, 0, true)); // 500
    // const TINFOIL_HAT_LONGLINE = `У цьому головному уборі ти захищений від усіх проблем, які грають суперники до кінця твого наступного ходу.`;
    const TINFOIL_HAT_LONGLINE = `Грай цю карту коли потрапиш під дію проблеми, візьми її на руку та можеш одразу зіграти, хоч на того ж гравця, який її застосував. Врешті решт від тебе можна очікувати що завгодно,<br>ти у шапці з фольги.`;
    BUGArr.push(new DNEBUGCard("bug-tinfoil-hat", "Шапочка з фольги", "/img/bug/bug-tinfoil-hat.png", TINFOIL_HAT_LONGLINE, "", 0, 0, false)); // 800
    // const SANDALS_OF_PROTECTION_LONGLINE = `Захищають тебе від нових знайомств під час Рейву. Інші гравці не зможуть Підкинути Пасажира у твій Рейв, або у Рейв, на який ти прийшов як Рятівник.`;
    // BUGArr.push(new DNEBUGCard("bug-sandals-of-protection", "Сандалі-протектори", "/img/bug/bug-sandals-of-protection.png", SANDALS_OF_PROTECTION_LONGLINE, "", 0, 0, false)); // 700
    const RELIABLE_AMULET_LONGLINE = `Коли тебе наздоганяє проблема, кинь кубик. На 1-3 проблема діє, а амулет скидається. На 4-6 проблему відбито: скинь її. А якщо випало шість, ти ще й душу отримуєш!`;
    BUGArr.push(new DNEBUGCard("bug-occasionally-reliable-amulet", "Часом надійний амулет", "/img/bug/bug-occasionally-reliable-amulet.png", RELIABLE_AMULET_LONGLINE, "", 0, 0, false)); // 600
    // const DIVINE_LONGLINE = `Ти повинен зіграти цю карту, як тільки її отримав. Всі DJ-ї одразу отримують рівень! Цей рівень може бути переможним. Якщо ти переміг у грі за рахунок цієї карти, маєш право насміхатись безжально.`;
    // BUGArr.push(new DNEBUGCard("bug-divine-interdiction", "Боже втручання", "/img/bug/bug-divine-interdiction.png", DIVINE_LONGLINE, "", 0, 0, true)); // bose, gameChanger
    // const MINE_TO_11_LONGLINE = `Будь-коли виклади цю карту посеред столу. Гра триває<br> до 11-ї душі. 10-ту та 11-ту душі можна отримати лише з Монстром на Рейві.`;
    // BUGArr.push(new DNEBUGCard("bug-mine-goes-to-11", "Підіймаю до 11", "/img/bug/bug-mine-goes-to-11.png", MINE_TO_11_LONGLINE, "", 0, 0, true)); // gut, gameChanger
    // const KNEEPADS_OF_ALLURE_LONGLINE = `Жоден гравець, в якого більше душ ніж в тебе, не може відмовити прийти тобі на поміч і не вимагає за це нагороди. Ти не можеш здобути переможний рівень за бій, у якому твій Спаситель розведений наколінниками.`;
    // BUGArr.push(new DNEBUGCard("bug-kneepads-of-allure", "Наколінники розводу", "/img/bug/bug-kneepads-of-allure.png", KNEEPADS_OF_ALLURE_LONGLINE, "Не для Татуєрів", 0, 0, false)); // gut, gameChanger, 600
    const WAND_OF_DOWSING_LONGLINE = `Прочухай будь-яку колоду, щоб знайти будь-яку потрібну карту. Забери її та скинь цю. Разова карта.`;
    BUGArr.push(new DNEBUGCard("bug-wand-of-dowsing", "Штир лозоходця", "/img/bug/bug-wand-of-dowsing.png", WAND_OF_DOWSING_LONGLINE, "", 0, 0, true)); // gut, gameChanger, 1100
    const TRANSFERRAL_POTION_LONGLINE = `Грай у будь-який Рейв. Тепер ним займається будь-який обраний тобою гравець. Він може просити допомоги, а при перемозі отримує душі та звук. Після хід повертається до попереднього гравця, щоб взяти звук з лайнапу та закінчити хід. Разова карта.`;
    BUGArr.push(new DNEBUGCard("bug-transferral-potion", "Зілля стрілочника", "/img/bug/bug-transferral-potion.png", TRANSFERRAL_POTION_LONGLINE, "", 0, 0, true)); // gut, escaper, 300
    // const BABY_OIL_LONGLINE = `Вислизни з Рейву! Це зілля дозволяє одному або двом гравцям автоматично змитись навіть від таких монстрів, від яких зазвичай змитись не можна. Разова карта.`;
    // BUGArr.push(new DNEBUGCard("bug-baby-oil", "Дитяче масло", "/img/bug/bug-baby-oil.png", BABY_OIL_LONGLINE, "", 0, 0, true)); // gut, escaper, 300
    // const INVISIBILITY_POTION_LONGLINE = `Грай, коли провалив змивку, щоб автоматично змитись від монстрів. Разова карта.`;
    // BUGArr.push(new DNEBUGCard("bug-invisibility-potion", "Зілля невидимості", "/img/bug/bug-invisibility-potion.png", INVISIBILITY_POTION_LONGLINE, "", 0, 0, true)); // gut, escaper, 300
    // const POLLYMORPH_POTION_LONGLINE = `Грай у будь-який Рейв. Один монстр перетворюється на папугу і відлітає, залишаючи свій звук. Разова шмотка.`;
    // BUGArr.push(new DNEBUGCard("bug-pollymorph-potion", "Зілля напівморфа", "/img/bug/bug-pollymorph-potion.png", POLLYMORPH_POTION_LONGLINE, "", 0, 0, true)); // gut, escaper, 1300
    const DISBELIEF_POTION_LONGLINE = `Грай у будь-який Рейв. Скинь одного монстра: ніхто не отримує від нього душ, а його звук можна буде взяти лише досягнувши успіху на цьому Рейві. Разова карта.`;
    BUGArr.push(new DNEBUGCard("bug-potion-of-disbelief", "Зілля невіри", "/img/bug/bug-potion-of-disbelief.png", DISBELIEF_POTION_LONGLINE, "", 0, 0, true)); // gut, escaper, 1000
    const DEUS_EX_MACHINEGUN_LONGLINE = `Грай у будь-який Рейв, щоб у нього втрутилися розправедники, посланці богів. Вони з особливою жорстокістю обнуляють всіх монстрів і забирають весь звук та рівні. Ти не можеш забрати карту з лайнапу після цього. Разова карта.`;
    BUGArr.push(new DNEBUGCard("bug-deus-ex-machinegun", "Розправедники", "/img/bug/bug-deus-ex-machinegun.png", DEUS_EX_MACHINEGUN_LONGLINE, "", 0, 0, true)); // gut, escaper
    const IN_LOVE_LONGLINE = `Грай у будь-який Рейв, у якому бере участь лише один монстр. Рейв відразу завершується, карт більше грати не можна. Зіграні підсилювачі витрачені, інші разові карти повертаються власникам. Закоханий монстр роздає звук. За годинниковою стрілкою починаючи з гравця, що організував Рейв, здавайте по карті звуку із запасів монстра.`;
    BUGArr.push(new DNEBUGCard("bug-of-love", "Закоханий", "/img/bug/bug-of-love.png", IN_LOVE_LONGLINE, "", 0, 0, true)); // bose, escaper
    // const ILLUSION_LONGLINE = `Грай у будь-який Рейв, скинь одного монстра разом зі всіма накладеними на нього посилювачами. Заміни його монстром на твій вибір.`;
    // BUGArr.push(new DNEBUGCard("bug-illusion", "Ілюзія", "/img/bug/bug-illusion.png", ILLUSION_LONGLINE, "", 0, 0, true)); // bose, escaper
    // const OUT_TO_LUNCH_LONGLINE = `Грай у будь-який Рейв, щоб відправити монстрів на обід. Гравець, який запрошував їх, скидає їхні карти і відразу тягне дві випадкові карти звуку.`;
    // BUGArr.push(new DNEBUGCard("bug-out-to-lunch", "Обідня перерва", "/img/bug/bug-out-to-lunch.png", OUT_TO_LUNCH_LONGLINE, "", 0, 0, true)); // bose, escaper
    // const MOMMY_LONGLINE = `Можна зіграти на монстра 5-го рівня чи нижче. З ним на Рейв приходить такий самий монстр, але на 10 рівнів більше. Мамця - окремий монстр, на якого діють усі підсилювачі дитини. Невдача така сама. За успіх з Мамцею отримай на 1 душу і 1 звук більше, ніж за її дитинча.`;
    // BUGArr.push(new DNEBUGCard("bug-mommy", "Мамця", "/img/bug/bug-mommy.png", MOMMY_LONGLINE, "", 0, 0, true)); // bose, escaper
    // const FRIENDLY_LONGLINE = `Грай у будь-який Рейв. Той, хто запрошував монстрів, може їх скинути забравши звук. Але якщо він хоче їх залишити, після рішення про це він повинен кинути d6 двічі і додати до рівня монстрів суму значень, що випали.`;
    // BUGArr.push(new DNEBUGCard("bug-friendly", "Френдлі", "/img/bug/bug-friendly.png", FRIENDLY_LONGLINE, "", 0, 0, true)); // bose, escaper
    // const TWO_HEADER_LONGLINE = `Грай у будь-який Рейв на будь-якого монстра. Його рівень подвоїться, як і всі бонуси від зіграних карток. Але це, як і раніше, один монстр. Якщо ти таки переможеш, бери вдвічі більше звуку, ніж отримав би від одноголової версії.`;
    // BUGArr.push(new DNEBUGCard("bug-two-headed", "Двоголовий", "/img/bug/bug-two-headed.png", TWO_HEADER_LONGLINE, "", 0, 0, true)); // bose, powerUpper
    // const TYPOGRAPHICAL_ERROR_LONGLINE = `Грай у будь-який Рейв. В опис монстра вкралася друкарська помилка! Його рівень падає<br> до 1-го, а характеристики та нагороди залишаються ті самі.`;
    // BUGArr.push(new DNEBUGCard("bug-typographical-error", "Типуграфічна помилка", "/img/bug/bug-typographical-error.png", TYPOGRAPHICAL_ERROR_LONGLINE, "", 0, 0, true)); // bose, disabler
    // const DEAD_LONGLINE = `Все, Петрухо, цей готовий. Грай на одного монстра щоб зробити його вбитим. Гравець, що запрошував його забирає звук. Душі ніхто не отримує.`;
    // BUGArr.push(new DNEBUGCard("bug-dead", "Вбитий", "/img/bug/bug-dead.png", DEAD_LONGLINE, "", 0, 0, true)); // bose, escaper
    // const ARBITRARY_GAME_BALANCE_LONGLINE = `Гравці які мають найменше душ отримують душу. Потім кожен гравець, у якого три або менше карток Звуку, отримує душу. Ціль проблеми не отримує нічого.`;
    // BUGArr.push(new DNEBUGCard("bug-arbitrary-game-balance", "Майстерське свавілля!", "/img/bug/bug-arbitrary-game-balance.png", ARBITRARY_GAME_BALANCE_LONGLINE, "Проблема!", 0, 0, true));
    // const DRAG_ON_AND_ON_LONGLINE = `До свого наступного ходу (або поки всі не скажуть тобі заткнутись) ти маєш безперервно говорити. Якщо ти замовкнеш довше ніж на пару секунд, ти втратиш дві душі і далі можеш мовчати скільки влізе.`;
    // BUGArr.push(new DNEBUGCard("bug-drag-on-and-on-and-on", "Потік свідомості", "/img/bug/bug-drag-on-and-on-and-on.png", DRAG_ON_AND_ON_LONGLINE, "Проблема!", 0, 0, true));
    // const INCOME_TAX_LONGLINE = `Обери та скинь карту Звуку. Тепер кожен суперник має скинути карту Звуку з бонусом не менше за твою. Ті, кому нічим заплатити податок, скидають усю руку і втрачають душу.`;
    // BUGArr.push(new DNEBUGCard("bug-sound-tax", "Податок на музику", "/img/bug/bug-sound-tax.png", INCOME_TAX_LONGLINE, "Проблема!", 0, 0, true));
    // const EVERYTHING_IS_RELATIVE_LONGLINE = `Усі інші втрачають душу. Виходить, для тебе це і не проблема зовсім, так? Прикро.<br><br>Якщо гравець вміє скасовувати проблеми, він може скасувати цю проблему для себе, але не для інших.`;
    // BUGArr.push(new DNEBUGCard("bug-everything-is-relative", "Все відносно", "/img/bug/bug-everything-is-relative.png", EVERYTHING_IS_RELATIVE_LONGLINE, "Проблема!", 0, 0, true));
    // const PAYROLL_TAX_LONGLINE = `Діє на всіх гравців! Кожен, в кого є Найомнички, має скинути дві карти за кожного Найоничка у своїй крю або скинути Найомничка, за якого не заплатив.`;
    // BUGArr.push(new DNEBUGCard("bug-friendship-tax", "Податок на дружбу", "/img/bug/bug-friendship-tax.png", PAYROLL_TAX_LONGLINE, "Проблема!", 0, 0, true));
    // const LYRICAL_ERROR_LONGLINE = `Останній скинутий монстр повертається на твій Рейв. Якщо на Рейві вже є монстри, він приєднується до них.`;
    // BUGArr.push(new DNEBUGCard("bug-lyrical-error", "Лірична помилка", "/img/bug/bug-lyrical-error.png", LYRICAL_ERROR_LONGLINE, "Проблема!", 0, 0, true));
    // const I_GOT_A_ROCK_LONGLINE = `Всі твої суперники, починаючи з сусіда ліворуч, одразу тягнуть по карті Звуку. Тобі дістається Камінь. Ця карта залишається в тебе, як втілення Каменю. Камінь – одноразовий бонус, який можна кинути у будь-якого гравця, щоб відняти в його лайнапу - 1.`;
    // BUGArr.push(new DNEBUGCard("bug-i-got-a-rock", "Мені дістався булиган!", "/img/bug/bug-i-got-a-rock.png", I_GOT_A_ROCK_LONGLINE, "Проблема!", 0, 0, true));
    const IMPENDING_DOOM_LONGLINE = `Наступна проблема, що діє на іншого гравця, торкнеться і тебе. Нехай ця карта лежить перед тобою, як провісник неминучої долі. Скинь її, коли вона спрацює.`;
    BUGArr.push(new DNEBUGCard("bug-impending-doom", "Невідворотна кара", "/img/bug/bug-impending-doom.png", IMPENDING_DOOM_LONGLINE, "Проблема!", 0, 0, true));
    const LOADED_DIE_LONGLINE = `Грай після свого кидка кубика з будь-якого приводу. Поверни кубик будь-якою гранню нагору: це результат твого кидка. Разова карта.`;
    BUGArr.push(new DNEBUGCard("bug-loaded-die", "Читерський кубик", "/img/bug/bug-loaded-die.png", LOADED_DIE_LONGLINE, "", 0, 0, true)); // 300
    const RELOADED_DIE_LONGLINE = `Грай після того, як інший гравець кинув кубик з будь-якого приводу. Поверни кубик будь-якою гранню вгору: це результат його кидка. Перечитерський кубик б'є читерський чи інший перечитерський. Читерський кубик б'є перечитерський. Яка карта зіграна останньою, та і рулить. Разова карта.`;
    BUGArr.push(new DNEBUGCard("bug-reloaded-die", "Перечитерський кубик", "/img/bug/bug-reloaded-die.png", RELOADED_DIE_LONGLINE, "", 0, 0, true)); // 300
    // const DUNGEON_CASINO_LONGLINE = `Грай будь-якої миті, окрім Рейву. Разова карта.<br>Скинь карти Звуку загальним бонусом не менше 5 і кинь d6:<br>1 - втрать душу;<br>2 - скинь одну карту з руки;<br>3 або 4 - візьми карту Звуку у відкриту;<br>5 - візьми 2 карти;<br>6 - візьми 3;`;
    // BUGArr.push(new DNEBUGCard("bug-dungeon-casino", "Підземне казино", "/img/bug/bug-dungeon-casino.png", DUNGEON_CASINO_LONGLINE, "", 0, 0, true));
    const POTION_OF_APATHY_LONGLINE = `Грай у будь-який Рейв після того, як хтось був обраний Рятівником. Цей гравець втрачає інтерес до Рейва і не бере участі в ньому. Він повертає на руку всі карти, які зіграв. Хост може вибрати іншого Рятівника, якщо є охочі. Разова карта.`;
    BUGArr.push(new DNEBUGCard("bug-potion-of-apathy", "Зілля апатії", "/img/bug/bug-potion-of-apathy.png", POTION_OF_APATHY_LONGLINE, "", 0, 0, true));
    const FELINE_INTERVENTION_LONGLINE = `Грай після того, як будь-хто кине кубик з будь-якого приводу. На кубик стрибає кіт! Цей кидок та всі карти, якими на нього впливали, пропадають. Той, хто кидав кубик, має зробити новий кидок. Разовий прикол.`;
    BUGArr.push(new DNEBUGCard("bug-feline-intervention", "Кицьо-втручання", "/img/bug/bug-feline-intervention.png", FELINE_INTERVENTION_LONGLINE, "", 0, 0, true));
    // const HYPNOTIZE_THE_MERCENARY_LONGLINE = `Грай тільки в тому випадку, якщо хтось має Найомничка. Він стає твоїм. Отримай душу.`;
    // BUGArr.push(new DNEBUGCard("bug-hypnotize-the-support", "Загіпнотизуй Найомничка", "/img/bug/bug-hypnotize-the-support.png", HYPNOTIZE_THE_MERCENARY_LONGLINE, "1UP", 0, 0, true));
    // const PAY_FOR_PIZZA_LONGLINE = ``;
    // BUGArr.push(new DNEBUGCard("bug-pay-for-pizza", "Заплати за піцу", "/img/bug/bug-pay-for-pizza.png", PAY_FOR_PIZZA_LONGLINE, "1UP", 0, 0, true));
    // const WASH_CAR_LONGLINE = ``;
    // BUGArr.push(new DNEBUGCard("bug-wash-gms-car", "Помий машину майстра", "/img/bug/bug-wash-gms-car.png", WASH_CAR_LONGLINE, "1UP", 0, 0, true));
    // const REINCARNATE_LONGLINE = `Замість того щоб отримати душу можеш скинути цю карту будь-якої миті, крім Рейву. Прочеши колоду Класів, обери одну карту і застосуй її.`;
    // BUGArr.push(new DNEBUGCard("bug-reincarnate-without-dying-first", "Реінкарнуй на випередження", "/img/bug/bug-reincarnate-without-dying-first.png", REINCARNATE_LONGLINE, "1UP", 0, 0, true));
    // const SENSELESS_KINDNESS_LONGLINE = `Замість того, щоб отримувати душу, можеш зіграти цю карту на суперника. Він повинен віддати тобі карту Звуку з найбільшим бонусом і отримує душу.`;
    // BUGArr.push(new DNEBUGCard("bug-senseless-act-of-kindness", "Безглузді жести доброї волі", "/img/bug/bug-senseless-act-of-kindness.png", SENSELESS_KINDNESS_LONGLINE, "1UP", 0, 0, true));
    // const SODA_PUNCH_LONGLINE = `Також можеш зіграти цю карту будь-якої миті на будь-якого гравця, щоб він втратив душу. Навіть якщо він вже вирішив, ніби переміг.`;
    // BUGArr.push(new DNEBUGCard("bug-make-gm-snort-soda-out-his-nose", "Змусь майстра поперхнутись колою", "/img/bug/bug-make-gm-snort-soda-out-his-nose.png", SODA_PUNCH_LONGLINE, "1UP", 0, 0, true));
    // const STEAL_THE_CREDIT_LONGLINE = `Грай, коли інший гравець успішно провів Рейв і отримує душі, аби примазатись до його слави.`;
    // BUGArr.push(new DNEBUGCard("bug-steal-credit", "Вкради почесті", "/img/bug/bug-steal-credit.png", STEAL_THE_CREDIT_LONGLINE, "1UP", 0, 0, true));
    // const TAKE_GOOD_WITH_BAD_LONGLINE = `Грай одразу після того, як будь-який гравець втрачає Найомничка.`;
    // BUGArr.push(new DNEBUGCard("bug-take-good-with-bad", "Немає лиха без добра", "/img/bug/bug-take-good-with-bad.png", TAKE_GOOD_WITH_BAD_LONGLINE, "1UP", 0, 0, true));
    // const CONTEMPLATE_YOUR_NAVEL_LONGLINE = `Якщо скинеш всю руку (не менше трьох карт), отримай дві душі замість однієї!`;
    // BUGArr.push(new DNEBUGCard("bug-contemplate-your-navel", "Споглядай пупок", "/img/bug/bug-contemplate-your-navel.png", CONTEMPLATE_YOUR_NAVEL_LONGLINE, "1UP", 0, 0, true));
    // const TEMPORARY_AMNESIA_LONGLINE = `Удар по голові змусив тебе забути свій клас. Переверни свою карту Класу сорочкою вгору. Ти згадаєш це, тільки коли організуєш чи допоможеш організувати Рейв з монстром. До того часу ти будеш у всіх відносинах звичайною людиною без класу.`;
    // BUGArr.push(new DNEBUGCard("bug-temporary-amnesia", "Тимчасова амнезія", "/img/bug/bug-temporary-amnesia.png", TEMPORARY_AMNESIA_LONGLINE, "Проблема!", 0, 0, true));
    // const NEW_EDITION_RULES_LONGLINE = `Діє на всіх гравців! Кожен гравець втрачає душу. Якщо у когось є бажальне кільце, він може його використати, щоб скасувати цю проблему для всіх або деяких гравців(як він забажає).`;
    // BUGArr.push(new DNEBUGCard("bug-new-edition-rules", "Нова редакція правил", "/img/bug/bug-new-edition-rules.png", NEW_EDITION_RULES_LONGLINE, "Проблема!", 0, 0, true));
    // const BO_LONGLINE = `На твоєму наступному Рейві тобі ніхто не допоможе. Якщо ця проблема спіткала тебе під час Рейву, твій Рятівник залишає тебе(без штрафів) і ти маєш вивозити самотужки. Зате Блукаючий ніс біжить від тебе, залишаючи в твоїх пахучих руках весь свій звук.`;
    // BUGArr.push(new DNEBUGCard("bug-bo", "Сморід", "/img/bug/bug-bo.png", BO_LONGLINE, "Проблема!", 0, 0, true));
    // const CURSED_THINGY_LONGLINE = `Одна твоя карта Звуку з найбільшим бонусом стає багнутою. Вона втрачає свій бонус і ти не можеш позбутися її, поки проблема не знята. Інша проблема може зняти баг(наприклад, "Втрать дві карти"). Бажальне кільце знімає баг з карти, повертаючи її бонус. Крім того, цей баг зникає, якщо ти обнулишся. Вчасно, правда?`;
    // BUGArr.push(new DNEBUGCard("bug-cursed-thingy", "Багнута карта", "/img/bug/bug-cursed-thingy.png", CURSED_THINGY_LONGLINE, "Проблема!", 0, 0, true));
    // const GENEROSITY_LONGLINE = `Ти маєш дати кожному супернику по одній карті Звуку зі свого інвентарю. Ті, кому не вистачить, тягнуть наосліп дві карти в тебе з руки. Ти сам вирішуєш, в якому порядку виявлятимеш щедрість.`;
    // BUGArr.push(new DNEBUGCard("bug-generosity", "Щедрість", "/img/bug/bug-generosity.png", GENEROSITY_LONGLINE, "Проблема!", 0, 0, true));
    // const DNA_MOD_LONGLINE = `Можеш випити зілля будь-якої миті, хоч на Рейві, щоб прочесати колоду Класів і вибрати будь-яку карту. Якщо нічого не забороняє тобі зіграти її прямо зараз, можеш одразу зробити це. Разова карта.`;
    // BUGArr.push(new DNEBUGCard("bug-dna-potion", "Зілля модифікації ДНК", "/img/bug/bug-dna-potion.png", DNA_MOD_LONGLINE, "", 0, 0, true)); // 900
    // const HOARD_LONGLINE = `Відразу візьми три карти Звуку так само, як витягнув цю карту, - у відкриту або в закриту.`;
    // BUGArr.push(new DNEBUGCard("bug-hoard", "Ура, клад!", "/img/bug/bug-hoard.png", HOARD_LONGLINE, "", 0, 0, true));
    // const GARAGE_SALE_LONGLINE = `Можеш зіграти цю карту відразу як тільки отримав її чи пізніше у свій хід. Скинь карту Звуку на свій вибір. Потім візьми зі скиду дві будь-які карти, бонус яких не більший за скинуту.`;
    // BUGArr.push(new DNEBUGCard("bug-garage-sale", "Розпродаж", "/img/bug/bug-garage-sale.png", GARAGE_SALE_LONGLINE, "", 0, 0, true));
    const SKILLZ_TOME_LONGLINE = `Можеш прочитати том будь-якої миті, хоч на Рейві, щоб прочесати колоду Класів і вибрати звідти карту класу. Якщо нічого не заважає тобі зіграти її, можеш відразу зробити це. Разова карта.`;
    BUGArr.push(new DNEBUGCard("bug-mighty-tome-of-skillz", "Розумний том вмінь", "/img/bug/bug-mighty-tome-of-skillz.png", SKILLZ_TOME_LONGLINE, "", 0, 0, true));
    const TROJAN_HORSE_LONGLINE = `Грай цю карту разом із картою Звуку, коли суперник успішно організував Рейв і тягнеться за нагородою. Тепер цієї нагороди він не бачить: він знову кидає d20 і має успішно провести новий Рейв, на який приходить монстр на твій вибір. Досягши успіху на новому Рейві, він отримає нагороду за нього за стандартними правилами. Можеш зіграти коня і без карти Звуку, щоб просто позбавити суперника нагороди.`;
    BUGArr.push(new DNEBUGCard("bug-trojan-horse", "Троянський кінь", "/img/bug/bug-trojan-horse.png", TROJAN_HORSE_LONGLINE, "", 0, 0, true));
    // const INFLATABLE_MUNCHKIN_LONGLINE = `Відволікає переслідувачів, дозволяючи тобі та всім, хто був на Рейві, автоматично змитись. Разова карта.`;
    // BUGArr.push(new DNEBUGCard("bug-inflatable-munchkin", "Надувний манчкін", "/img/bug/bug-inflatable-munchkin.png", INFLATABLE_MUNCHKIN_LONGLINE, "", 0, 0, true));
    // const DUCK_OF_MANY_THINGS_LONGLINE = `Зроби наступне, суворо в такому порядку: наосліп витягни карту з руки сусіда зліва; віддай карту на свій вибір сусіду праворуч; візьми верхню карту з будь-якого скиду; заспівай пісеньку; отримай душу; скинь дві карти; скинь цю карту.`;
    // BUGArr.push(new DNEBUGCard("bug-duck-of-many-things", "Роздавайка", "/img/bug/bug-duck-of-many-things.png", DUCK_OF_MANY_THINGS_LONGLINE, "", 0, 0, true));
    const RESTRAINING_ORDER_LONGLINE = `Грай будь-якої миті на будь-якого суперника. До кінця ходу той втрачає право грати на тебе карти, а так само повинен повернути на руку всі вже зіграні карти. Разова карта.`;
    BUGArr.push(new DNEBUGCard("bug-restraining-order", "Заборонна постанова", "/img/bug/bug-restraining-order.png", RESTRAINING_ORDER_LONGLINE, "", 0, 0, true));
    const POTION_OF_COWARDICE_LONGLINE = `Грай у будь-який Рейв, щоб змусити гравців змиватись з нього, навіть якщо вони перевершували очікування аудиторії. Разова карта.`;
    BUGArr.push(new DNEBUGCard("bug-potion-of-cowardice", "Зілля боягузства", "/img/bug/bug-potion-of-cowardice.png", POTION_OF_COWARDICE_LONGLINE, "", 0, 0, true));
    // const COUPON_LONGLINE = `У будь-який момент, окрім Рейва, можеш обміняти цей купон, щоб взяти зі скидання карти Звуку сумарним бонусом не більше 10.`;
    // BUGArr.push(new DNEBUGCard("bug-valuable-coupon", "Купон", "/img/bug/bug-valuable-coupon.png", COUPON_LONGLINE, "", 0, 0, true));
    const AVATAR_LONGLINE = `Грай якщо ти на Рейві без Рятувальника. Можеш покликати на допомогу свого могутнього Аватара, рівень якого дорівнюватиме кількості твоїх душ помноженій на три. Додай його рівень до бонусу твого Лайнапу. Якщо ви досягли успіху, отримуй карти Звуку, але не душі. При невдачі ти змиваєшся автоматично. Разова карта.`;
    BUGArr.push(new DNEBUGCard("bug-avatar", "Аватар", "/img/bug/bug-avatar.png", AVATAR_LONGLINE, "", 0, 0, true));
    // const LUCKY_PENNY_LONGLINE = `Коли інший гравець втрачає карти через Невдачу або Проблему, можеш відразу скинути цю картку і забрати одну з втрачених карток. Разовий прийом.`;
    // BUGArr.push(new DNEBUGCard("bug-lucky-penny", "Щаслива копієчка", "/img/bug/bug-lucky-penny.png", LUCKY_PENNY_LONGLINE, "", 0, 0, true));
    // const TAKE_ME_LONGLINE = `Коли інший гравець отримує право просити допомоги на Рейві, зіграй цю карту, щоб змусити його взяти тебе Рятівником. Ти не можеш вимагати додаткової нагороди за допомогу. Разова карта. До речі, якщо попередній Рятівник вже зіграв якісь карти, він забирає їх назад.`;
    // BUGArr.push(new DNEBUGCard("bug-take-me", "Обери мене!", "/img/bug/bug-take-me.png", TAKE_ME_LONGLINE, "", 0, 0, true));
    // const FILTHY_RICH_LONGLINE = `Грай на Рейві із монстрами. Якщо гравцям дістається їх звук, вони за бажанням можуть скинути будь-які з отриманих карток і взяти стільки ж нових карт(лише один раз).`;
    // BUGArr.push(new DNEBUGCard("bug-filthy-rich", "Безсовісно багатий", "/img/bug/bug-filthy-rich.png", FILTHY_RICH_LONGLINE, "", 0, 0, true));
    const FIND_MAP_LONGLINE = `Грай цю карту в будь-який момент свого ходу, щоб переглянути п'ять верхніх карт у колоді Звуку(або три у будь-якій іншій) і покласти їх назад у будь-якому порядку. Не показуй ці карти іншим гравцям.`;
    BUGArr.push(new DNEBUGCard("bug-find-a-map", "Знайди мапу", "/img/bug/bug-find-a-map.png", FIND_MAP_LONGLINE, "", 0, 0, true));
    // const DECK_OF_TOO_MANY_LONGLINE = `Грай цю карту будь-якої миті свого ходу. Потім скинь з руки скільки завгодно тобі карток Звуку(хоч всі) і в закриту візьми стільки ж нових карт.`;
    // BUGArr.push(new DNEBUGCard("bug-deck-of-too-many-things", "Колода занадто багатьох речей", "/img/bug/bug-deck-of-too-many-things.png", DECK_OF_TOO_MANY_LONGLINE, "", 0, 0, true));
    // const HELP_ME_OUT_THERE_LONGLINE = `Грай у будь-який момент Рейва, щоб наосліп взяти дві карти Звуку у будь-якого суперника. Якщо зараз вони можуть змінити результат Рейва на твою користь, використай їх.`;
    // BUGArr.push(new DNEBUGCard("bug-help-me-out-there", "Допоможи, чим можеш!", "/img/bug/bug-help-me-out-there.png", HELP_ME_OUT_THERE_LONGLINE, "", 0, 0, true));
    // const BAG_OF_CALTROPS_LONGLINE = `Колючки в кармані не сховаєш! Використай колючки під час свого Рейву, щоб заборонити іншим гравцям Підкидати Пасажирів до кінця твого ходу. Або після проваленого кидка змивки, щоб автоматично втекти від відповідальності перед всіма Монстрами. Разова карта.`;
    // BUGArr.push(new DNEBUGCard("bug-of-caltrops", "Колючки", "/img/bug/bug-of-caltrops.png", BAG_OF_CALTROPS_LONGLINE, "", 0, 0, true)); // 200
    // const TRIP_OVER_LONGLINE = `Кожен інший гравець, починаючи з твого сусіда праворуч, може взяти карту Звуку з колоди.`;
    // BUGArr.push(new DNEBUGCard("bug-trip-over-your-own-chest", "Фатальна запинка", "/img/bug/bug-trip-over-your-own-chest.png", TRIP_OVER_LONGLINE, "Проблема!", 0, 0, true));
    // const AGORAPHOBIA_LONGLINE = `Тепер ти боїшся монстрів! Ти не можеш нікому допомагати на Рейвах із монстрами. Якщо допомагаєш з Рейвом і на нього приходить монстр, ти маєш піти з Рейва (без штрафів). Ти нізащо не покличеш монстра на свій Рейв, а якщо хтось підкине пасажира - доведеться змиватись, навіть якщо міг би перемогти. Якщо змивка вдалась, ти переборов Агорафобію, скинь її.`;
    // BUGArr.push(new DNEBUGCard("bug-agoraphobia", "Агорафобія", "/img/bug/bug-agoraphobia.png", AGORAPHOBIA_LONGLINE, "Проблема!", 0, 0, true));
    // const DYING_CURSE_LONGLINE = `Найвищий монстр із скиду творить з тобою свої Неперелавки, і змитись від цього не можна!`;
    // BUGArr.push(new DNEBUGCard("bug-dying-curse", "Посмертна капость", "/img/bug/bug-dying-curse.png", DYING_CURSE_LONGLINE, "", 0, 0, true));
    // const DUCK_OF_DOOM_LONGLINE = `Втрать дві душі, щоб не кортіло надалі підбирати птахів на Рейви.`;
    // BUGArr.push(new DNEBUGCard("bug-duck-of-doom", "Фатальна пташка", "/img/bug/bug-duck-of-doom.png", DUCK_OF_DOOM_LONGLINE, "Проблема!", 0, 0, true));
    // const FOOLS_GOLD_LONGLINE = `Не отримуй Звук за свій наступний Рейв. Якщо ця проблема наздогнала тебе під час Рейву, ти не отримаєш карти Звуку за поточний Рейв.`;
    // BUGArr.push(new DNEBUGCard("bug-fools-gold", "Золото дурнів", "/img/bug/bug-fools-gold.png", FOOLS_GOLD_LONGLINE, "Проблема!", 0, 0, true));
    // const TOURIST_TRAP_LONGLINE = `Ти більше не можеш запрошувати Монстрів. Ця проблема тримається доти, доки не допоможеш іншому гравцеві успішно провести Рейв.`;
    // BUGArr.push(new DNEBUGCard("bug-tourist-trap", "Капкан на туриста", "/img/bug/bug-tourist-trap.png", TOURIST_TRAP_LONGLINE, "Проблема!", 0, 0, true));
    // const LOSE_TWO_CARDS_LONGLINE = `Спочатку лівий сусід тягне у жертви з руки одну карту і залишає її собі, потім те саме робить правий сусід.`;
    // BUGArr.push(new DNEBUGCard("bug-lose-two-cards", "Загуби дві карти", "/img/bug/bug-lose-two-cards.png", LOSE_TWO_CARDS_LONGLINE, "Проблема!", 0, 0, true));
    // const HUNGRY_BACKPACK_LONGLINE = `Наприкінці кожного свого ходу кинь d6. Твій рюкзак зжирає стільки карток в тебе з руки, скільки випало! Карти наосліп витягує і скидає твій сусід зліва. Але якщо випало 6, рюкзак пожере сам себе і зникне, не торкнувшись твоєї руки. Проблема закінчиться.`;
    // BUGArr.push(new DNEBUGCard("bug-hungry-backpack", "Голодний рюкзак", "/img/bug/bug-hungry-backpack.png", HUNGRY_BACKPACK_LONGLINE, "Проблема!", 0, 0, true));
    // const TYPECAST_LONGLINE = `З цією проблемою ти не можеш ні придбати новий Клас, ні скинути поточний. Однак Проблеми та Неперелавки, що позбавляють Класу, можуть позбавити тебе поточного Класу разом з цією проблемою.`;
    // BUGArr.push(new DNEBUGCard("bug-typecast", "Заручник типажу", "/img/bug/bug-typecast.png", TYPECAST_LONGLINE, "Проблема!", 0, 0, true));
    // const BUTTERFINGERS_LONGLINE = `Втрать карту, що дає тобі постійний бонус! Якщо такої немає, скинь три карти з руки, які сусід праворуч обере наосліп.`;
    // BUGArr.push(new DNEBUGCard("bug-butterfingers", "Жирні руки", "/img/bug/bug-butterfingers.png", BUTTERFINGERS_LONGLINE, "Проблема!", 0, 0, true));
    // const REWRITE_CHARACTER_LONGLINE = ``;
    // BUGArr.push(new DNEBUGCard("bug-rewrite-character-sheet", "Перепиши старий брудний аркуш персонажа", "/img/bug/bug-rewrite-character-sheet.png", REWRITE_CHARACTER_LONGLINE, "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-invoke-obscure-rules", "Застосуй незрозумілі правила", "/img/bug/bug-invoke-obscure-rules.png", "", "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-promise-gm-stop-talking", "Обіцяй майстру, що припиниш балачки про свого персонажа", "/img/bug/bug-promise-gm-stop-talking.png", "", "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-half-horse-will-traver", "Маю копита, вирушаю в мандрівку", "/img/bug/bug-half-horse-will-traver.png", "", "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-watch-japanese-monster-movies", "Заціни японське кіно про монстрів", "/img/bug/bug-watch-japanese-monster-movies.png", "", "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-betray-the-party", "Зрадь друзів", "/img/bug/bug-betray-the-party.png", "", "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-potion-of-general-studliness", "Зілля загальної крутизни", "/img/bug/bug-potion-of-general-studliness.png", "", "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-unnecessary-roughness", "Необґрунтована грубість", "/img/bug/bug-unnecessary-roughness.png", "", "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-threaten-switch-systems", "Погрожуй змінити ігрову систему", "/img/bug/bug-threaten-switch-systems.png", "", "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-show-up-early", "Прийди на гру раніше", "/img/bug/bug-show-up-early.png", "", "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-peek-scenario", "Запали сценарій", "/img/bug/bug-peek-scenario.png", REINCARNATE_LONGLINE, "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-hurt-gms-brain", "Винеси мізки майстру", "/img/bug/bug-hurt-gms-brain.png", REINCARNATE_LONGLINE, "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-remember-gms-birthday", "Згадай про днюху майстра", "/img/bug/bug-remember-gms-birthday.png", "", "1UP", 0, 0, true));
    // const SWITCH_CHARACTER_LONGLINE = "Не можеш грати цю карту, якщо ти гравець з найбільшою кількістю душ, або один з них.";
    // BUGArr.push(new DNEBUGCard("bug-switch-character-sheet", "Махнись аркушами персонажа", "/img/bug/bug-switch-character-sheet.png", SWITCH_CHARACTER_LONGLINE, "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-whine-at-gm", "Поплачся майстру", "/img/bug/bug-whine-at-gm.png", SWITCH_CHARACTER_LONGLINE, "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-buy-gm-new-miniatures", "Придбай майстру нові міньки", "/img/bug/bug-buy-gm-new-miniatures.png", "", "1UP", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-illustrate-your-character", "Намалюй свого персонажа", "/img/bug/bug-illustrate-your-character.png", "", "1UP", 0, 0, true));
    // const SELL_YOUR_MOTHER_LONGLINE = `Ну а що? Користі на Рейві від неї ніякої, а тут цілу душу дають! Половина нагороди за успішний Рейв, якщо комусь незрозуміло!`;
    // BUGArr.push(new DNEBUGCard("bug-sell-your-mother", "Продай свою матір!", "/img/bug/bug-sell-your-mother.png", SELL_YOUR_MOTHER_LONGLINE, "1UP", 0, 0, true));
    // const INEPT_LONGLINE = `До кінця свого наступного ходу ти не можеш використовувати переваги своїх Найомничків, навіть якщо зміниш їх. Тримай цю карту перед собою доки не перестане діяти.`;
    // BUGArr.push(new DNEBUGCard("bug-inept", "Дилетант", "/img/bug/bug-inept.png", INEPT_LONGLINE, "Проблема!", 0, 0, true));
    // const LOSE_YOUR_CREW_LONGLINE = `Скинь усіх своїх Найомничків. Втрать душу.`;
    // BUGArr.push(new DNEBUGCard("bug-lose-your-crew", "Втрать крюху!", "/img/bug/bug-lose-your-crew.png", LOSE_YOUR_CREW_LONGLINE, "Проблема!", 0, 0, true));
    // const CHANGE_CREW_LONGLINE = `Якщо в тебе немає Найомничків, ця проблема не діє. Якщо є, віддай їх гравцю з найменшою кількістю Найомничків(спір вирішуйте кидком d6). Натомість отримай від нього всіх його Найомничків, крім одного, на його вибір. Якщо в нього Найомничків не було, візьми випадкового з колоди.`;
    // BUGArr.push(new DNEBUGCard("bug-change-crew", "Махнись крюхами", "/img/bug/bug-change-crew.png", CHANGE_CREW_LONGLINE, "Проблема!", 0, 0, true));
    // const RATION_SPOILED_LONGLINE = `Діє на всіх гравців! Кожний, в кого є Найомнички, кидає d6. Той хто викинув менше інших, відправляє свого Найомничка за хавчиком. До кінця партії він не повернеться, скинь його.`;
    // BUGArr.push(new DNEBUGCard("bug-ration-spoiled", "Їжа зіпсована!", "/img/bug/bug-ration-spoiled.png", RATION_SPOILED_LONGLINE, "Проблема!", 0, 0, true));
    // const MISPLACE_YOUR_CREW_LONGLINE = `На початку кожного свого ходу ти кидаєш d6 і скидуєш стільки Найомничків, скільки випало. Повторюй до тих пір доки не втратиш їх усіх, або не викинеш 6, після цього проблема зникне. Тримай цю карту перед собою, доки не перестане діяти.`;
    // BUGArr.push(new DNEBUGCard("bug-misplace-your-crew", "Виродження крюхи", "/img/bug/bug-misplace-your-crew.png", MISPLACE_YOUR_CREW_LONGLINE, "Проблема!", 0, 0, true));
    // const YOU_ARE_NOT_SPECIAL_LONGLINE = `Скинь з гри одного Найомничка на вибір сусіда праворуч. Втрать душу.`;
    // BUGArr.push(new DNEBUGCard("bug-you-are-not-so-special", "Не такий вже ти і особливий", "/img/bug/bug-you-are-not-so-special.png", YOU_ARE_NOT_SPECIAL_LONGLINE, "Проблема!", 0, 0, true));
    // const TRULY_OBNOXIOUS_CURSE_LONGLINE = `Діє на всіх гравців! Скинь карту Звуку з найбільшим бонусом та карту, що дає тобі постійний бонус чи має особливу властивість, якщо в тебе така є. Так, це жорстко. Бажальне кільце тобі в поміч.`;
    // BUGArr.push(new DNEBUGCard("bug-truly-obnoxious-curse", "Нестерпно жахлива проблема!", "/img/bug/bug-truly-obnoxious-curse.png", TRULY_OBNOXIOUS_CURSE_LONGLINE, "Проблема!", 0, 0, true));
    // const SNAIL_MAIL_LONGLINE = `Якщо маєш карту, що дає тобі постійний бонус чи має особливі властивість, скинь її. Якщо нічого такого немає, твій одяг зникає, від сором'язливості ти автоматично провалюєш свій наступний кидок на змивку. Залиш цю карту перед собою, щоб не забути.`;
    // BUGArr.push(new DNEBUGCard("bug-snail-mail", "Одяг равлобився", "/img/bug/bug-snail-mail.png", SNAIL_MAIL_LONGLINE, "", 0, 0, true));
    // const BAG_OF_HOLDING_LONGLINE = `Скинь карту Звуку з бонусом 5 або більше. Якщо такої нема, до кінця гри тримай в руці на одну карту меньше. Бажальне кільце тобі в поміч...`;
    // BUGArr.push(new DNEBUGCard("bug-of-holding", "Баг утримання", "/img/bug/bug-of-holding.png", BAG_OF_HOLDING_LONGLINE, "Проблема!", 0, 0, true));
    // const LOSE_BIG_ITEM_LONGLINE = `Якщо маєш карту, що дає тобі постійний бонус чи має особливі властивість, скинь її. Якщо нічого такого нема, покажи всю руку та скинь карту з найбільшим бонусом.`;
    // BUGArr.push(new DNEBUGCard("bug-lose-big-item", "Втрать сильний айтем", "/img/bug/bug-lose-big-item.png", LOSE_BIG_ITEM_LONGLINE, "Проблема!", 0, 0, true));
    // const CHICKEN_ON_YOUR_HEAD_LONGLINE = `-1 до всіх твоїх кидків кубика. Будь-яка карта, що примушує тебе скинути карту з постійними бонусом чи особливою властивістю, забирає і курку. Якщо раптом твого Найомничка відправляють за хавчиком, скинь курку замість нього)))`;
    // BUGArr.push(new DNEBUGCard("bug-chicken-on-your-head", "Курка на башті", "/img/bug/bug-chicken-on-your-head.png", CHICKEN_ON_YOUR_HEAD_LONGLINE, "Проблема!", 0, 0, true));
    // const RAIN_OF_WEASELS_LONGLINE = `Діє на всіх гравців! Скиньте усіх своїх Найомничків у центр столу сорочкою догори. Кожен, починаючи з гравця, на якого була використана проблема, кидає d6 та забирає стільки Найомничків скільки випало, доки вони не закінчаться.`;
    // BUGArr.push(new DNEBUGCard("bug-rain-of-weasels", "Буде ласковий дощ", "/img/bug/bug-rain-of-weasels.png", RAIN_OF_WEASELS_LONGLINE, "Проблема!", 0, 0, true));
    // const CHANGE_EVERYTHING_LONGLINE = `Якщо в тебе є Клас, скинь його. Після чого візьми верхню карту з колоди Класів і застосуй її. Якщо в тебе є Найомнички, віддай їх гравцю з найменшою кількістю Найомничків(спір вирішуйте кидком d6). Натомість отримай від нього всіх його Найомничків, крім одного, на його вибір. Якщо в нього Найомничків не було, візьми випадкового з колоди.`;
    // BUGArr.push(new DNEBUGCard("bug-change-everything", "Зміни все", "/img/bug/bug-change-everything.png", CHANGE_EVERYTHING_LONGLINE, "Проблема!", 0, 0, true));
    // const LOSE_EVERYTHING_LONGLINE = `Тебе обнулили, твій хід закінчено. Скинь всі карти та душу. Інші гравці можуть взяти по одному з твоїх Найомничків. Наступного ходу можеш взяти нові карти та продовжити гру, якщо хочеш. Спробуй втекти від своє долі кинувши d6, викинеш 5 або 6, вдача на твоєму боці. Якщо ні... Бажальне кільце тобі в поміч.`;
    // BUGArr.push(new DNEBUGCard("bug-loose-everything", "Втрать все", "/img/bug/bug-loose-everything.png", LOSE_EVERYTHING_LONGLINE, "Проблема!", 0, 0, true));
    // const MALIGN_MIRROR_LONGLINE = `Все викривлено! У своєму наступному Рейві(і тільки в ньому) ти не можеш використовувати переваги своїх Найомничків та Класу. А рівень очікувань визначатиме результат кидка d20 віднятий від 20. Знайдеш Бажальне Кільце до Рейву, зможеш зняти цю проблему.`;
    // BUGArr.push(new DNEBUGCard("bug-malign-mirror", "Криве дзеркало", "/img/bug/bug-malign-mirror.png", MALIGN_MIRROR_LONGLINE, "Проблема!", 0, 0, true));
    // const BAD_STEED_FEED_LONGLINE = `Схоже пара твоїх Найомничків прихворіли. У цій грі можеш на них не розраховувати. Скинь їх.`;
    // BUGArr.push(new DNEBUGCard("bug-bad-steed-feed", "Магічна хвороба", "/img/bug/bug-bad-steed-feed.png", BAD_STEED_FEED_LONGLINE, "Проблема!", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-lose-soul", "Втрать душу", "/img/bug/bug-lose-soul.png", "", "Проблема!", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-lose-two-souls", "Втрать дві душі", "/img/bug/bug-lose-two-souls.png", "", "Проблема!", 0, 0, true));
    const VOODOO_DOLL_LONGLINE = `В тебе є три голки, кожна може змусити іншого гравця втратити душу, Найомничка або рису. Скажи як ти їх використаєш, коли активуєш цю карту.`;
    BUGArr.push(new DNEBUGCard("bug-voodoo-doll", "Кукла Вуду", "/img/bug/bug-voodoo-doll.png", VOODOO_DOLL_LONGLINE, "Проблема!", 0, 0, true));
    // const FLYPAPER_FLOORS_LONGLINE = `Діє на всіх гравців до самого кінця гри(якщо тільки не буде знято Бажальним Кільцем). У всіх -1 на Змивку.`;
    // BUGArr.push(new DNEBUGCard("bug-flypaper-floors", "Липка підлога", "/img/bug/bug-flypaper-floors.png", FLYPAPER_FLOORS_LONGLINE, "Проблема!", 0, 0, true));
    // const CLUMSY_LONGLINE = `В тебе -1 на Змивку, доки не позбудешся цієї проблеми.`;
    // BUGArr.push(new DNEBUGCard("bug-clumsy", "Крихкі кістки", "/img/bug/bug-clumsy.png", CLUMSY_LONGLINE, "Проблема!", 0, 0, true));
    // const CURSED_ITEM_LONGLINE = `Одна твоя карта, що дає тобі постійний бонус чи особливу властивість стає багнутою. Вона втрачає свій бонус і ти не можеш позбутися її, поки проблема не знята. Інша проблема може зняти баг(наприклад, "Коростяний порошок"). Бажальне кільце знімає баг з карти, повертаючи її бонус. Крім того, цей баг зникає, якщо ти обнулишся. Вчасно, правда?`;
    // BUGArr.push(new DNEBUGCard("bug-cursed-item", "Багнутий айтем", "/img/bug/bug-cursed-item.png", CURSED_ITEM_LONGLINE, "Проблема!", 0, 0, true));
    // const SEMIFINAL_STRIKE_LONGLINE = `Обери одну карту звуку в твоєму лайнапі, її бонус потроюється. Після Рейву кинь d6. Якщо випало 6, поверни її разом з однією картою, що забираєш після Рейву зазвичай. Разова карта.`;
    // BUGArr.push(new DNEBUGCard("bug-semi-final-drop", "Передостанній дроп", "/img/bug/bug-semi-final-drop.png", SEMIFINAL_STRIKE_LONGLINE, "", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-loaded-die-2", "Читерський кубик", "/img/bug/bug-loaded-die-2.png", LOADED_DIE_LONGLINE, "", 0, 0, true)); // 500
    // BUGArr.push(new DNEBUGCard("bug-loaded-die-3", "Читерський кубик", "/img/bug/bug-loaded-die-3.png", LOADED_DIE_LONGLINE, "", 0, 0, true)); // 500
    const ANNIHILATION_LONGLINE = `Грай цю карту будь-якої миті, щоб перманентно прибрати будь-яку карту з гри. Вона не йде у скид.. сховай її назад у коробку та забудь про неї.<br>Ціль має бути зіграна, коли ти використовуєш Анігіляцію на неї. Як тільки суперник зіграв її, вона була анігільована та не мала жодного ефекту.`;
    BUGArr.push(new DNEBUGCard("bug-annihilation", "Анігіляція", "/img/bug/bug-annihilation.png", ANNIHILATION_LONGLINE, "", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-reloaded-die-2", "Перечитерський кубик", "/img/bug/bug-reloaded-die-2.png", RELOADED_DIE_LONGLINE, "", 0, 0, true)); // 300
    const GREEN_CHAOS_LONGLINE = `Використай в будь-який Рейв. Отримай вдвічі більше карт Звуку за успіх.`;
    BUGArr.push(new DNEBUGCard("bug-green-chaos", "Смарагд хаосу", "/img/bug/bug-green-chaos.png", GREEN_CHAOS_LONGLINE, "", 0, 0, true));

    // отсеяно давно
    // const WANDERING_MONSTER_LONGLINE_8 = `Грай у будь-який Рейв,<br>скинувши душу.<br>Прочухай колоду найвищої складності, обери двох монстрів та закинь їх в цей Рейв.`;
    // BUGArr.push(new DNEBUGCard("bug-wandering-monster-8", "Бродяча тварина", "/img/bug/bug-wandering-monster-8.png", WANDERING_MONSTER_LONGLINE_8, "", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-wandering-monster-9", "Бродяча тварина", "/img/bug/bug-wandering-monster-9.png", WANDERING_MONSTER_LONGLINE, "", 0, 0, true));
    // const DOGPILE_LONGLINE_2 = `Грай у будь-який Рейв(можна у свій). Потім решта гравців може скинути по одній карті Звуку, щоб запросити на Рейв по монстру за кожну. Склади їх рівні з очікуваннями. При невдачі гравець робить окремі кидки змивки для кожного.`;
    // BUGArr.push(new DNEBUGCard("bug-dogpile-2", "Купа мала", "/img/bug/bug-dogpile-2.png", DOGPILE_LONGLINE_2, "", 0, 0, true));
    // BUGArr.push(new DNEBUGCard("bug-monster-mash-2", "Тому що ми банда!", "/img/bug/bug-monster-mash-2.png", MONSTER_MASH_LONGLINE, "", 0, 0, true));
    // const EXPLODING_KNEECAPS_LONGLINE = `Втрать душу. Якщо ти носиш щось на колінах(наприклад, наколінники розводу), втрать цю карту і 2 душі.`;
    // BUGArr.push(new DNEBUGCard("bug-shot-in-the-knee", "Постріл в коліно", "/img/bug/bug-shot-in-the-knee.png", EXPLODING_KNEECAPS_LONGLINE, "Проблема!", 0, 0, true));
    // const LOSE_TOUR_LUCKY_DIE_LONGLINE = `Втрать душу! Якщо в тебе по життю є щасливий кубик, прибери його з очей геть і не торкайся до нього, не застосовуй його жодним іншим способом, навіть не дивися на нього до кінця партії!`;
    // BUGArr.push(new DNEBUGCard("bug-lose-your-lucky-die", "Загубив щасливий кубик", "/img/bug/bug-lose-your-lucky-die.png", LOSE_TOUR_LUCKY_DIE_LONGLINE, "Проблема!", 0, 0, true));
    // const BUSY_MONSTERS_LONGLINE = `Грай цю карту в будь-який Рейв із монстрами. В них гра, рейвити їм ніколи, а полізеш нахабно - зачинять двері. Тим часом, монстр, що програє, згоден обміняти карти звуку на душі. Скинь скільки завгодно душ, щоб отримати три карти звуку за кожну.`;
    // BUGArr.push(new DNEBUGCard("bug-monsters-are-busy", "Зайняті монстри", "/img/bug/bug-monsters-are-busy.png", BUSY_MONSTERS_LONGLINE, "", 0, 0, true));
    // const SHOES_UNTIED_LONGLINE = `Найбільш бородатий трюк із підручника. Але досі працює – тому й у підручнику. Грай у будь-який Рейв. +3 будь-якому лайнапу. Разовий прикол.`;
    // BUGArr.push(new DNEBUGCard("bug-your-shoes-untied", "В тебе шнурок розв'язався", "/img/bug/bug-your-shoes-untied.png", SHOES_UNTIED_LONGLINE, "", 3, 0, true));
    // const ROYAL_OIL_LONGLINE = `Грай у будь-який Рейв. +3 будь-якому лайнапу. Разовий прикол.`;
    // BUGArr.push(new DNEBUGCard("bug-royal-oil", "Царське масло", "/img/bug/bug-royal-oil.png", ROYAL_OIL_LONGLINE, "", 3, 0, true)); // 100
    // const OIL_OF_BOILING_LONGLINE = `Грай у будь-який Рейв. +3 будь-якому лайнапу. +5 якщо ти Дракононароджений. Разовий прикол.`;
    // BUGArr.push(new DNEBUGCard("bug-oil-of-boiling", "Коктейль Молотова", "/img/bug/bug-oil-of-boiling.png", OIL_OF_BOILING_LONGLINE, "", 3, 0, true)); // 200
    // const DRUID_FLUID_LONGLINE = `Грай у будь-який Рейв. +3 будь-якому лайнапу. Разовий прикол.`;
    // BUGArr.push(new DNEBUGCard("bug-druid-fluid", "Друїдський фреш", "/img/bug/bug-druid-fluid.png", DRUID_FLUID_LONGLINE, "", 3, 0, true)); // 100
    // const YUPPIE_WATER_LONGLINE = `Грай у будь-який Рейв. +2 будь-якому Лайнапу. Та +4 для кожного Прибульця на Рейві. Разовий прикол.`;
    // BUGArr.push(new DNEBUGCard("bug-yuppie-water", "Япічка", "/img/bug/bug-yuppie-water.png", YUPPIE_WATER_LONGLINE, "", 2, 0, true)); // 100
    // const LIQUID_WENCH_LONGLINE = `Грай у будь-який Рейв для привернення уваги. +3 будь-якому лайнапу. За бажанням запроси Монстра 3-го рівня або менше, не скидуючи карти Звуку. Разовий прикол.`;
    // BUGArr.push(new DNEBUGCard("bug-liquid-wench", "Мокра мавка", "/img/bug/bug-liquid-wench.png", LIQUID_WENCH_LONGLINE, "", 3, 0, true)); // 400
    // const LEMMING_JUICE_LONGLINE = `Подавай охолодженим для вгамування спраги. +3 будь-якому лайнапу. Разовий прикол.`;
    // BUGArr.push(new DNEBUGCard("bug-lemming-juice", "Леммінгнад", "/img/bug/bug-lemming-juice.png", LEMMING_JUICE_LONGLINE, "", 3, 0, true)); // 100
    // const MONSTER_CHOW_LONGLINE = `А ось смакотки кому?! Корм приваблює Монстрів... +5 будь-якому лайнапу. Разовий прикол.`;
    // BUGArr.push(new DNEBUGCard("bug-monster-chow", "Монстрокорм", "/img/bug/bug-monster-chow.png", MONSTER_CHOW_LONGLINE, "", 5, 0,  true)); // 300
    // const POISONBERRY_SYRUP_LONGLINE = `Грай у будь-який Рейв. +5 будь-якому лайнапу. Разовий прикол.`;
    // BUGArr.push(new DNEBUGCard("bug-poisonberry-syrup", "Ядожиновий сироп", "/img/bug/bug-poisonberry-syrup.png", POISONBERRY_SYRUP_LONGLINE, "", 5, 0, true)); // 400
    // const HOT_PEPPER_SAUCE_LONGLINE = `Грай у будь-який Рейв. Це пекуче зілля дає +3 будь-якому Лайнапу, а якщо у справі Дракононароджений, то всі +6. Разова карта`;
    // BUGArr.push(new DNEBUGCard("bug-hot-pepper-sauce", "Гострий соус", "/img/bug/bug-hot-pepper-sauce.png", HOT_PEPPER_SAUCE_LONGLINE, "", 0, 0, true)); // 300
    // const SCROLL_OF_DEBUFFING_LONGLINE = `Грай у будь-який Рейв, щоб скинути всіх Монстрів та підсилювачі лайнапу, окрім зіграних тобою та твоїм Рятівником, якщо він був.`;
    // BUGArr.push(new DNEBUGCard("bug-of-debuffination", "Дебафінація", "/img/bug/bug-of-debuffination.png", SCROLL_OF_DEBUFFING_LONGLINE, "", 0, 0, true)); // 900
    // const THEME_MUSIC_LONGLINE = `Куди б ти не йшов, мелодія йде за тобою п'ятами, дратуючи як ворогів, так і друзів. Якщо хочеш, підспівуй.`;
    // BUGArr.push(new DNEBUGCard("bug-theme-music", "Тема героя", "/img/bug/bug-theme-music.png", THEME_MUSIC_LONGLINE, "+5 для DJ", 2, 0, false));
    // const THE_OTHER_RING_LONGLINE = `Можеш автоматично змитись з будь-якого Рейву(які б інші карти на тебе не впливали), але при цьому ти втратиш душу. Також можеш скинути цю карту, щоб повернути іншому гравцеві будь-яку зіграну ним карту(як бажальним кільцем).`;
    // BUGArr.push(new DNEBUGCard("bug-other-ring", "Інше кільце", "/img/bug/bug-other-ring.png", THE_OTHER_RING_LONGLINE, "", 2, 0, false)); // 1000
    // const MAGNIFICENT_HAT_LONGLINE = `Ця сяюча шапка відбиває проблеми. Щоразу, коли по тобі б'є Проблема, кожен твій суперник кидає d6, і проблема діє на того, хто викинув найменший результат.`;
    // BUGArr.push(new DNEBUGCard("bug-magnificent-hat", "Шапка величності", "/img/bug/bug-magnificent-hat.png", MAGNIFICENT_HAT_LONGLINE, "", 2, 0, false)); // 900
    // const REVEALING_COSTUME_LONGLINE = `Приваблюєш монстрів. І тобі все одно, чи залишаються вони ощасливленими від побаченого чи ні. При кожній зміні статі костюм рветься у найвідвертіших місцях, збільшуючи бонус на 1.`;
    // BUGArr.push(new DNEBUGCard("bug-revealing-costume", "Викриваючий костюм", "/img/bug/bug-revealing-costume.png", REVEALING_COSTUME_LONGLINE, "", 3, 0, false)); // 600
    // const HALO_LONGLINE = `Якщо ти обнуляєшся з німбом, не скидай його. Коли твої суперники закінчать мародерство, можеш скинути його та не витрачати душу на відродження. Візьми п'ять карток Звуку, випадкову карту Класу і продовжуй хід, ніби нічого не сталося.`;
    // BUGArr.push(new DNEBUGCard("bug-halo", "Німб", "/img/bug/bug-halo.png", HALO_LONGLINE, "", 2, 0, false)); // 700
    // const HORSEWHIP_LONGLINE = ``;
    // BUGArr.push(new DNEBUGCard("bug-horsewhip", "Погоняло", "/img/bug/bug-horsewhip.png", HORSEWHIP_LONGLINE, "+3 для жінок", 1, 0, false)); // 200
    // const IMPRESSIVE_TITLE_LONGLINE = ``;
    // BUGArr.push(new DNEBUGCard("bug-really-impressive-title", "Реально вражаючий титул", "/img/bug/bug-really-impressive-title.png", IMPRESSIVE_TITLE_LONGLINE, "", 3, 0, false));
    // const RAINCOAT_LONGLINE = `Іншим гравцям не можна грати зілля у твій Рейв. Виключення - твій Рятівник, якщо він є.`;
    // BUGArr.push(new DNEBUGCard("bug-raincoat", "Дощовик", "/img/bug/bug-raincoat.png", RAINCOAT_LONGLINE, "", 0, 0, false)); // 100
    // const ITCHING_POWDER_LONGLINE = `Грай будь-якої миті. Жертва має скинути будь-який предмет одягу(або інший артефакт, що дає їй постійний бонус) на твій вибір. Разова карта.`;
    // BUGArr.push(new DNEBUGCard("bug-itching-powder", "Коростяний порошок", "/img/bug/bug-itching-powder.png", ITCHING_POWDER_LONGLINE, "", 0, 0, true)); // 200
    // const UNCORKED_LONGLINE = `Покажи свою руку і скинь усі свої разові карти з гри та з руки.`;
    // BUGArr.push(new DNEBUGCard("bug-uncorked", "Розкупорка", "/img/bug/bug-uncorked.png", UNCORKED_LONGLINE, "Проблема!", 0, 0, true));
    // const GENDER_BLENDER_LONGLINE = `Поки не позбудешся цієї проблеми, у тебе немає статі (це не так вже й погано - зате ти не схильний до зміни статі).`;
    // BUGArr.push(new DNEBUGCard("bug-gender-blender", "Гендер-блендер", "/img/bug/bug-gender-blender.png", GENDER_BLENDER_LONGLINE, "Проблема!", 0, 0, true));
    // const DWARVEN_ALE_LONGLINE = `-4 для твого наступного(або поточного) Лайнапу, якщо тільки ти не Олів'є, тоді ця "проблема" дасть тобі +4.`;
    // BUGArr.push(new DNEBUGCard("bug-french-ale", "Французький ель", "/img/bug/bug-french-ale.png", DWARVEN_ALE_LONGLINE, "Проблема!", 0, 0, true));
    // const CHANGE_SEX_LONGLINE = `-5 для твого наступного Лайнапу, через сум'яття. Після цього штрафів не буде, але стать залишиться зміненою.`;
    // BUGArr.push(new DNEBUGCard("bug-change-sex", "Зміна статі", "/img/bug/bug-change-sex.png", CHANGE_SEX_LONGLINE, "Проблема!", 0, 0, true));
    // const DONT_CALL_ME_SHIRLEY_LONGLINE = `Зміни стать. ${CHANGE_SEX_LONGLINE}`;
    // BUGArr.push(new DNEBUGCard("bug-dont-call-me-shirley", "Не клич мене крихіткою!", "/img/bug/bug-dont-call-me-shirley.png", DONT_CALL_ME_SHIRLEY_LONGLINE, "Проблема!", 0, 0, true));

    return BUGArr;
}

const DNEBUGArr = initBUGArr();

const DNESecretCards = {
    monsters: DNEMonsterArr,
    bug: DNEBUGArr,
    smiths: [],
    mafia: []
}

export { DNECards, DNESecretCards };
